[
  {
    "id": 41457,
    "type": "anime",
    "title": "86",
    "title_english": "86 Eighty-Six",
    "title_japanese": "86―エイティシックス―",
    "image": "https://cdn.myanimelist.net/images/anime/1987/117507.jpg",
    "synopsis": "According to the Republic of San Magnolia, their ongoing war against the Giadian Empire has no casualties—however, that is mere propaganda. While the silver-haired Alba of the Republic's eighty-five sectors live safely behind protective walls, those of different appearances are interned in a secret eighty-sixth faction. Known within the military as the Eighty-Six, they are forced to fight against the Empire's autonomous Legion under the command of the Republican \"Handlers.\"\n\nVladilena Milizé is assigned to the Spearhead squadron to replace their previous Handler. Shunned by her peers for being a fellow Eighty-Six supporter, she continues to fight against their inhumane discrimination. Shinei Nouzen is the captain of the Spearhead squadron. Infamous for being the sole survivor of every squadron he's been in, he insists on shouldering the names and wishes of his fallen comrades. When the fates of these young souls from two different worlds collide, will it ignite the spark that lights their path to salvation, or will they burn themselves in the flames of despair?\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Drama",
      "Sci-Fi"
    ],
    "themes": [
      "Mecha",
      "Military"
    ]
  },
  {
    "id": 57892,
    "type": "anime",
    "title": "Hazurewaku no \"Joutai Ijou Skill\" de Saikyou ni Natta Ore ga Subete wo Juurin suru made",
    "title_english": "Failure Frame: I Became the Strongest and Annihilated Everything With Low-Level Spells",
    "title_japanese": "ハズレ枠の【状態異常スキル】で最強になった俺がすべてを蹂躙するまで",
    "image": "https://cdn.myanimelist.net/images/anime/1914/143630.jpg",
    "synopsis": "When loner Touka Mimori is summoned to another world alongside his classmates, he obtains the power to inflict status ailments, such as paralysis or poison, on his enemies. Unfortunately for him, skills of this nature are considered useless due to their low success rate, and Touka is thus assigned the title of E-rank hero. Things take a further turn for the worse when Vicius, the goddess who summoned the class, reveals that the lowest-ranked hero will be disposed of so that they do not hinder those with greater talent.\n\nBanished to a notoriously dangerous area, Touka comes face-to-face with death after being cornered by a minotaur-like creature. In a desperate attempt to survive, he uses his supposedly worthless skill—only to quickly realize that it works almost every time. Armed with the ability to render the monsters standing in his way completely helpless, Touka resolves to track down the goddess that tossed him aside and exact his revenge.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": [
      "Isekai"
    ]
  },
  {
    "id": 11061,
    "type": "anime",
    "title": "Hunter x Hunter (2011)",
    "title_english": "Hunter x Hunter",
    "title_japanese": "HUNTER×HUNTER（ハンター×ハンター）",
    "image": "https://cdn.myanimelist.net/images/anime/1337/99013.jpg",
    "synopsis": "Hunters devote themselves to accomplishing hazardous tasks, all from traversing the world's uncharted territories to locating rare items and monsters. Before becoming a Hunter, one must pass the Hunter Examination—a high-risk selection process in which most applicants end up handicapped or worse, deceased.\n\nAmbitious participants who challenge the notorious exam carry their own reason. What drives 12-year-old Gon Freecss is finding Ging, his father and a Hunter himself. Believing that he will meet his father by becoming a Hunter, Gon takes the first step to walk the same path.\n\nDuring the Hunter Examination, Gon befriends the medical student Leorio Paladiknight, the vindictive Kurapika, and ex-assassin Killua Zoldyck. While their motives vastly differ from each other, they band together for a common goal and begin to venture into a perilous world.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": []
  },
  {
    "id": 37450,
    "type": "anime",
    "title": "Seishun Buta Yarou wa Bunny Girl Senpai no Yume wo Minai",
    "title_english": "Rascal Does Not Dream of Bunny Girl Senpai",
    "title_japanese": "青春ブタ野郎はバニーガール先輩の夢を見ない",
    "image": "https://cdn.myanimelist.net/images/anime/1301/93586.jpg",
    "synopsis": "The rare and inexplicable Puberty Syndrome is thought of as a myth. It is a rare disease which only affects teenagers, and its symptoms are so supernatural that hardly anyone recognizes it as a legitimate occurrence. However, high school student Sakuta Azusagawa knows from personal experience that it is very much real, and happens to be quite prevalent in his school.\n\nMai Sakurajima is a third-year high school student who gained fame in her youth as a child actress, but recently halted her promising career for reasons unknown to the public. With an air of unapproachability, she is well known throughout the school, but none dare interact with her—that is until Sakuta sees her wandering the library in a bunny girl costume. Despite the getup, no one seems to notice her, and after confronting her, he realizes that she is another victim of Puberty Syndrome. As Sakuta tries to help Mai through her predicament, his actions bring him into contact with more girls afflicted with the elusive disease.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance",
      "Supernatural"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 34572,
    "type": "anime",
    "title": "Black Clover",
    "title_english": "Black Clover",
    "title_japanese": "ブラッククローバー",
    "image": "https://cdn.myanimelist.net/images/anime/2/88336.jpg",
    "synopsis": "Asta and Yuno were abandoned at the same church on the same day. Raised together as children, they came to know of the \"Wizard King\"—a title given to the strongest mage in the kingdom—and promised that they would compete against each other for the position of the next Wizard King. However, as they grew up, the stark difference between them became evident. While Yuno is able to wield magic with amazing power and control, Asta cannot use magic at all and desperately tries to awaken his powers by training physically.\n\nWhen they reach the age of 15, Yuno is bestowed a spectacular Grimoire with a four-leaf clover, while Asta receives nothing. However, soon after, Yuno is attacked by a person named Lebuty, whose main purpose is to obtain Yuno's Grimoire. Asta tries to fight Lebuty, but he is outmatched. Though without hope and on the brink of defeat, he finds the strength to continue when he hears Yuno's voice. Unleashing his inner emotions in a rage, Asta receives a five-leaf clover Grimoire, a \"Black Clover\" giving him enough power to defeat Lebuty. A few days later, the two friends head out into the world, both seeking the same goal—to become the Wizard King!\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Fantasy"
    ],
    "themes": []
  },
  {
    "id": 1575,
    "type": "anime",
    "title": "Code Geass: Hangyaku no Lelouch",
    "title_english": "Code Geass: Lelouch of the Rebellion",
    "title_japanese": "コードギアス 反逆のルルーシュ",
    "image": "https://cdn.myanimelist.net/images/anime/1032/135088.jpg",
    "synopsis": "In the year 2010, the Holy Empire of Britannia is establishing itself as a dominant military nation, starting with the conquest of Japan. Renamed to Area 11 after its swift defeat, Japan has seen significant resistance against these tyrants in an attempt to regain independence.\n\nLelouch Lamperouge, a Britannian student, unfortunately finds himself caught in a crossfire between the Britannian and the Area 11 rebel armed forces. He is able to escape, however, thanks to the timely appearance of a mysterious girl named C.C., who bestows upon him Geass, the \"Power of Kings.\" Realizing the vast potential of his newfound \"power of absolute obedience,\" Lelouch embarks upon a perilous journey as the masked vigilante known as Zero, leading a merciless onslaught against Britannia in order to get revenge once and for all.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Award Winning",
      "Drama",
      "Sci-Fi"
    ],
    "themes": [
      "Mecha",
      "Military",
      "School",
      "Super Power"
    ]
  },
  {
    "id": 5114,
    "type": "anime",
    "title": "Fullmetal Alchemist: Brotherhood",
    "title_english": "Fullmetal Alchemist: Brotherhood",
    "title_japanese": "鋼の錬金術師 FULLMETAL ALCHEMIST",
    "image": "https://cdn.myanimelist.net/images/anime/1208/94745.jpg",
    "synopsis": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor.\n\nThe brothers are rescued by their neighbor Pinako Rockbell and her granddaughter Winry. Known as a bio-mechanical engineering prodigy, Winry creates prosthetic limbs for Edward by utilizing \"automail,\" a tough, versatile metal used in robots and combat armor. After years of training, the Elric brothers set off on a quest to restore their bodies by locating the Philosopher's Stone—a powerful gem that allows an alchemist to defy the traditional laws of Equivalent Exchange.\n\nAs Edward becomes an infamous alchemist and gains the nickname \"Fullmetal,\" the boys' journey embroils them in a growing conspiracy that threatens the fate of the world.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Drama",
      "Fantasy"
    ],
    "themes": [
      "Military"
    ]
  },
  {
    "id": 1535,
    "type": "anime",
    "title": "Death Note",
    "title_english": "Death Note",
    "title_japanese": "デスノート",
    "image": "https://cdn.myanimelist.net/images/anime/1079/138100.jpg",
    "synopsis": "Brutal murders, petty thefts, and senseless violence pollute the human world. In contrast, the realm of death gods is a humdrum, unchanging gambling den. The ingenious 17-year-old Japanese student Light Yagami and sadistic god of death Ryuk share one belief: their worlds are rotten.\n\nFor his own amusement, Ryuk drops his Death Note into the human world. Light stumbles upon it, deeming the first of its rules ridiculous: the human whose name is written in this note shall die. However, the temptation is too great, and Light experiments by writing a felon's name, which disturbingly enacts his first murder.\n\nAware of the terrifying godlike power that has fallen into his hands, Light—under the alias Kira—follows his wicked sense of justice with the ultimate goal of cleansing the world of all evil-doers. The meticulous mastermind detective L is already on his trail, but as Light's brilliance rivals L's, the grand chase for Kira turns into an intense battle of wits that can only end when one of them is dead.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Supernatural",
      "Suspense"
    ],
    "themes": [
      "Psychological"
    ]
  },
  {
    "id": 30,
    "type": "anime",
    "title": "Shinseiki Evangelion",
    "title_english": "Neon Genesis Evangelion",
    "title_japanese": "新世紀エヴァンゲリオン",
    "image": "https://cdn.myanimelist.net/images/anime/1314/108941.jpg",
    "synopsis": "Fifteen years after a cataclysmic event known as the Second Impact, the world faces a new threat: monstrous celestial beings called Angels invade Tokyo-3 one by one. Mankind is unable to defend themselves against the Angels despite utilizing their most advanced munitions and military tactics. The only hope for human salvation rests in the hands of NERV, a mysterious organization led by the cold Gendou Ikari. NERV operates giant humanoid robots dubbed \"Evangelions\" to combat the Angels with state-of-the-art advanced weaponry and protective barriers known as Absolute Terror Fields.\n\nYears after being abandoned by his father, Shinji Ikari, Gendou's 14-year-old son, returns to Tokyo-3. Shinji undergoes a perpetual internal battle against the deeply buried trauma caused by the loss of his mother and the emotional neglect he suffered at the hands of his father. Terrified to open himself up to another, Shinji's life is forever changed upon meeting 29-year-old Misato Katsuragi, a high-ranking NERV officer who shows him a free-spirited maternal kindness he has never experienced.\n\nA devastating Angel attack forces Shinji into action as Gendou reveals his true motive for inviting his son back to Tokyo-3: Shinji is the only child capable of efficiently piloting Evangelion Unit-01, a new robot that synchronizes with his biometrics. Despite the brutal psychological trauma brought about by piloting an Evangelion, Shinji defends Tokyo-3 against the angelic threat, oblivious to his father's dark machinations.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Avant Garde",
      "Award Winning",
      "Drama",
      "Sci-Fi",
      "Suspense"
    ],
    "themes": [
      "Mecha",
      "Psychological"
    ]
  },
  {
    "id": 16498,
    "type": "anime",
    "title": "Shingeki no Kyojin",
    "title_english": "Attack on Titan",
    "title_japanese": "進撃の巨人",
    "image": "https://cdn.myanimelist.net/images/anime/10/47347.jpg",
    "synopsis": "Centuries ago, mankind was slaughtered to near extinction by monstrous humanoid creatures called Titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal Titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations.\n\nAfter witnessing a horrific personal loss at the hands of the invading creatures, Eren Yeager dedicates his life to their eradication by enlisting into the Survey Corps, an elite military unit that combats the merciless humanoids outside the protection of the walls. Eren, his adopted sister Mikasa Ackerman, and his childhood friend Armin Arlert join the brutal war against the Titans and race to discover a way of defeating them before the last walls are breached.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Award Winning",
      "Drama",
      "Suspense"
    ],
    "themes": [
      "Gore",
      "Military",
      "Survival"
    ]
  },
  {
    "id": 28851,
    "type": "anime",
    "title": "Koe no Katachi",
    "title_english": "A Silent Voice",
    "title_japanese": "聲の形",
    "image": "https://cdn.myanimelist.net/images/anime/1122/96435.jpg",
    "synopsis": "As a wild youth, elementary school student Shouya Ishida sought to beat boredom in the cruelest ways. When the deaf Shouko Nishimiya transfers into his class, Shouya and the rest of his class thoughtlessly bully her for fun. However, when her mother notifies the school, he is singled out and blamed for everything done to her. With Shouko transferring out of the school, Shouya is left at the mercy of his classmates. He is heartlessly ostracized all throughout elementary and middle school, while teachers turn a blind eye.\n\nNow in his third year of high school, Shouya is still plagued by his wrongdoings as a young boy. Sincerely regretting his past actions, he sets out on a journey of redemption: to meet Shouko once more and make amends.\n\nKoe no Katachi tells the heartwarming tale of Shouya's reunion with Shouko and his honest attempts to redeem himself, all while being continually haunted by the shadows of his past.\n \n[Written by MAL Rewrite]",
    "genres": [
      "Award Winning",
      "Drama"
    ],
    "themes": []
  },
  {
    "id": 50346,
    "type": "anime",
    "title": "Yofukashi no Uta",
    "title_english": "Call of the Night",
    "title_japanese": "よふかしのうた",
    "image": "https://cdn.myanimelist.net/images/anime/1045/123711.jpg",
    "synopsis": "Kou Yamori is an average middle school student who struggles with grasping the complex concept of love. Because he sees little sense in surrendering to the norm, he soon stops going to school. Plagued with insomnia due to his idleness, Kou begins roaming the lonesome streets at night.\n\nOne night, Kou encounters a bizarre girl named Nazuna Nanakusa who believes that people stay awake during the night because they are dissatisfied with how they spent their day and cannot rest until they release their inhibitions. Nazuna offers to help Kou with his sleep issues and invites him over to her place, where she convinces him to share a futon with her. Feeling uncomfortable, Kou only pretends to doze off—which is when Nazuna suddenly bites his neck, revealing herself to be a vampire!\n\nWhile Kou thinks the bite will turn him into a vampire, the specifics of transforming are not that simple. In order to change, he must be bitten by someone he truly loves. Ready to let go of his dreary mortal life, Kou decides on a new goal: he will fall in love with Nazuna and become a vampire himself.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance",
      "Supernatural"
    ],
    "themes": [
      "Vampire"
    ]
  },
  {
    "id": 47917,
    "type": "anime",
    "title": "Bocchi the Rock!",
    "title_english": "Bocchi the Rock!",
    "title_japanese": "ぼっち・ざ・ろっく！",
    "image": "https://cdn.myanimelist.net/images/anime/1448/127956.jpg",
    "synopsis": "Yearning to make friends and perform live with a band, lonely and socially anxious Hitori \"Bocchi\" Gotou devotes her time to playing the guitar. On a fateful day, Bocchi meets the outgoing drummer Nijika Ijichi, who invites her to join Kessoku Band when their guitarist, Ikuyo Kita, flees before their first show. Soon after, Bocchi meets her final bandmate—the cool bassist Ryou Yamada. \n\nAlthough their first performance together is subpar, the girls feel empowered by their shared love for music, and they are soon rejoined by Kita. Finding happiness in performing, Bocchi and her bandmates put their hearts into improving as musicians while making the most of their fleeting high school days.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy"
    ],
    "themes": [
      "CGDCT",
      "Music"
    ]
  },
  {
    "id": 57181,
    "type": "anime",
    "title": "Ao no Hako",
    "title_english": "Blue Box",
    "title_japanese": "アオのハコ",
    "image": "https://cdn.myanimelist.net/images/anime/1496/147108.jpg",
    "synopsis": "Every morning, incoming first-year Taiki Inomata hurries to his high school gym in order to further refine his badminton skills. However, his true motivation stems from sharing the otherwise empty gym with second-year Chinatsu Kano, Taiki's crush and the star player of the girls' basketball team. Although Chinatsu seems unapproachable, Taiki gradually finds opportunities to get to know her little by little.\n\nUnbeknownst to Taiki, his tireless work ethic and admiration motivate Chinatsu to work harder and strive to achieve her greatest ambitions. When her family must suddenly move overseas for work, Chinatsu decides to remain in Japan and shoot for victory at the national level. With nowhere to stay, she is taken in by Taiki's mother, who is longtime friends with Chinatsu's own. Overwhelmed with the new reality of living alongside the girl he loves, Taiki resolves to join Chinatsu at the national level in his own sport—and grow closer to her in the process.\n\nStill, despite being good enough to catch his coach's eye, Taiki must fight an uphill battle to qualify for a spot on the starting team. Cheered on by both Chinatsu and gymnast Hina Chouno, his childhood friend, Taiki aims to make a name for himself among his powerful upperclassmen.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance",
      "Sports"
    ],
    "themes": [
      "Love Polygon",
      "School",
      "Team Sports"
    ]
  },
  {
    "id": 35507,
    "type": "anime",
    "title": "Youkoso Jitsuryoku Shijou Shugi no Kyoushitsu e",
    "title_english": "Classroom of the Elite",
    "title_japanese": "ようこそ実力至上主義の教室へ",
    "image": "https://cdn.myanimelist.net/images/anime/5/86830.jpg",
    "synopsis": "On the surface, Koudo Ikusei Senior High School is a utopia. The students enjoy an unparalleled amount of freedom, and it is ranked highly in Japan. However, the reality is less than ideal. Four classes, A through D, are ranked in order of merit, and only the top classes receive favorable treatment.\n\nKiyotaka Ayanokouji is a student of Class D, where the school dumps its worst. There he meets the unsociable Suzune Horikita, who believes she was placed in Class D by mistake and desires to climb all the way to Class A, and the seemingly amicable class idol Kikyou Kushida, whose aim is to make as many friends as possible.\n\nWhile class membership is permanent, class rankings are not; students in lower ranked classes can rise in rankings if they score better than those in the top ones. Additionally, in Class D, there are no bars on what methods can be used to get ahead. In this cutthroat school, can they prevail against the odds and reach the top?\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Suspense"
    ],
    "themes": [
      "Psychological",
      "School"
    ]
  },
  {
    "id": 50425,
    "type": "anime",
    "title": "Fuufu Ijou, Koibito Miman.",
    "title_english": "More than a Married Couple, but Not Lovers.",
    "title_japanese": "夫婦以上、恋人未満。",
    "image": "https://cdn.myanimelist.net/images/anime/1713/126442.jpg",
    "synopsis": "Third-year high school student Jirou Yakuin is in love with his childhood friend and classmate, Shiori Sakurazaka. Thus, he hopes to be paired with her for the marriage practical: their school's practice of randomly selecting boy-girl pairs to live as pretend married couples while monitoring and rating them on how close they have gotten. Meanwhile, the lively Akari Watanabe wants to be assigned to her crush, the popular and good-looking Minami Tenjin.\n\nMuch to their dismay, Jirou and Akari find out that not only have they been paired together, but so have Shiori and Minami! Determined to be with their crushes, Jirou and Akari strive to earn as many points as possible, as the top 10 pairs earn the right to switch their partners—so long as both couples agree.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "Love Polygon",
      "School"
    ]
  },
  {
    "id": 30831,
    "type": "anime",
    "title": "Kono Subarashii Sekai ni Shukufuku wo!",
    "title_english": "KonoSuba: God's Blessing on This Wonderful World!",
    "title_japanese": "この素晴らしい世界に祝福を！",
    "image": "https://cdn.myanimelist.net/images/anime/1895/142748.jpg",
    "synopsis": "After dying a laughable and pathetic death on his way back from buying a game, high school student and recluse Kazuma Satou finds himself sitting before a beautiful but obnoxious goddess named Aqua. She provides the NEET with two options: continue on to heaven or reincarnate in every gamer's dream—a real fantasy world! Choosing to start a new life, Kazuma is quickly tasked with defeating a Demon King who is terrorizing villages. But before he goes, he can choose one item of any kind to aid him in his quest, and the future hero selects Aqua. But Kazuma has made a grave mistake—Aqua is completely useless!\n\nUnfortunately, their troubles don't end here; it turns out that living in such a world is far different from how it plays out in a game. Instead of going on a thrilling adventure, the duo must first work to pay for their living expenses. Indeed, their misfortunes have only just begun!\n\n[Written by MAL Rewrite]",
    "genres": [
      "Adventure",
      "Comedy",
      "Fantasy"
    ],
    "themes": [
      "Isekai",
      "Parody"
    ]
  },
  {
    "id": 51417,
    "type": "anime",
    "title": "Engage Kiss",
    "title_english": "Engage Kiss",
    "title_japanese": "Engage Kiss",
    "image": "https://cdn.myanimelist.net/images/anime/1549/125495.jpg",
    "synopsis": "Bayron City, a pioneering metropolis built on a newly discovered energy source, promises every citizen a luxurious and comfortable lifestyle. In reality, young demon exterminator Shuu Ogata's life is far from extravagant. Despite running a private military business, he often struggles to make ends meet due to reckless expenses. Fortunately, Kisara, his demon partner, is more than eager to help Shuu with household matters—albeit a little too forcefully for his comfort.\n\nThe two work side by side, taking countermeasures against demon hazards, which stand as the biggest threats to the city. With danger lurking in the shadows, Shuu and Kisara strive to grant the town's safety; however, exterminating the possessed comes with a price unbeknownst to others.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Love Polygon"
    ]
  },
  {
    "id": 35849,
    "type": "anime",
    "title": "Darling in the FranXX",
    "title_english": "DARLING in the FRANXX",
    "title_japanese": "ダーリン・イン・ザ・フランキス",
    "image": "https://cdn.myanimelist.net/images/anime/1614/90408.jpg",
    "synopsis": "In the distant future, humanity has been driven to near-extinction by giant beasts known as Klaxosaurs, forcing the surviving humans to take refuge in massive fortress cities called Plantations. Children raised here are trained to pilot giant mechas known as FranXX—the only weapons known to be effective against the Klaxosaurs—in boy-girl pairs. Bred for the sole purpose of piloting these machines, these children know nothing of the outside world and are only able to prove their existence by defending their race.  \n\nHiro, an aspiring FranXX pilot, has lost his motivation and self-confidence after failing an aptitude test. Skipping out on his class' graduation ceremony, Hiro retreats to a forest lake, where he encounters a mysterious girl with two horns growing out of her head. She introduces herself by her codename Zero Two, which is known to belong to an infamous FranXX pilot known as the \"Partner Killer.\" Before Hiro can digest the encounter, the Plantation is rocked by a sudden Klaxosaur attack. Zero Two engages the creature in her FranXX, but it is heavily damaged in the skirmish and crashes near Hiro. Finding her partner dead, Zero Two invites Hiro to pilot the mecha with her, and the duo easily defeats the Klaxosaur in the ensuing fight. With a new partner by his side, Hiro has been given a chance at redemption for his past failures, but at what cost?\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Drama",
      "Romance",
      "Sci-Fi"
    ],
    "themes": [
      "Mecha"
    ]
  },
  {
    "id": 269,
    "type": "anime",
    "title": "Bleach",
    "title_english": "Bleach",
    "title_japanese": "BLEACH - ブリーチ -",
    "image": "https://cdn.myanimelist.net/images/anime/1541/147774.jpg",
    "synopsis": "Ichigo Kurosaki is an ordinary high schooler—until his family is attacked by a Hollow, a corrupt spirit that seeks to devour human souls. It is then that he meets a Soul Reaper named Rukia Kuchiki, who gets injured while protecting Ichigo's family from the assailant. To save his family, Ichigo accepts Rukia's offer of taking her powers and becomes a Soul Reaper as a result.\n\nHowever, as Rukia is unable to regain her powers, Ichigo is given the daunting task of hunting down the Hollows that plague their town. However, he is not alone in his fight, as he is later joined by his friends—classmates Orihime Inoue, Yasutora Sado, and Uryuu Ishida—who each have their own unique abilities. As Ichigo and his comrades get used to their new duties and support each other on and off the battlefield, the young Soul Reaper soon learns that the Hollows are not the only real threat to the human world.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Supernatural"
    ],
    "themes": []
  },
  {
    "id": 28999,
    "type": "anime",
    "title": "Charlotte",
    "title_english": "Charlotte",
    "title_japanese": "Charlotte（シャーロット）",
    "image": "https://cdn.myanimelist.net/images/anime/1826/147276.jpg",
    "synopsis": "If not for his ability to take over people's mind and body, Yuu Otosaka would be an ordinary high school student. Though it only lasts for five seconds at a time, Yuu's mysterious power allowed him to cheat his way to the top of his class and  enter a prestigious high school, where he continues his dishonest acts.\n\nHis shenanigans are eventually stopped by Nao Tomori—the headstrong student council president from Hoshinoumi Academy—who sees through his deceit. Through coercion, Nao convinces Yuu to transfer to Hoshinoumi and join the student council. Hoshinoumi Academy is secretly an institution created for adolescents who possess supernatural abilities—with the student council serving as a means of locating those who abuse their powers.\n\nWith Yuu begrudgingly assisting in council affairs, the group sets out to find and protect new ability users from harm. However, as they further investigate the abilities, their findings entangle them in far more complicated matters than they could ever imagine.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama"
    ],
    "themes": [
      "School",
      "Super Power"
    ]
  },
  {
    "id": 51705,
    "type": "anime",
    "title": "Otonari ni Ginga",
    "title_english": "A Galaxy Next Door",
    "title_japanese": "おとなりに銀河",
    "image": "https://cdn.myanimelist.net/images/anime/1091/135041.jpg",
    "synopsis": "Ichirou Kuga has suddenly found himself taking on the responsibility of caring for his two younger siblings after their father's untimely death. To make ends meet, Ichirou rents out rooms in the apartment complex he inherited and works full-time as a shoujo manga artist. However, his manga sales are low, his assistants have recently left, and deadlines are fast approaching.\n\nAs stress threatens to overtake Ichirou, salvation comes in the form of an extremely competent novice artist, Shiori Goshiki, who becomes his new assistant. With her skills, they are able to tide over the difficult situation, and things begin looking up. But in a bizarre accident, a supernatural experience unfolds between Ichirou and Shirou, which leads her to declare them engaged.\n\nWith this seemingly innocuous action upending his life, Ichirou now has to manage his new and peculiar relationship with the mysterious girl, all the while following his own passion and fulfilling the duties that rest on his shoulders.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance",
      "Supernatural"
    ],
    "themes": [
      "Childcare",
      "Otaku Culture"
    ]
  },
  {
    "id": 42310,
    "type": "anime",
    "title": "Cyberpunk: Edgerunners",
    "title_english": "",
    "title_japanese": "サイバーパンク エッジランナーズ",
    "image": "https://cdn.myanimelist.net/images/anime/1818/126435.jpg",
    "synopsis": "Dreams are doomed to die in Night City, a futuristic Californian metropolis. As a teenager living in the city's slums, David Martinez is trying to fulfill his mother's lifelong wish for him to reach the top of Arasaka, the world's leading security corporation. To this end, he attends the prestigious Arasaka Academy while his mother works tirelessly to keep their family afloat.\n\nWhen an incident with a street gang leaves David's life in tatters, he stumbles upon Sandevistan cyberware—a prosthetic that grants its wearer superhuman speed. Fueled by rage, David implants the device in his back, using it to exact revenge on one of his tormentors. This gets him expelled from the academy, shattering his hopes of ever making his mother proud.\n\nAfter witnessing David's newfound abilities, the beautiful data thief Lucyna \"Lucy\" Kushinada offers to team up with him, handing him a ticket to salvation. However, associating with Lucy introduces David to the world of Edgerunners—cyborg criminals who will break any law for money. Edgerunners often lose their lives, if the cyberware does not break their minds first; but in his fight for survival inside a corrupt system, David is ready to risk it all.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Sci-Fi"
    ],
    "themes": [
      "Gore",
      "Organized Crime"
    ]
  },
  {
    "id": 53407,
    "type": "anime",
    "title": "Bartender: Kami no Glass",
    "title_english": "Bartender Glass of God",
    "title_japanese": "バーテンダー 神のグラス",
    "image": "https://cdn.myanimelist.net/images/anime/1462/142547.jpg",
    "synopsis": "Miwa Kurushima and her colleague Yukari Higuchi hunt for a skilled individual to run the counter bar at the famous Hotel Cardinal. The chairman of the hotel demands only one thing of the potential hire: the bartender must be able to craft the ultimate drink known as the \"Glass of God.\" Because Miwa does not fully understand the requirement, her search runs dry after everyone she has scouted cannot get past the chairman's scrutiny.\n\nNestled in a quiet and secluded place among the bustling alleys of Ginza is Eden Hall. This cozy bar is maintained by Ryuu Sasakura, a prodigy mixologist who knows exactly what drink will ease his customers' worries at any given time. Every glass that he serves is garnished with humility, providing much-needed solace to people from all walks of life in their time of need.\n\nIn a chance encounter, the chairman is left speechless by Ryuu's astute bartending skills and is determined to have him join Hotel Cardinal. He becomes one of Ryuu's regulars, attempting daily to convince Ryuu to leave Eden Hall. But even with the assistance of Miwa, it is more difficult than expected to recruit this particular bartender.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Gourmet"
    ],
    "themes": [
      "Adult Cast",
      "Workplace"
    ]
  },
  {
    "id": 28223,
    "type": "anime",
    "title": "Death Parade",
    "title_english": "Death Parade",
    "title_japanese": "デス・パレード",
    "image": "https://cdn.myanimelist.net/images/anime/5/71553.jpg",
    "synopsis": "After death, either Heaven or Hell awaits most humans. But for a select few, death brings them to Quindecim—a bar where only pairs of people who die at the same time can enter. Attending the bar is an enigmatic figure known as Decim, who also acts as the arbiter. He passes judgment on those who wind up at Quindecim by challenging them to a life-threatening game. These games determine if the patron's soul will reincarnate into a new life, or be sent into the void, never to be seen again.\n\nFrom darts and bowling to fighting games, the true nature of each patron slowly comes to light as they wager their souls. Though his methods remain unchanged, the sudden appearance of a black-haired amnesiac causes Decim to reevaluate his own rulings.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Fantasy",
      "Suspense"
    ],
    "themes": [
      "Adult Cast",
      "High Stakes Game",
      "Psychological"
    ]
  },
  {
    "id": 31043,
    "type": "anime",
    "title": "Boku dake ga Inai Machi",
    "title_english": "Erased",
    "title_japanese": "僕だけがいない街",
    "image": "https://cdn.myanimelist.net/images/anime/10/77957.jpg",
    "synopsis": "When tragedy is about to strike, Satoru Fujinuma finds himself sent back several minutes before the accident occurs. The detached, 29-year-old manga artist has taken advantage of this powerful yet mysterious phenomenon, which he calls \"Revival,\" to save many lives.\n \nHowever, when he is wrongfully accused of murdering someone close to him, Satoru is sent back to the past once again, but this time to 1988, 18 years in the past. Soon, he realizes that the murder may be connected to the abduction and killing of one of his classmates, the solitary and mysterious Kayo Hinazuki, that took place when he was a child. This is his chance to make things right.\n \nBoku dake ga Inai Machi follows Satoru in his mission to uncover what truly transpired 18 years ago and prevent the death of his classmate while protecting those he cares about in the present.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Mystery",
      "Suspense"
    ],
    "themes": [
      "Psychological",
      "Time Travel"
    ]
  },
  {
    "id": 29803,
    "type": "anime",
    "title": "Overlord",
    "title_english": "Overlord",
    "title_japanese": "オーバーロード",
    "image": "https://cdn.myanimelist.net/images/anime/1945/136600.jpg",
    "synopsis": "The final hour of the popular virtual reality game Yggdrasil has come. However, Momonga, a powerful wizard and master of the dark guild Ainz Ooal Gown, decides to spend his last few moments in the game as the servers begin to shut down. To his surprise, despite the clock having struck midnight, Momonga is still fully conscious as his character and, moreover, the non-player characters appear to have developed personalities of their own!\n\nConfronted with this abnormal situation, Momonga commands his loyal servants to help him investigate and take control of this new world, with the hopes of figuring out what has caused this development and if there may be others in the same predicament.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": [
      "Isekai"
    ]
  },
  {
    "id": 59062,
    "type": "anime",
    "title": "Gachiakuta",
    "title_english": "Gachiakuta",
    "title_japanese": "ガチアクタ",
    "image": "https://cdn.myanimelist.net/images/anime/1682/150432.jpg",
    "synopsis": "The inhabitants of a certain wealthy town think nothing of throwing objects away. However, their waste is priceless to Rudo, a resident of the town's slums. Despite the constant warnings from his adoptive father Regto, Rudo spends his days searching for reusable materials that would otherwise be sent to the giant disposal area known as the Pit. Due to its vastness, the Pit doubles as a means of criminal punishment; those dropped in are never to return again.\n\nWhen Regto is murdered by a mysterious assailant, Rudo is falsely accused of the crime and thrown into the Pit. To his surprise, he awakens in a trash-filled area inhabited by enormous monsters formed from the junk. As the toxic air and Trash Beasts push Rudo to the brink of death, he is saved by Enjin, one of the Cleaners who wield weapons known as Vital Instruments to fight the monstrosities. Having gained his own Vital Instrument, Rudo soon joins the Cleaners in the hopes of finding a way to escape the Pit and avenge his father.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Fantasy"
    ],
    "themes": []
  },
  {
    "id": 22297,
    "type": "anime",
    "title": "Fate/stay night: Unlimited Blade Works",
    "title_english": "Fate/stay night [Unlimited Blade Works]",
    "title_japanese": "Fate/stay night [Unlimited Blade Works]",
    "image": "https://cdn.myanimelist.net/images/anime/12/67333.jpg",
    "synopsis": "The Holy Grail War is a battle royale among seven magi who serve as Masters. Masters, through the use of the command seals they are given when they enter the war, command Heroic Spirits known as Servants to fight for them in battle. In the Fifth Holy Grail War, Rin Toosaka is among the magi entering the competition. With her Servant, Archer, she hopes to obtain the ultimate prize—the Holy Grail, a magical artifact capable of granting its wielder any wish.\n \nOne of Rin's classmates, Shirou Emiya, accidentally enters the competition and ends up commanding a Servant of his own known as Saber. As they find themselves facing mutual enemies, Rin and Shirou decide to form a temporary alliance as they challenge their opponents in the Holy Grail War. \n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Fantasy"
    ],
    "themes": [
      "Urban Fantasy"
    ]
  },
  {
    "id": 52308,
    "type": "anime",
    "title": "Kanojo ga Koushaku-tei ni Itta Riyuu",
    "title_english": "Why Raeliana Ended up at the Duke's Mansion",
    "title_japanese": "Kanojo ga Koushaku-tei ni Itta Riyuu",
    "image": "https://cdn.myanimelist.net/images/anime/1109/130452.jpg",
    "synopsis": "When, after her sudden death, Rinko Hanasaki is reborn as Raeliana McMillan, she is not sure whether to curse her luck. Raeliana was a minor character in a novel Rinko read, and as the eldest daughter of a nouveau-riche baron, she led a carefree life until her unfortunate demise at the hands of her fiancé, Lord Francis Brooks. To avoid her destined fate, Raeliana is determined to end her engagement with Francis.\n However, when Francis refuses to break things off, Raeliana decides to seek help from someone of higher standing and approaches Duke Noah Wynknight—the novel's male protagonist. Using her knowledge of the plot, Raeliana captures the duke's interest by proposing a deal: she will not expose his secrets if Noah agrees to act as her fiancé. Little does she know that getting involved with a duke who only shows his true colors around her may lead to more than she bargained for.\n \n [Written by MAL Rewrite]",
    "genres": [
      "Fantasy",
      "Romance"
    ],
    "themes": [
      "Isekai",
      "Reincarnation"
    ]
  },
  {
    "id": 36882,
    "type": "anime",
    "title": "Arifureta Shokugyou de Sekai Saikyou",
    "title_english": "Arifureta: From Commonplace to World's Strongest",
    "title_japanese": "ありふれた職業で世界最強",
    "image": "https://cdn.myanimelist.net/images/anime/1776/97682.jpg",
    "synopsis": "The ordinary life of 17-year-old otaku Hajime Nagumo is disrupted when he and his classmates are summoned to a fantasy world and tasked with saving mankind. While his classmates are gifted with impressive abilities useful in combat, Hajime is belittled for only gaining an inferior transmutation skill that lacks any real offensive power. \n\nDuring an expedition in the Great Orcus Labyrinth, Hajime is betrayed by one of his classmates, plummeting him to the bottom of an abyss. Though he survives the fall, Hajime is faced with menacing monsters and misfortunes that send him spiraling into a grim nightmare. Desperate to live and return home one day, he resolves to fight for his survival—only to meet an imprisoned vampire he names Yue, who is also seeking to escape the labyrinth. Taking an interest in him, Yue and a few others along the way accompany Hajime on his journey to find a way back home, while steadily transforming from commonplace to the world's strongest. \n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": [
      "Harem",
      "Isekai"
    ]
  },
  {
    "id": 49596,
    "type": "anime",
    "title": "Blue Lock",
    "title_english": "Blue Lock",
    "title_japanese": "ブルーロック",
    "image": "https://cdn.myanimelist.net/images/anime/1258/126929.jpg",
    "synopsis": "Yoichi Isagi was mere moments away from scoring a goal that would have sent his high school soccer team to the nationals, but a split-second decision to pass the ball to his teammate cost him that reality. Bitter, confused, and disappointed, Isagi wonders if the outcome would have been different had he not made the pass. When the young striker returns home, an invitation from the Japan Football Union awaits him. Through an arbitrary and biased decision-making process, Isagi is one of three hundred U-18 strikers selected for a controversial project named Blue Lock. \n\nThe project's ultimate goal is to turn one of the selected players into the star striker for the Japanese national team. To find the best participant, each diamond in the rough must compete against others through a series of solo and team competitions to rise to the top. Putting aside his ethical objections to the project, Isagi feels compelled to fight his way to the top, even if it means ruthlessly crushing the dreams of 299 aspiring young strikers.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Sports"
    ],
    "themes": [
      "Team Sports"
    ]
  },
  {
    "id": 38671,
    "type": "anime",
    "title": "Enen no Shouboutai",
    "title_english": "Fire Force",
    "title_japanese": "炎炎ノ消防隊",
    "image": "https://cdn.myanimelist.net/images/anime/1664/103275.jpg",
    "synopsis": "Spontaneous Human Combustion: a chaotic phenomenon that has plagued humanity for years, randomly transforming ordinary people into flaming, violent creatures known as Infernals. While Infernals make up the first-generation accounts of Human Combustion, the second and third generations became known as pyrokinetics—people gifted with the ability to manipulate and control their flames while remaining human. To combat the Infernal threat and discover the cause, the Tokyo Armed Forces, Fire Defense Agency, and Holy Church of Sol produced their answer: the Special Fire Force.\n\nYoung and eager third-generation pyrokinetic Shinra Kusakabe, nicknamed Devil's Footprints for his explosive ability to ignite his feet at will, becomes a member of the lively Special Fire Force Company 8. Upholding the brigade's duty to extinguish the blazing Infernals and lay their souls to rest, Shinra is determined to become a hero who will save the lives of those threatened by the flame terror.\n\nHowever, this is not the hero's game Shinra imagined. The Fire Force is a fractured mess of feuding brigades, abnormal Infernal sightings are increasing all over Tokyo, and a shadowy group is claiming to have answers to the strange fire that caused the death of Shinra's family 12 years ago. Faced with many obstacles within and outside the Fire Force, Shinra fights to uncover the truth behind the burning mysteries that have kept him in the dark.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Fantasy",
      "Sci-Fi"
    ],
    "themes": [
      "Urban Fantasy"
    ]
  },
  {
    "id": 57334,
    "type": "anime",
    "title": "Dandadan",
    "title_english": "Dan Da Dan",
    "title_japanese": "ダンダダン",
    "image": "https://cdn.myanimelist.net/images/anime/1584/143719.jpg",
    "synopsis": "Reeling from her recent breakup, Momo Ayase, a popular high schooler, shows kindness to her socially awkward schoolmate, Ken Takakura, by standing up to his bullies. Takakura misunderstands her intentions, believing he has made a new friend who shares his obsession with aliens and UFOs. However, Momo's own eccentric occult beliefs lie in the supernatural realm; she thinks aliens do not exist. A rivalry quickly brews as each becomes determined to prove the other wrong.\n\nDespite their initial clash over their opposing beliefs, Momo and Takakura form an unexpected but intimate friendship, a bond forged in a series of supernatural battles and bizarre encounters with urban legends and paranormal entities. As both develop unique superhuman abilities, they learn to supplement each other's weaknesses, leading them to wonder if their newfound partnership may be about more than just survival.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy",
      "Supernatural"
    ],
    "themes": []
  },
  {
    "id": 24833,
    "type": "anime",
    "title": "Ansatsu Kyoushitsu",
    "title_english": "Assassination Classroom",
    "title_japanese": "暗殺教室",
    "image": "https://cdn.myanimelist.net/images/anime/5/75639.jpg",
    "synopsis": "Tucked in the mountains near the elite Kunugigaoka Middle School lies a small derelict building that houses the delinquents and dropouts of Class 3-E. Looked down upon by their peers, the students in this class appear to have little hope in advancing their academic careers. That is, until the national government tasks them with eliminating the greatest threat to their planet: their new teacher. \n\nHaving already destroyed the moon, the octopus-like professor—dubbed \"Koro-sensei\"—has now threatened to destroy the Earth by March of the following year. In light of their mission, the students have found that killing him is easier said than done. Not only can Koro-sensei move at speeds of up to Mach 20, but he can also resist almost every earthly weapon. Ironically, he also proves to be one of the best teachers Class 3-E has ever had. Training the class to excel in both their studies as students and skills as assassins, Koro-sensei is confident that his students' ingenuity and indomitable will could return them to the main campus. \n\nThrough trial and error, Nagisa Shiota, as well as the other students of Class 3-E, must figure out Koro-sensei's weaknesses—and fast, for the very fate of the world depends upon it.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 34618,
    "type": "anime",
    "title": "Blend S",
    "title_english": "BLEND-S",
    "title_japanese": "ブレンド・S",
    "image": "https://cdn.myanimelist.net/images/anime/6/88286.jpg",
    "synopsis": "Wishing to be independent, 16-year-old Maika Sakuranomiya is desperate to nail down a part-time job so that she can afford to study abroad. Unfortunately, her applications are constantly rejected due to the menacing look she unintentionally makes whenever she smiles, despite her otherwise cheerful disposition.\n\nAfter yet another failed interview, she chances upon Café Stile, a coffee shop where the servers interact with the customers while roleplaying distinctive characteristics. The Italian store manager, Dino, becomes infatuated with Maika's cuteness at first sight, and offers her a job as a waitress with a sadistic nature. Coupled with her inherent clumsiness, she successfully manages to serve a pair of masochistic customers in accordance with her new, ruthless persona. Alongside Kaho Hinata as the tsundere and Mafuyu Hoshikawa as the younger sister, Maika decides to make the most out of her unique quirk and cements her position in the cafe with merciless cruelty!\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy"
    ],
    "themes": [
      "Otaku Culture",
      "Workplace"
    ]
  },
  {
    "id": 52991,
    "type": "anime",
    "title": "Sousou no Frieren",
    "title_english": "Frieren: Beyond Journey's End",
    "title_japanese": "葬送のフリーレン",
    "image": "https://cdn.myanimelist.net/images/anime/1015/138006.jpg",
    "synopsis": "During their decade-long quest to defeat the Demon King, the members of the hero's party—Himmel himself, the priest Heiter, the dwarf warrior Eisen, and the elven mage Frieren—forge bonds through adventures and battles, creating unforgettable precious memories for most of them.\n\nHowever, the time that Frieren spends with her comrades is equivalent to merely a fraction of her life, which has lasted over a thousand years. When the party disbands after their victory, Frieren casually returns to her \"usual\" routine of collecting spells across the continent. Due to her different sense of time, she seemingly holds no strong feelings toward the experiences she went through.\n\nAs the years pass, Frieren gradually realizes how her days in the hero's party truly impacted her. Witnessing the deaths of two of her former companions, Frieren begins to regret having taken their presence for granted; she vows to better understand humans and create real personal connections. Although the story of that once memorable journey has long ended, a new tale is about to begin.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Adventure",
      "Drama",
      "Fantasy"
    ],
    "themes": []
  },
  {
    "id": 56964,
    "type": "anime",
    "title": "Raise wa Tanin ga Ii",
    "title_english": "Yakuza Fiancé: Raise wa Tanin ga Ii",
    "title_japanese": "来世は他人がいい",
    "image": "https://cdn.myanimelist.net/images/anime/1428/143773.jpg",
    "synopsis": "After years of animosity, the leaders of Osaka's Somei and Tokyo's Miyama yakuza groups have called a truce—by arranging an engagement between their respective grandchildren, Yoshino Somei and Kirishima Miyama. To this end, 17-year-old Yoshino moves to Tokyo to live with the Miyama family and attend school with her new fiancé. Although Kirishima is all smiles and perfectly polite, there is something unsettling about his demeanor that Yoshino cannot put her finger on.\n\nYoshino's suspicions are soon confirmed: despite his manners, Kirishima is a masochistic maniac. He hurts people without batting an eye and also revels in being punished verbally and physically himself. What he wants most is a spoiled and arrogant fiancée who will ruin his life. When Yoshino does not quite meet his expectations, he reveals his true colors and openly insults her. However, instead of running away in fear, Yoshino decides to take revenge by making Kirishima fall in love with her and then ruthlessly breaking his heart.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "Organized Crime"
    ]
  },
  {
    "id": 52830,
    "type": "anime",
    "title": "Isekai de Cheat Skill wo Te ni Shita Ore wa, Genjitsu Sekai wo mo Musou Suru: Level Up wa Jinsei wo Kaeta",
    "title_english": "I Got a Cheat Skill in Another World and Became Unrivaled in The Real World, Too",
    "title_japanese": "異世界でチート能力を手にした俺は、現実世界をも無双する ～レベルアップは人生を変えた～",
    "image": "https://cdn.myanimelist.net/images/anime/1316/134327.jpg",
    "synopsis": "All his life, Yuuya Tenjou has been the subject of resentment and contempt from everyone around him, even from his parents. To make matters worse, his grandfather—the only person who ever showed him affection—suddenly dies, leaving Yuuya truly alone.\n\nDespite facing many adversities, Yuuya does what he can to offer kindness to those who need it—but even the most good-natured people can only tolerate so much abuse. Just when he reaches his breaking point, a flicker of hope appears in the form of a hidden door in his bathroom.\n\nThis door provides two-way access to an abandoned house in another world, where he instantly gains game-like stats and skills. Moreover, the house once belonged to a sage, which gives Yuuya access to remarkable weapons, equipment, and crops with extraordinary effects. With these newfound blessings, the once-undesirable Yuuya may just reach his true potential and become unstoppable.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": [
      "Isekai",
      "School"
    ]
  },
  {
    "id": 46352,
    "type": "anime",
    "title": "Blue Period",
    "title_english": "Blue Period",
    "title_japanese": "ブルーピリオド",
    "image": "https://cdn.myanimelist.net/images/anime/1757/116931.jpg",
    "synopsis": "Second-year high school student Yatora Yaguchi is a delinquent with excellent grades, but is unmotivated to find his true calling in life. Yatora spends his days working hard to maintain his academic standing while hanging out with his equally unambitious friends. However, beneath his carefree demeanor, Yatora does not enjoy either activity and wishes he could find something more fulfilling.\n\nWhile mulling over his predicament, Yatora finds himself staring at a vibrant landscape of Shibuya. Unable to express how he feels about the unusually breathtaking sight, he picks up a paintbrush, hoping his thoughts will be conveyed on canvas. After receiving praise for his work, the joy he feels sends him on a journey to enter the extremely competitive Tokyo University of the Arts—a school that only accepts one in every two hundred applicants.\n\nFacing talented peers, a lack of understanding of the fine arts, and struggles to obtain his parents’ approval, Yatora is confronted by much adversity. In the hopes of securing one of the five prestigious spots in his program of choice, Yatora must show that his inexperience does not define him. \n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama"
    ],
    "themes": [
      "School",
      "Visual Arts"
    ]
  },
  {
    "id": 44511,
    "type": "anime",
    "title": "Chainsaw Man",
    "title_english": "Chainsaw Man",
    "title_japanese": "チェンソーマン",
    "image": "https://cdn.myanimelist.net/images/anime/1806/126216.jpg",
    "synopsis": "Denji is robbed of a normal teenage life, left with nothing but his deadbeat father's overwhelming debt. His only companion is his pet, the chainsaw devil Pochita, with whom he slays devils for money that inevitably ends up in the yakuza's pockets. All Denji can do is dream of a good, simple life: one with delicious food and a beautiful girlfriend by his side. But an act of greedy betrayal by the yakuza leads to Denji's brutal, untimely death, crushing all hope of him ever achieving happiness.\n\nRemarkably, an old contract allows Pochita to merge with the deceased Denji and bestow devil powers on him, changing him into a hybrid able to transform his body parts into chainsaws. Because Denji's new abilities pose a significant risk to society, the Public Safety Bureau's elite devil hunter Makima takes him in, letting him live as long as he obeys her command. Guided by the promise of a content life alongside an attractive woman, Denji devotes everything and fights with all his might to make his naive dreams a reality.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Fantasy"
    ],
    "themes": [
      "Gore",
      "Urban Fantasy"
    ]
  },
  {
    "id": 2167,
    "type": "anime",
    "title": "Clannad",
    "title_english": "Clannad",
    "title_japanese": "CLANNAD",
    "image": "https://cdn.myanimelist.net/images/anime/1804/95033.jpg",
    "synopsis": "Tomoya Okazaki is a delinquent who finds life dull and believes he'll never amount to anything. Along with his friend Youhei Sunohara, he skips school and plans to waste his high school days away.\n\nOne day while walking to school, Tomoya passes a young girl muttering quietly to herself. Without warning she exclaims \"Anpan!\" (a popular Japanese food) which catches Tomoya's attention. He soon discovers the girl's name is Nagisa Furukawa and that she exclaims things she likes in order to motivate herself. Nagisa claims they are now friends, but Tomoya walks away passing the encounter off as nothing.\n\nHowever, Tomoya finds he is noticing Nagisa more and more around school. Eventually he concedes and befriends her. Tomoya learns Nagisa has been held back a year due to a severe illness and that her dream is to revive the school's drama club. Claiming he has nothing better to do, he decides to help her achieve this goal along with the help of four other girls.\n\nAs Tomoya spends more time with the girls, he learns more about them and their problems. As he attempts to help each girl overcome her respective obstacle, he begins to realize life isn't as dull as he once thought.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 52505,
    "type": "anime",
    "title": "Dark Gathering",
    "title_english": "Dark Gathering",
    "title_japanese": "ダークギャザリング",
    "image": "https://cdn.myanimelist.net/images/anime/1346/138731.jpg",
    "synopsis": "Spirits have always been attracted to Keitarou Gentouga due to his strong spiritual presence. A traumatic encounter with one had caused his right hand to be cursed, forcing him to wear a glove at all times. Now a college freshman, Keitarou is trying to live as normal a life as possible. With the encouragement of his childhood friend Eiko Houzuki, he becomes a private tutor. Since he is at the top of his intake class, his first client is the tutoring firm's most promising student, Yayoi Houzuki.\n\nTo Keitarou's surprise, Yayoi is Eiko's cousin, and she possesses two pupils in each eye—allowing her to see into the spirit world and purposely seek vengeful spirits to exorcise. Ever since a car accident killed both her parents, Yayoi has been searching for the powerful spirit that kidnapped her mother's departed soul. Seeing that spirits are so attracted to Keitarou, she ropes him into helping her collect other evil spirits that will assist in her future fight. Although her quest is dangerous, Keitarou reluctantly decides to join her, even as each new spirit they meet has him questioning his resolve at every turn.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Horror",
      "Supernatural"
    ],
    "themes": [
      "Gore"
    ]
  },
  {
    "id": 54112,
    "type": "anime",
    "title": "Zom 100: Zombie ni Naru made ni Shitai 100 no Koto",
    "title_english": "Zom 100: Bucket List of the Dead",
    "title_japanese": "ゾン100～ゾンビになるまでにしたい100のこと～",
    "image": "https://cdn.myanimelist.net/images/anime/1384/136408.jpg",
    "synopsis": "After graduating from a top university with an impressive extracurricular record in the rugby club, Akira Tendou has nailed every step of the way to securing his dream job. On top of that, a beautiful and kind co-worker always brightens his day in the office! Life seems to be going very well for Akira until he slowly realizes that sleepless nights and brutal work are his new reality.\n\nDue to three years of mind-numbing labor in an exploitative company, Akira is unable to recognize the tired, unaccomplished person he has become. On track to losing all passion in life like several of his overworked colleagues, Akira finds his saving grace in the most unexpected way possible—the breakout of a zombie apocalypse.\n\nWith the free time he finally has, Akira decides to complete a bucket list of a hundred things he wants to do before he eventually gets turned into a zombie. Although he is surrounded by the dead, Akira has never felt more alive!\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Suspense"
    ],
    "themes": [
      "Adult Cast",
      "Survival"
    ]
  },
  {
    "id": 37982,
    "type": "anime",
    "title": "Domestic na Kanojo",
    "title_english": "Domestic Girlfriend",
    "title_japanese": "ドメスティックな彼女",
    "image": "https://cdn.myanimelist.net/images/anime/1021/95670.jpg",
    "synopsis": "In their teenage years, few things can hurt people more than the heartaches that come with unrequited love. Such is the case for Natsuo Fujii, who has found himself entranced by his school's ever-cheerful teacher Hina. Deflated by this unreachable desire, Natsuo humors his friends and attends a mixer. There he meets Rui, a girl whose lack of excitement rivals that of himself. After bonding over their mutual awkwardness, Rui takes Natsuo to her house and asks him to have sex with her, hoping that the experience will stop her friends from treating her like a clueless child. With his hopeless feelings towards Hina still on his mind, Natsuo hesitantly agrees.\n\nEqually unfulfilled by their \"first times,\" the two decide to part ways as strangers. However, before he even has a chance to process this experience, Natsuo's father drops a major bombshell: he is getting remarried, and his new wife Tsukiko Tachibana is coming over now to meet Natsuo. As if that was not enough of a shock, her daughters—and, in turn, Natsuo's new sisters—are Hina and Rui Tachibana, the woman he's in love with and the girl with whom he shared his first night. Now, Natsuo must come to terms with the feelings he has for his step-siblings as his eyes open to a darker side of love.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "Love Polygon",
      "School"
    ]
  },
  {
    "id": 37105,
    "type": "anime",
    "title": "Grand Blue",
    "title_english": "Grand Blue Dreaming",
    "title_japanese": "ぐらんぶる",
    "image": "https://cdn.myanimelist.net/images/anime/1302/94882.jpg",
    "synopsis": "Iori Kitahara moves to the coastal town of Izu for his freshman year at its university, taking residence above Grand Blue, his uncle's scuba diving shop. Iori has high hopes and dreams about having the ideal college experience, but when he enters the shop he is sucked into the alcoholic activities of the carefree members of the Diving Club who frequent the place. Persuaded by upperclassmen Shinji Tokita and Ryuujirou Kotobuki, Iori reluctantly joins their bizarre party. His cousin Chisa Kotegawa later walks in and catches him in the act, earning Iori her utter disdain.\n\nBased on Kenji Inoue and Kimitake Yoshioka's popular comedy manga, Grand Blue follows Iori's misadventures with his eccentric new friends as he strives to realize his ideal college dream, while also learning how to scuba dive.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy"
    ],
    "themes": [
      "Adult Cast",
      "Gag Humor"
    ]
  },
  {
    "id": 50392,
    "type": "anime",
    "title": "Mato Seihei no Slave",
    "title_english": "Chained Soldier",
    "title_japanese": "魔都精兵のスレイブ",
    "image": "https://cdn.myanimelist.net/images/anime/1114/140805.jpg",
    "synopsis": "As his school days draw to an end, Yuuki Wakura worries about his future. While lamenting the prospect of living an ordinary life, he is suddenly drawn into the world of Mato: an alternate dimension filled with dangerous monsters called Shuuki. Over the years since the existence of Mato was first confirmed, incidents of people accidentally wandering into the other world have become commonplace. To combat the threat of the Shuuki and rescue victims like Yuuki, the all-female Demon Defense Force was established. Its members have been blessed with the power of \"Peaches\"—Mato fruits that grant supernatural abilities only to women.\n\nThough Yuuki's situation is dire, he is saved in the nick of time by Kyouka Uzen, the chief of the Demon Defense Force's seventh unit. Despite Kyouka's impeccable skills in battle, she has long been held back by her Peach-granted ability, Slave. Slave allows Kyouka to put a living being under her control and draw out its strength, but the Shuuki that she had enslaved until now had all proven to be exceedingly weak.\n\nWhen Yuuki and Kyouka become surrounded by a horde of Shuuki, Kyouka resorts to something she has never tried before: using her ability on a man. To her surprise, Yuuki's slave form is much more powerful than she could have imagined. Believing the young man to be the key to unlocking her true potential, Kyouka invites Yuuki to join the Demon Defense Force—but not as a regular member.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Fantasy",
      "Ecchi"
    ],
    "themes": [
      "Harem"
    ]
  },
  {
    "id": 889,
    "type": "anime",
    "title": "Black Lagoon",
    "title_english": "Black Lagoon",
    "title_japanese": "BLACK LAGOON",
    "image": "https://cdn.myanimelist.net/images/anime/1906/121592.jpg",
    "synopsis": "Salaryman Rokurou Okajima spends his days trying to climb his company's corporate ladder, until one day when a business negotiation in Thailand goes awry. During the botched deal, he falls hostage to the Lagoon Company—a band of ruthless pirate mercenaries. Left to the whims of his captors after his managers refuse to pay his ransom, Rokurou does the unthinkable: instead of begging for his life, he joins the very crew who kidnapped him.\n\nNow a member of the group, Rokurou must adjust to his new residence in the dissolute hellscape known as Roanapur, a city where corruption and crime run rampant, and even the smallest slipup could cost him his life. If not for one of the many crime syndicates on the island, Rokurou also constantly finds himself at odds with his brash, gunslinging colleague, Revy. \n\nAs Rokurou struggles to abandon his past—and with more than just the profits from the Lagoon Company's illegal trading on the line—he must quickly find the resolve to make tough decisions in high-stress situations while keeping his humanity intact.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action"
    ],
    "themes": [
      "Adult Cast",
      "Organized Crime"
    ]
  },
  {
    "id": 53393,
    "type": "anime",
    "title": "Tengoku Daimakyou",
    "title_english": "Heavenly Delusion",
    "title_japanese": "天国大魔境",
    "image": "https://cdn.myanimelist.net/images/anime/1121/133132.jpg",
    "synopsis": "Fifteen years ago, disaster struck human civilization, and now dangerous man-eating monsters roam the ravaged lands, posing an existential threat to the remaining survivors. Amid this turmoil, an isolated facility shelters children and nurtures them in peace. However, as a few among them find out about the world beyond the narrow periphery of their nursery's walls, their curiosity about it slowly grows.\n\nMeanwhile, in the outside world, young survivors Maru and Kiruko band together to search for a special place called Heaven, each for their own reasons. Carrying past burdens and tragic secrets, the two hope to find answers to the cruelty they have experienced in their lives and in the world, which still remains in tatters.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Adventure",
      "Mystery",
      "Sci-Fi"
    ],
    "themes": []
  },
  {
    "id": 52215,
    "type": "anime",
    "title": "Chi. Chikyuu no Undou ni Tsuite",
    "title_english": "Orb: On the Movements of the Earth",
    "title_japanese": "チ。―地球の運動について―",
    "image": "https://cdn.myanimelist.net/images/anime/1749/145922.jpg",
    "synopsis": "Twelve-year-old prodigy Rafal believes in living rationally, so as to earn praise and respect from society while not being led astray by his emotions. To this end, he publicly states his intention to study theology—the academic field held in highest regard in early 15th century Poland. However, an encounter with a mysterious man upends Rafal's life, sparking an illogical desire to instead pursue his passion for astronomy.\n\nRafal is determined to prove the beauty and rationality of heliocentrism—the theory that the Earth revolves around the Sun. This belief is considered heretical by the powerful Church, which promotes geocentrism—the Sun revolving around the Earth—as the sole truth of the universe. Those whose beliefs do not align with the will of the Church suffer unfathomably gruesome consequences.\n\nIn pursuit of evidence for a heliocentric model of the universe, Rafal grapples with obtaining precise calculations and building empirical theories. His greatest challenge, however, lies in conducting this research discreetly—lest he wish to meet the same fate as other heretics.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama"
    ],
    "themes": [
      "Historical"
    ]
  },
  {
    "id": 55866,
    "type": "anime",
    "title": "Yubisaki to Renren",
    "title_english": "A Sign of Affection",
    "title_japanese": "ゆびさきと恋々",
    "image": "https://cdn.myanimelist.net/images/anime/1478/140828.jpg",
    "synopsis": "For hearing-impaired university student Yuki Itose, silence has been a natural part of life since birth. Her world is small and isolated; she commutes to campus, interacts with her best friend Rin Fujishiro, and communicates through writing and text messages—a lifestyle that offers little to no change. One day, during her commute, Yuki meets fellow student Itsuomi Nagi, a multilingual travel enthusiast and friend of Rin. When Itsuomi learns of Yuki's condition, he takes it in stride, moving Yuki's heart. From this one simple gesture, Yuki and Itsuomi's lives start changing day by day as they let each other into their own worlds.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "Adult Cast"
    ]
  },
  {
    "id": 56923,
    "type": "anime",
    "title": "Lv2 kara Cheat datta Motoyuusha Kouho no Mattari Isekai Life",
    "title_english": "Chillin' in Another World with Level 2 Super Cheat Powers",
    "title_japanese": "Lv2からチートだった元勇者候補のまったり異世界ライフ",
    "image": "https://cdn.myanimelist.net/images/anime/1103/142513.jpg",
    "synopsis": "When a humble merchant named Banaza is summoned to the magical kingdom of Klyrode in another world, the citizens hope he will become the hero who can take down the threatening Dark Army. Unfortunately, Banaza does not gain any exceptional powers at level one as hero candidates usually do, and he has no way of returning to his old world. As compensation, he is sent to live in a faraway forest. Upon arriving, Banaza levels up once and suddenly gains limitless powers that he now has no idea what to do with.\n\nTo avoid drawing attention, Banaza changes his appearance and assumes the name Flio. While away from home, he stumbles across a young demi-human girl named Fenrys, who is seemingly searching for the same forest Flio was sent to. However, she attacks him and reveals her true identity—a lupine demon. Luckily, Filo's unrivaled magic overpowers Fenrys, and she swears undying loyalty to him. However, Flio refuses to hold power over her; the two instead begin pretending to be a married couple and embark on a new life together.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Adventure",
      "Fantasy",
      "Romance"
    ],
    "themes": [
      "Isekai"
    ]
  },
  {
    "id": 57719,
    "type": "anime",
    "title": "Akuyaku Reijou Tensei Ojisan",
    "title_english": "From Bureaucrat to Villainess: Dad's Been Reincarnated!",
    "title_japanese": "悪役令嬢転生おじさん",
    "image": "https://cdn.myanimelist.net/images/anime/1255/146484.jpg",
    "synopsis": "Although Kenzaburou Tondabayashi is a 52-year-old bureaucrat, he is well versed in reincarnation stories where a protagonist suddenly awakens in a fantasy world. After being hit by a truck, Kenzaburou lands in that exact situation. However, what baffles him is the fact he wound up in the world of an otome game—as the young villainess and the daughter of a duke, Grace Auvergne.\n\nFortunately for Kenzaburou, he is somewhat familiar with his new world, as it is based on the game called Magical Academy: Love &amp; Beast. He was a proud father in his previous life, and he often listened to his daughter rave about the game's setting and characters. Armed with background knowledge and a lifetime's worth of dad skills, Kenzaburou strives to make the most of his new life, though his kind-hearted nature makes it difficult to fully embrace the role of a villainess.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Fantasy"
    ],
    "themes": [
      "Isekai",
      "School",
      "Villainess"
    ]
  },
  {
    "id": 2,
    "type": "manga",
    "title": "Berserk",
    "title_english": "Berserk",
    "title_japanese": "ベルセルク",
    "image": "https://cdn.myanimelist.net/images/manga/1/157897.jpg",
    "synopsis": "Guts, a former mercenary now known as the Black Swordsman, is out for revenge. After a tumultuous childhood, he finally finds someone he respects and believes he can trust, only to have everything fall apart when this person takes away everything important to Guts for the purpose of fulfilling his own desires. Now marked for death, Guts becomes condemned to a fate in which he is relentlessly pursued by demonic beings.\n\nSetting out on a dreadful quest riddled with misfortune, Guts, armed with a massive sword and monstrous strength, will let nothing stop him, not even death itself, until he is finally able to take the head of the one who stripped him—and his loved one—of their humanity.\n\n[Written by MAL Rewrite]\n\nIncluded one-shot:\nVolume 14: Berserk: The Prototype",
    "genres": [
      "Action",
      "Adventure",
      "Award Winning",
      "Drama",
      "Fantasy",
      "Horror"
    ],
    "themes": [
      "Gore",
      "Military",
      "Psychological"
    ]
  },
  {
    "id": 38000,
    "type": "anime",
    "title": "Kimetsu no Yaiba",
    "title_english": "Demon Slayer: Kimetsu no Yaiba",
    "title_japanese": "鬼滅の刃",
    "image": "https://cdn.myanimelist.net/images/anime/1286/99889.jpg",
    "synopsis": "Ever since the death of his father, the burden of supporting the family has fallen upon Tanjirou Kamado's shoulders. Though living impoverished on a remote mountain, the Kamado family are able to enjoy a relatively peaceful and happy life. One day, Tanjirou decides to go down to the local village to make a little money selling charcoal. On his way back, night falls, forcing Tanjirou to take shelter in the house of a strange man, who warns him of the existence of flesh-eating demons that lurk in the woods at night.\n\nWhen he finally arrives back home the next day, he is met with a horrifying sight—his whole family has been slaughtered. Worse still, the sole survivor is his sister Nezuko, who has been turned into a bloodthirsty demon. Consumed by rage and hatred, Tanjirou swears to avenge his family and stay by his only remaining sibling. Alongside the mysterious group calling themselves the Demon Slayer Corps, Tanjirou will do whatever it takes to slay the demons and protect the remnants of his beloved sister's humanity.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Award Winning",
      "Supernatural"
    ],
    "themes": [
      "Historical"
    ]
  },
  {
    "id": 14131,
    "type": "anime",
    "title": "Girls & Panzer",
    "title_english": "Girls und Panzer",
    "title_japanese": "ガールズ&パンツァー",
    "image": "https://cdn.myanimelist.net/images/anime/9/40969.jpg",
    "synopsis": "\"Senshadou\" is a traditional sport using World War II era tanks in elimination-based matches. Widely practiced by women and girls alike, it's advertised as a form of art geared towards making ladies more prominent in culture and appealing to men. Becoming a worldwide phenomenon over time, the influence of senshadou leads to the creation of a world championship which will soon be held in Japan.\n\nMiho Nishizumi, who comes from a lineage of well-respected senshadou specialists, is at odds with the sport after a traumatic event led to her retirement and eventually a rift to form between her and her family. To steer clear of the practice as much as possible, she transfers to Ooarai Girls Academy where the senshadou program has been abolished. However, with the news of the upcoming championships, the school revives their tankery program, and Miho is pushed into joining.\n\nNow, with the aid of some new friends, she must overcome her past and once again take command of a squadron of tanks in an effort to save her school from closure, all while proving to her family that the Nishizumi-style of senshadou is not solely about victory.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action"
    ],
    "themes": [
      "CGDCT",
      "Military",
      "School"
    ]
  },
  {
    "id": 17895,
    "type": "anime",
    "title": "Golden Time",
    "title_english": "Golden Time",
    "title_japanese": "ゴールデンタイム",
    "image": "https://cdn.myanimelist.net/images/anime/12/52091.jpg",
    "synopsis": "Due to a tragic accident, Banri Tada is struck with amnesia, dissolving the memories of his hometown and past. However, after befriending Mitsuo Yanagisawa, he decides to move on and begin a new life at law school in Tokyo. But just as he is beginning to adjust to his college life, the beautiful Kouko Kaga dramatically barges into Banri's life, and their chance meeting marks the beginning of an unforgettable year. \n\nAfter having a glimpse of college life, Banri learns that he is in a new place and a new world—a place where he can be reborn, have new friends, fall in love, make mistakes, and grow. And as he begins to discover who he was, the path he has chosen leads him towards a blindingly bright life that he will never want to forget.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "Adult Cast",
      "Love Polygon"
    ]
  },
  {
    "id": 245,
    "type": "anime",
    "title": "Great Teacher Onizuka",
    "title_english": "Great Teacher Onizuka",
    "title_japanese": "グレート・ティーチャー・オニヅカ",
    "image": "https://cdn.myanimelist.net/images/anime/13/11460.jpg",
    "synopsis": "Twenty-two-year-old Eikichi Onizuka—ex-biker gang leader, conqueror of Shonan, and virgin—has a dream: to become the greatest high school teacher in all of Japan. This isn't because of a passion for teaching, but because he wants a loving teenage wife when he's old and gray. Still, for a perverted, greedy, and lazy delinquent, there is more to Onizuka than meets the eye. So when he lands a job as the homeroom teacher of the Class 3-4 at the prestigious Holy Forest Academy—despite suplexing the Vice Principal—all of his talents are put to the test, as this class is particularly infamous.\n\nDue to their utter contempt for all teachers, the class' students use psychological warfare to mentally break any new homeroom teacher they get, forcing them to quit and leave school. However, Onizuka isn't your average teacher, and he's ready for any challenge in his way.\n\nBullying, suicide, and sexual harassment are just a few of the issues his students face daily. By tackling the roots of their problems, Onizuka supports them with his unpredictable and unconventional methods—even if it means jumping off a building to save a suicidal child. Thanks to his eccentric charm and fun-loving nature, Class 3-4 slowly learns just how enjoyable school can be when you're the pupils of the Great Teacher Onizuka.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy"
    ],
    "themes": [
      "Delinquents",
      "School",
      "Workplace"
    ]
  },
  {
    "id": 2001,
    "type": "anime",
    "title": "Tengen Toppa Gurren Lagann",
    "title_english": "Gurren Lagann",
    "title_japanese": "天元突破グレンラガン",
    "image": "https://cdn.myanimelist.net/images/anime/4/5123.jpg",
    "synopsis": "Simon and Kamina were born and raised in a deep, underground village, hidden from the fabled surface. Kamina is a free-spirited loose cannon bent on making a name for himself, while Simon is a timid young boy with no real aspirations. One day while excavating the earth, Simon stumbles upon a mysterious object that turns out to be the ignition key to an ancient artifact of war, which the duo dubs Lagann. Using their new weapon, Simon and Kamina fend off a surprise attack from the surface with the help of Yoko Littner, a hot-blooded redhead wielding a massive gun who wanders the world above.\n\nIn the aftermath of the battle, the sky is now in plain view, prompting Simon and Kamina to set off on a journey alongside Yoko to explore the wastelands of the surface. Soon, they join the fight against the \"Beastmen,\" humanoid creatures that terrorize the remnants of humanity in powerful robots called \"Gunmen.\" Although they face some challenges and setbacks, the trio bravely fights these new enemies alongside other survivors to reclaim the surface, while slowly unraveling a galaxy-sized mystery.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Award Winning",
      "Sci-Fi"
    ],
    "themes": [
      "Mecha"
    ]
  },
  {
    "id": 20583,
    "type": "anime",
    "title": "Haikyuu!!",
    "title_english": "Haikyu!!",
    "title_japanese": "ハイキュー!!",
    "image": "https://cdn.myanimelist.net/images/anime/7/76014.jpg",
    "synopsis": "Ever since having witnessed the \"Little Giant\" and his astonishing skills on the volleyball court, Shouyou Hinata has been bewitched by the dynamic nature of the sport. Even though his attempt to make his debut as a volleyball regular during a middle school tournament went up in flames, he longs to prove that his less-than-impressive height ceases to be a hindrance in the face of his sheer will and perseverance.\n\nWhen Hinata enrolls in Karasuno High School, the Little Giant's alma mater, he believes that he is one step closer to his goal of becoming a professional volleyball player. Although the school only retains a shadow of its former glory, Hinata's conviction isn't shaken until he learns that Tobio Kageyama—the prodigy who humiliated Hinata's middle school volleyball team in a crushing defeat—is now his teammate.\n\nTo fulfill his desire of leaving a mark on the realm of volleyball—so often regarded as the domain of the tall and the strong—Hinata must smooth out his differences with Kageyama. Only when Hinata learns what it takes to be a part of a team will he be able to join the race to the top in earnest.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Sports"
    ],
    "themes": [
      "School",
      "Team Sports"
    ]
  },
  {
    "id": 46569,
    "type": "anime",
    "title": "Jigokuraku",
    "title_english": "Hell's Paradise",
    "title_japanese": "地獄楽",
    "image": "https://cdn.myanimelist.net/images/anime/1075/131925.jpg",
    "synopsis": "Sentenced to death, ninja Gabimaru the Hollow finds himself apathetic. After leading a blood-soaked life, Gabimaru believes he deserves to die. However, every attempt to execute him inexplicably fails. Finally, Sagiri Yamada Asaemon, a fledgling member of a famed executioner clan, is asked to take Gabimaru's life; yet Sagiri makes no move to kill him as requested.\n\nInsisting that Gabimaru will not die because of his love for his wife, Sagiri instead offers him the chance to obtain a full pardon for his crimes. If he can travel to the island of Shinsekyo and obtain the Elixir of Life—which supposedly grants immortality—and bring it back for the shogun, then his freedom will be assured.\n\nBut of the many who have traveled to Shinsekyo in search of the mythical Elixir, not a single person has returned sound of mind, if at all. Though unaware of the numerous dangers ahead, Gabimaru decides to accept the offer—alongside ten other death row convicts—in hope that he and his wife may finally live in peace.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Supernatural"
    ],
    "themes": [
      "Gore",
      "Historical",
      "Samurai"
    ]
  },
  {
    "id": 40938,
    "type": "anime",
    "title": "Hige wo Soru. Soshite Joshikousei wo Hirou.",
    "title_english": "Higehiro: After Being Rejected, I Shaved and Took in a High School Runaway",
    "title_japanese": "ひげを剃る。そして女子高生を拾う。",
    "image": "https://cdn.myanimelist.net/images/anime/1146/113477.jpg",
    "synopsis": "When regular salaryman Yoshida wakes up one Sunday morning after a long night at the bar, the last thing he expects to see is that his tiny apartment has a new resident—an unfamiliar high school girl.\n\nThe previous night, despite finally gathering the courage to confess to his boss and longtime crush, Airi Gotou, Yoshida was rejected. After drowning his sorrows at a bar with his good friend Hashimoto, Yoshida headed back to his home in a drunken stupor, only to run into Sayu Ogiwara, a runaway high schooler. She asked him to let her stay the night, and with his judgment clouded by alcohol, Yoshida complied.\n\nNow, with his head on straight but with no memory of last night's events, Yoshida has Sayu explain just how she ended up sleeping at his apartment. Having listened to her story, Yoshida finds himself unable to kick her out—especially after learning that she came all the way from Hokkaido! So, despite his reservations about sheltering an underage girl, Yoshida allows her to stay, and their life together begins.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": []
  },
  {
    "id": 146966,
    "type": "manga",
    "title": "Teenage Mercenary",
    "title_english": "Teenage Mercenary",
    "title_japanese": "입학용병",
    "image": "https://cdn.myanimelist.net/images/manga/3/260540.jpg",
    "synopsis": "When he was eight years old, Yu Ijin was the sole survivor of a fiery plane crash in a foreign land. To survive, he became a notorious mercenary—honing his arm-to-arm capabilities, marksmanship, and combat prowess into those of a skilled predator. However, 10 years later, after encountering soldiers deployed from South Korea, he rediscovers his remaining family: an adorable little sister named Dayun and a warm-hearted grandfather.\n\nUpon returning to his home country, a brand new trial is presented to Ijin—to assume the mundane life of a typical high school student. From scheming bullies to newfound friendships, every experience is new for Ijin. However, when his past begins to catch up to him, Ijin will have to use his years of experience on the battlefield to protect his loved ones.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 52405,
    "type": "anime",
    "title": "Highspeed Etoile",
    "title_english": "Highspeed Etoile",
    "title_japanese": "HIGHSPEED Étoile（ハイスピードエトワール）",
    "image": "https://cdn.myanimelist.net/images/anime/1719/143307.jpg",
    "synopsis": "With the introduction of Hybrid Performance Exceed Reactor (HyPER)—a technology that injects new life into racing—race cars can now reach incredible speeds of up to five hundred kilometers per hour. Five years after the inception of the NEX Race, a competition where the cars are enhanced by HyPER and even AI, one man stands as the undisputed champion. Having won every title since the inaugural NEX Race season, Lorenzo M. Salvatore is the king of the racing world.\n\nUnexpectedly entering the tournament is a former ballet dancer, Rin Rindou, who has been given a chance to become a real racer after setting a world record in a racing video game. Forced to give up dancing, Rin shifts her focus to chasing a new goal, despite her lack of experience. Making the most of her peculiar skill set and the NEX Race innovations, the young newcomer may just be the one to dethrone the absolute king.\n\n[Written by MAL Rewrite]",
    "genres": [],
    "themes": [
      "Racing"
    ]
  },
  {
    "id": 53421,
    "type": "anime",
    "title": "Dosanko Gal wa Namara Menkoi",
    "title_english": "Hokkaido Gals Are Super Adorable!",
    "title_japanese": "道産子ギャルはなまらめんこい",
    "image": "https://cdn.myanimelist.net/images/anime/1937/136906.jpg",
    "synopsis": "Having just moved from Tokyo to Hokkaido, high school student Tsubasa Shiki decides to explore the picturesque winter landscape he could never experience in the nation's capital. It only takes a moment for Tsubasa's idealized view of Japan's northernmost prefecture to crumble, as the sheer cold and frigid air quickly overwhelm him. While trying to find the way to his new home, Tsubasa runs into Minami Fuyuki—a talkative and friendly Hokkaido native who, despite the cold, is wearing a short skirt. The girl wastes no time in striking up a conversation, and Tsubasa comes to realize that the winter weather is not all that is too much for him to handle.\n\nThe next day, Tsubasa is shocked to learn that not only is Fuyuki in his class, but her seat is also right next to his. Swept along by Fuyuki's persistent advances, the young man soon becomes captivated by both life in Hokkaido and the beautiful girl determined to get closer to him. As he deepens his relationship with Fuyuki and meets other fashionable girls from his school, Tsubasa finds out that Hokkaido gals truly are adorable.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Love Status Quo",
      "School"
    ]
  },
  {
    "id": 58271,
    "type": "anime",
    "title": "Honey Lemon Soda",
    "title_english": "Honey Lemon Soda",
    "title_japanese": "ハニーレモンソーダ",
    "image": "https://cdn.myanimelist.net/images/anime/1382/144602.jpg",
    "synopsis": "First-year high school student Uka Ishimori wants a fresh start. In middle school, Uka was given the nickname \"Rocky\" by her peers, being misunderstood as having no emotions when she was actually shy and introverted. As a result, Uka was relentlessly bullied and experienced a lonely, isolated school life. Now, Uka is determined to change.\n\nDuring the first week of school, Uka accidentally gets drenched in lemon soda by her classmate Kai Miura—whose cool personality is the complete opposite of hers. After the incident, Uka is surprised when Kai performs small acts of kindness for her, encouraging her to gradually break out of her shell. Like a lemon soda, bubbly and exciting feelings are beginning to stir.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 163630,
    "type": "manga",
    "title": "Kuso Onna ni Sachi Are",
    "title_english": "Hope You're Happy, Lemon",
    "title_japanese": "クソ女に幸あれ",
    "image": "https://cdn.myanimelist.net/images/manga/1/294187.jpg",
    "synopsis": "\"I've been cheating on you. Oh, and it's not just one guy. It's three. Sorry about that.\" Back in middle school, Sunao Akiyoshi's first-ever girlfriend shattered his heart, and he swore off love. However, all that changes when he develops a crush on a girl in his university's film club. Just as he's finally beginning to move on from the past, he bumps into his ex-girlfriend. Little does he know that this is only the beginning... To his horror, he wakes up in her body the next morning!\n\n(Source: MANGA Plus)",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Love Polygon"
    ]
  },
  {
    "id": 42897,
    "type": "anime",
    "title": "Horimiya",
    "title_english": "Horimiya",
    "title_japanese": "ホリミヤ",
    "image": "https://cdn.myanimelist.net/images/anime/1695/111486.jpg",
    "synopsis": "On the surface, the thought of Kyouko Hori and Izumi Miyamura getting along would be the last thing in people's minds. After all, Hori has a perfect combination of beauty and brains, while Miyamura appears meek and distant to his fellow classmates. However, a fateful meeting between the two lays both of their hidden selves bare. Even though she is popular at school, Hori has little time to socialize with her friends due to housework. On the other hand, Miyamura lives under the noses of his peers, his body bearing secret tattoos and piercings that make him look like a gentle delinquent.\n\nHaving opposite personalities yet sharing odd similarities, the two quickly become friends and often spend time together in Hori's home. As they both emerge from their shells, they share with each other a side of themselves concealed from the outside world.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 59361,
    "type": "anime",
    "title": "Kono Kaisha ni Suki na Hito ga Imasu",
    "title_english": "I Have a Crush at Work",
    "title_japanese": "この会社に好きな人がいます",
    "image": "https://cdn.myanimelist.net/images/anime/1123/146384.jpg",
    "synopsis": "Coworkers Yui Mitsuya and Masugu Tateishi are the last people anyone would expect to get along—especially with their constant office quarrels. However, looks can be deceiving: they are actually dating! Afraid to lose the peace of their professional lives, Yui and Masugu play up their discord even more to ensure nobody discovers their secret.\n\nAs awkward situations and close calls pile up, the risk of Yui and Masugu's coworkers catching on increases. Keeping up the pretense is not easy, but with each new day, their relationship only grows stronger.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Adult Cast",
      "Workplace"
    ]
  },
  {
    "id": 56228,
    "type": "anime",
    "title": "Rekishi ni Nokoru Akujo ni Naru zo",
    "title_english": "I'll Become a Villainess Who Goes Down in History",
    "title_japanese": "歴史に残る悪女になるぞ",
    "image": "https://cdn.myanimelist.net/images/anime/1005/145339.jpg",
    "synopsis": "The kind and compassionate heroine of an otome game may be as flawless as she is admirable, but a certain young woman from Japan much prefers the villainess, Alicia Williams. She sees sense in Alicia's ruthless verbal abuse and values her discipline and fortitude. On the other hand, aside from always toying with Prince Duke Seeker's emotions, the commoner heroine seems to only spout lip service.\n\nGiven the choice, the young woman would love to be reincarnated as Alicia—and her wish suddenly comes true! Seven-year-old Alicia awakens with the memories of her past life, now aware of all the future events, outcomes, and the world's secrets. She has no fear; to outsmart the heroine and avoid a bad ending, all Alicia needs is hard work, mastery of her noble family's dark magic, and the determination to become the greatest villainess in history.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Fantasy",
      "Romance"
    ],
    "themes": [
      "Isekai",
      "Villainess"
    ]
  },
  {
    "id": 5231,
    "type": "anime",
    "title": "Inazuma Eleven",
    "title_english": "",
    "title_japanese": "イナズマイレブン",
    "image": "https://cdn.myanimelist.net/images/anime/1854/94704.jpg",
    "synopsis": "While other schools in Japan compete for the title of being the best soccer team in the country, Raimon Middle School's soccer club, Inazuma Eleven, struggles to rise from the verge of being disbanded. The grandson of Inazuma Eleven's first generation goalkeeper and captain of the team, Mamoru Endou, takes the challenge of kicking the long neglected club back into shape. To do this, he'll need a little help and more than a little luck.\n\nMamoru Endou finds hope in the hands of Shuuya Gouenji, a brilliant young player who has given up on soccer. Mamoru is determined to get Shuuya and other new recruits to join his team, no matter what the cost. Is his passion and determination enough to treat the ailing club? Or is there no more hope for the team?",
    "genres": [
      "Sports"
    ],
    "themes": [
      "Super Power",
      "Team Sports"
    ]
  },
  {
    "id": 185,
    "type": "anime",
    "title": "Initial D First Stage",
    "title_english": "Initial D First Stage",
    "title_japanese": "頭文字〈イニシャル〉D",
    "image": "https://cdn.myanimelist.net/images/anime/1384/127972.jpg",
    "synopsis": "Unlike his friends, Takumi Fujiwara is not particularly interested in cars, with little to no knowledge about the world of car enthusiasts and street racers. The son of a tofu shop owner, he is tasked to deliver tofu every morning without fail, driving along the mountain of Akina. Thus, conversations regarding cars or driving in general would only remind Takumi of the tiring daily routine forced upon him.\n\nOne night, the Akagi Red Suns, an infamous team of street racers, visit the town of Akina to challenge the local mountain pass. Led by their two aces, Ryousuke and Keisuke Takahashi, the Red Suns plan to conquer every racing course in Kanto, establishing themselves as the fastest crew in the region. However, much to their disbelief, one of their aces is overtaken by an old Toyota AE86 during a drive back home from Akina. After the incident, the Takahashi brothers are cautious of a mysterious driver geared with remarkable technique and experience in the local roads—the AE86 of Mount Akina.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Drama"
    ],
    "themes": [
      "Racing"
    ]
  },
  {
    "id": 48926,
    "type": "anime",
    "title": "Komi-san wa, Comyushou desu.",
    "title_english": "Komi Can't Communicate",
    "title_japanese": "古見さんは、コミュ症です。",
    "image": "https://cdn.myanimelist.net/images/anime/1899/117237.jpg",
    "synopsis": "Hitohito Tadano is an ordinary boy who heads into his first day of high school with a clear plan: to avoid trouble and do his best to blend in with others. Unfortunately, he fails right away when he takes the seat beside the school's  madonna—Shouko Komi. His peers now recognize him as someone to eliminate for a chance to sit next to the most beautiful girl in class.\n\nGorgeous and graceful with long, dark hair, Komi is universally adored and immensely popular despite her mysterious persona. However, unbeknownst to everyone, she has crippling anxiety and a communication disorder which prevents her from wholeheartedly socializing with her classmates.\n\nWhen left alone in the classroom, a chain of events forces Komi to interact with Tadano through writing on the blackboard, as if in a one-way conversation. Being the first person to realize she cannot communicate properly, Tadano picks up the chalk and begins to write as well. He eventually discovers that Komi's goal is to make one hundred friends during her time in high school. To this end, he decides to lend her a helping hand, thus also becoming her first-ever friend.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 39017,
    "type": "anime",
    "title": "Kyokou Suiri",
    "title_english": "In/Spectre",
    "title_japanese": "虚構推理",
    "image": "https://cdn.myanimelist.net/images/anime/1310/117188.jpg",
    "synopsis": "Hidden in plain sight, spirits known as youkai inhabit the world. While most are benign, a certain subset threatens the tenuous peace between youkai and humanity. Ever since she agreed to become their \"God of Wisdom,\" Kotoko Iwanaga has served as a mediator between the two realms, resolving any supernatural problems that come her way.\n\nAt a local hospital, Kotoko approaches Kurou Sakuragawa, a university student whose long-term relationship ended with an unfortunate breakup. Kotoko harbors feelings for him and suspects that something supernatural lurks within his harmless appearance, so she asks Kurou for his assistance in helping out youkai.\n\nTwo years later, news of an idol who was accidentally crushed to death by steel beams flooded the press. However, months later, sightings begin to tell of a faceless woman who wields a steel beam. As is the case for any supernatural problem, Kotoko and her partner set out to stop this spirit from wreaking havoc—but this case may prove to be far more sinister and personal than they could have ever thought.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Mystery",
      "Romance",
      "Supernatural"
    ],
    "themes": [
      "Adult Cast",
      "Mythology"
    ]
  },
  {
    "id": 36098,
    "type": "anime",
    "title": "Kimi no Suizou wo Tabetai",
    "title_english": "I Want To Eat Your Pancreas",
    "title_japanese": "君の膵臓をたべたい",
    "image": "https://cdn.myanimelist.net/images/anime/1768/93291.jpg",
    "synopsis": "The aloof protagonist: a bookworm who is deeply detached from the world he resides in. He has no interest in others and is firmly convinced that nobody has any interest in him either. His story begins when he stumbles across a handwritten book, titled Living with Dying. He soon identifies it as a secret diary belonging to his popular, bubbly classmate Sakura Yamauchi. She then confides in him about the pancreatic disease she is suffering from and that her time left is finite. Only her family knows about her terminal illness; not even her best friends are aware. Despite this revelation, he shows zero sympathy for her plight, but caught in the waves of Sakura's persistent buoyancy, he eventually concedes to accompanying her for her remaining days.\n\nAs the pair of polar opposites interact, their connection strengthens, interweaving through their choices made with each passing day. Her apparent nonchalance and unpredictability disrupts the protagonist's impassive flow of life, gradually opening his heart as he discovers and embraces the true meaning of living.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 56230,
    "type": "anime",
    "title": "Jiisan Baasan Wakagaeru",
    "title_english": "Grandpa and Grandma Turn Young Again",
    "title_japanese": "じいさんばあさん若返る",
    "image": "https://cdn.myanimelist.net/images/anime/1676/141714.jpg",
    "synopsis": "Shouzou Saitou and his wife, Ine, have been married for nearly sixty years. Though they have not become wealthy or been able to go on a honeymoon in all that time, their love has remained steadfast. The couple spend their days peacefully tending to an orchard of apple trees and receiving visits from their loving family.\n\nWhile tending to the apple tree they planted on their wedding day, which had snapped in half during a typhoon, the couple notices a golden apple hanging from one of the branches. They decide to eat the apple back at home, and the next morning, the couple awakens to find that they have become young again!\n\nIn their new but familiar bodies, Shouzou and Ine are able to live life as they never had before: they engage in more modern activities together, such as participating in a sports festival and playing video games. As they revisit the memories of their young love, the romance between them is rekindled, inspiring similar feelings in the younger members of their family.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance",
      "Supernatural"
    ],
    "themes": []
  },
  {
    "id": 14719,
    "type": "anime",
    "title": "JoJo no Kimyou na Bouken (TV)",
    "title_english": "JoJo's Bizarre Adventure (2012)",
    "title_japanese": "ジョジョの奇妙な冒険",
    "image": "https://cdn.myanimelist.net/images/anime/3/40409.jpg",
    "synopsis": "The year is 1868; English nobleman George Joestar and his son Jonathan become indebted to Dario Brando after being rescued from a carriage incident. What the Joestars don't realize, however, is that Dario had no intention of helping them; he believed they were dead and was trying to ransack their belongings. After Dario's death 12 years later, George—hoping to repay his debt—adopts his son, Dio. \n\nWhile he publicly fawns over his new father, Dio secretly plans to steal the Joestar fortune. His first step is to create a divide between George and Jonathan. By constantly outdoing his foster brother, Dio firmly makes his place in the Joestar family. But when Dio pushes Jonathan too far, Jonathan defeats him in a brawl. \n\nYears later, the two appear to be close friends to the outside world. But trouble brews again when George falls ill, as Jonathan suspects that Dio is somehow behind the incident—and it appears he has more tricks up his sleeve.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Supernatural"
    ],
    "themes": [
      "Historical",
      "Vampire"
    ]
  },
  {
    "id": 12679,
    "type": "anime",
    "title": "Joshiraku",
    "title_english": "Joshiraku",
    "title_japanese": "じょしらく",
    "image": "https://cdn.myanimelist.net/images/anime/8/48925.jpg",
    "synopsis": "Joshiraku follows the conversations of five rakugo storyteller girls relating the odd things that happen to them each day. Their comedic and satirical chatting covers all kinds of topics, from pointless observations of everyday life, to politics, manga, and more. Each girl has something new to add to the discussion, and the discourse never ends in the same place it began.\n\nEach of the rakugo girls has their own unique personality, with the energetic but immature Marii Buratei; the seemingly cute Kigurumi Haroukitei; the inherently lucky and carefree Tetora Bouhatei; the calm and violent Gankyou Kuurubiyuutei; and the pessimistic and unstable Kukuru Anrakutei. These girls—and their mysterious friend in a wrestling mask—give their observations to the audience, either backstage at the rakugo theater or in various famous locations around Tokyo.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy"
    ],
    "themes": [
      "Adult Cast",
      "Gag Humor",
      "Parody",
      "Performing Arts"
    ]
  },
  {
    "id": 40748,
    "type": "anime",
    "title": "Jujutsu Kaisen",
    "title_english": "Jujutsu Kaisen",
    "title_japanese": "呪術廻戦",
    "image": "https://cdn.myanimelist.net/images/anime/1171/109222.jpg",
    "synopsis": "Idly indulging in baseless paranormal activities with the Occult Club, high schooler Yuuji Itadori spends his days at either the clubroom or the hospital, where he visits his bedridden grandfather. However, this leisurely lifestyle soon takes a turn for the strange when he unknowingly encounters a cursed item. Triggering a chain of supernatural occurrences, Yuuji finds himself suddenly thrust into the world of Curses—dreadful beings formed from human malice and negativity—after swallowing the said item, revealed to be a finger belonging to the demon Sukuna Ryoumen, the King of Curses.\n\nYuuji experiences first-hand the threat these Curses pose to society as he discovers his own newfound powers. Introduced to the Tokyo Prefectural Jujutsu High School, he begins to walk down a path from which he cannot return—the path of a Jujutsu sorcerer.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Award Winning",
      "Supernatural"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 168312,
    "type": "manga",
    "title": "Childhood Friend Complex",
    "title_english": "Childhood Friend Complex",
    "title_japanese": "소꿉친구 컴플렉스",
    "image": "https://cdn.myanimelist.net/images/manga/2/308311.jpg",
    "synopsis": "Ha-neul and Mincheol have been childhood friends for all of their lives, but their relationship takes on a whole new dynamic when they undergo a series of unexpected events. Although they vowed that they'd never be romantically attracted to each other, they just might be proven wrong... especially when things start to escalate and neither can predict where they'll end up.\n\n(Source: Webtoon Entertainment)",
    "genres": [
      "Comedy",
      "Erotica"
    ],
    "themes": []
  },
  {
    "id": 37999,
    "type": "anime",
    "title": "Kaguya-sama wa Kokurasetai: Tensai-tachi no Renai Zunousen",
    "title_english": "Kaguya-sama: Love is War",
    "title_japanese": "かぐや様は告らせたい～天才たちの恋愛頭脳戦～",
    "image": "https://cdn.myanimelist.net/images/anime/1295/106551.jpg",
    "synopsis": "At the renowned Shuchiin Academy, Miyuki Shirogane and Kaguya Shinomiya are the student body's top representatives. Ranked the top student in the nation and respected by peers and mentors alike, Miyuki serves as the student council president. Alongside him, the vice president Kaguya—eldest daughter of the wealthy Shinomiya family—excels in every field imaginable. They are the envy of the entire student body, regarded as the perfect couple.\n\nHowever, despite both having already developed feelings for the other, neither are willing to admit them. The first to confess loses, will be looked down upon, and will be considered the lesser. With their honor and pride at stake, Miyuki and Kaguya are both equally determined to be the one to emerge victorious on the battlefield of love!\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 52588,
    "type": "anime",
    "title": "Kaijuu 8-gou",
    "title_english": "Kaiju No. 8",
    "title_japanese": "怪獣8号",
    "image": "https://cdn.myanimelist.net/images/anime/1370/140362.jpg",
    "synopsis": "After the destruction of their hometown, childhood friends Kafka Hibino and Mina Ashiro make a pact to become officers in the Defense Force—a militarized organization tasked with protecting Japan from colossal monsters known as \"kaijuu.\" Decades later, the 32-year-old Kafka has all but given up on his dreams of heroism. Instead, he cleans up the remains of the slaughtered kaijuu after they are defeated by valiant soldiers—including Mina, who has successfully achieved their shared goal.\n\nUpon meeting his new coworker, Reno Ichikawa, Kafka faces a mirror of his past self: an ambitious young man whose one desire is to fight as a member of the Defense Force. Unfortunately, the two are soon involved in a freak encounter with a rogue kaijuu. Though Kafka demonstrates his innate heroic nature and rescues Reno from certain doom, he is left gravely injured.\n\nWhile both men recover in a hospital, Kafka is seemingly attacked by another one of the beasts. As a result, he gains the ability to transform into a humanoid kaijuu with the strength and powers of the massive monsters menacing Japan. Dubbed \"Kaijuu No. 8\" by the military, Kafka resolves to use his newfound gifts for the greater good. Tied together by mutual respect, Kafka and Reno set out to join warriors like Mina at the forefront of the Defense Force.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Fantasy",
      "Sci-Fi"
    ],
    "themes": [
      "Adult Cast",
      "Military",
      "Urban Fantasy"
    ]
  },
  {
    "id": 34933,
    "type": "anime",
    "title": "Kakegurui",
    "title_english": "Kakegurui",
    "title_japanese": "賭ケグルイ",
    "image": "https://cdn.myanimelist.net/images/anime/3/86578.jpg",
    "synopsis": "Unlike many schools, attending Hyakkaou Private Academy prepares students for their time in the real world. Since many of the students are the children of the richest people in the world, the academy has its quirks that separate it from all the others. By day, it is a normal school, educating its pupils in history, languages, and the like. But at night, it turns into a gambling den, educating them in the art of dealing with money and manipulating people. Money is power; those who come out on top in the games stand at the top of the school.\n\nYumeko Jabami, a seemingly naive and beautiful transfer student, is ready to try her hand at Hyakkaou's special curriculum. Unlike the rest, she doesn't play to win, but for the thrill of the gamble, and her borderline insane way of gambling might just bring too many new cards to the table.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Mystery",
      "Suspense"
    ],
    "themes": [
      "High Stakes Game",
      "Psychological",
      "School",
      "Strategy Game"
    ]
  },
  {
    "id": 59452,
    "type": "anime",
    "title": "Katainaka no Ossan, Kensei ni Naru",
    "title_english": "From Old Country Bumpkin to Master Swordsman",
    "title_japanese": "片田舎のおっさん、剣聖になる",
    "image": "https://cdn.myanimelist.net/images/anime/1069/148148.jpg",
    "synopsis": "For 20 years, Beryl Gardenant has taught various people as the master of his father's sword-fighting dojo in a backwater village. Many have become astounding swordsmen themselves, but Beryl remains quite humble, referring to himself as an old man. His former disciples all disagree, including Allucia Citrus, a girl who graduated from Beryl's training over 10 years ago and is currently the commander of the Royal Order of Knights.\n\nWishing to reveal her cherished teacher's true greatness, Allucia recommends Beryl to her superiors, leading to his appointment as a special instructor for the Order by imperial command. She delivers the news herself—though Beryl has yet to realize her deeper motive. Pressured by his aging parents, Beryl reluctantly accepts the job and moves to the capital. There, he meets more of his past students, such as Surena Lysandra, now a black-rank adventurer, and Ficelle Harbeller, a prominent member of the Magic Corps. Before long, word begins to spread: not even the strongest warriors can match the \"old man\" from the countryside.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": []
  },
  {
    "id": 18679,
    "type": "anime",
    "title": "Kill la Kill",
    "title_english": "Kill la Kill",
    "title_japanese": "キルラキル",
    "image": "https://cdn.myanimelist.net/images/anime/1464/111943.jpg",
    "synopsis": "After the murder of her father, Ryuuko Matoi has been wandering the land in search of his killer. Following her only lead—the missing half of his invention, the Scissor Blade—she arrives at the prestigious Honnouji Academy, a high school unlike any other. The academy is ruled by the imposing and cold-hearted student council president Satsuki Kiryuuin alongside her powerful underlings, the Elite Four. In the school's brutally competitive hierarchy, Satsuki bestows upon those at the top special clothes called \"Goku Uniforms,\" which grant the wearer unique superhuman abilities. \n\nThoroughly beaten in a fight against one of the students in uniform, Ryuuko retreats to her razed home where she stumbles across Senketsu, a rare and sentient \"Kamui,\" or God Clothes. After coming into contact with Ryuuko's blood, Senketsu awakens, latching onto her and providing her with immense power. Now, armed with Senketsu and the Scissor Blade, Ryuuko makes a stand against the Elite Four, hoping to reach Satsuki and uncover the culprit behind her father's murder once and for all. \n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy",
      "Fantasy",
      "Ecchi"
    ],
    "themes": [
      "School",
      "Urban Fantasy"
    ]
  },
  {
    "id": 6045,
    "type": "anime",
    "title": "Kimi ni Todoke",
    "title_english": "Kimi ni Todoke: From Me to You",
    "title_japanese": "君に届け",
    "image": "https://cdn.myanimelist.net/images/anime/1502/124384.jpg",
    "synopsis": "Known for her semblance to the Sadako character of The Ring series, Sawako Kuronuma is given the nickname \"Sadako\" and misunderstood to be frightening and malicious like her fictional counterpart, despite having a timid and sweet nature. Longing to make friends and live a normal life, Sawako is naturally drawn to the cheerful and friendly Shouta Kazehaya, the most popular boy in her class. From their first meeting, Sawako has admired Kazehaya's ability to be the center of attention and aspires to be like him.\n\nWhen Kazehaya organizes a test of courage for the entire class and encourages her to attend, Sawako sees this as an opportunity to get along with her classmates, starting with Ayane Yano and Chizuru Yoshida. Through each new encounter and emotion she experiences, Sawako believes that meeting Kazehaya has changed her for the better. Little does Sawako know, her presence has also changed Kazehaya.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 57611,
    "type": "anime",
    "title": "Kimi wa Meido-sama.",
    "title_english": "You are Ms. Servant.",
    "title_japanese": "君は冥土様。",
    "image": "https://cdn.myanimelist.net/images/anime/1909/144684.jpg",
    "synopsis": "One day, Hitoyoshi Yokoya wakes up to a mysterious nameless girl dressed as a maid ringing his doorbell, asking to be his servant. With her former master referring her to the Yokoya household, she offers her expertise as an assassin. Intimidated by her background, Hitoyoshi tries to send her away; but when she leaves something behind, he rushes to return it to her and is nearly hit by a truck in the process. With her fast reflexes, the girl saves him just in time, and Hitoyoshi ends up taking her in. \n\nIronically, the maid lacks any skills apart from the art of killing she has perfected since childhood. Nevertheless, Hitoyoshi welcomes the girl with open arms, encouraging her to leave her monochromatic past behind and experience a normal life. To seal the deal, Hitoyoshi names her Yuki, marking the beginning of her path to redemption and happiness.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": []
  },
  {
    "id": 23273,
    "type": "anime",
    "title": "Shigatsu wa Kimi no Uso",
    "title_english": "Your Lie in April",
    "title_japanese": "四月は君の嘘",
    "image": "https://cdn.myanimelist.net/images/anime/1405/143284.jpg",
    "synopsis": "Kousei Arima is a child prodigy known as the \"Human Metronome\" for playing the piano with precision and perfection. Guided by a strict mother and rigorous training, Kousei dominates every competition he enters, earning the admiration of his musical peers and praise from audiences. When his mother suddenly passes away, the subsequent trauma makes him unable to hear the sound of a piano, and he never takes the stage thereafter.\n\nNowadays, Kousei lives a quiet and unassuming life as a junior high school student alongside his friends Tsubaki Sawabe and Ryouta Watari. While struggling to get over his mother's death, he continues to cling to music. His monochrome life turns upside down the day he encounters the eccentric violinist Kaori Miyazono, who thrusts him back into the spotlight as her accompanist. Through a little lie, these two young musicians grow closer together as Kaori tries to fill Kousei's world with color.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "Love Polygon",
      "Music",
      "Performing Arts",
      "School"
    ]
  },
  {
    "id": 62613,
    "type": "anime",
    "title": "Youchien Wars",
    "title_english": "",
    "title_japanese": "幼稚園WARS",
    "image": "https://cdn.myanimelist.net/images/anime/1670/152348.jpg",
    "synopsis": "Kindergarten Noir is widely known as the world's safest kindergarten. Attended by the children of wealthy and notable figures, its defenses are seemingly impenetrable, even though assassination attempts are a big part of the daily routine. However, the teachers of the kindergarten are far from ordinary—they are all convicted criminals trying to reduce their sentences.\n\nThe recently joined legendary assassin named Rita is no different. According to her contract, she must work as a teacher for a full year to be released. Rita quickly proves her worth with unmatched combat skills, but even the notorious assassin has a weakness: she longs for a handsome boyfriend, which leaves her vulnerable in combat when faced with a particularly attractive opponent. Rita and her colleagues continue to ensure the children's safety to gain freedom, but Rita never stops looking for the man of her dreams.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy"
    ],
    "themes": []
  },
  {
    "id": 60083,
    "type": "anime",
    "title": "Kowloon Generic Romance",
    "title_english": "Kowloon Generic Romance",
    "title_japanese": "九龍ジェネリックロマンス",
    "image": "https://cdn.myanimelist.net/images/anime/1719/150050.jpg",
    "synopsis": "With its flickering streetlights, moldy back alleys, and noisy populace, the Second Kowloon Walled City, despite the squalor of its already-demolished predecessor, evokes a special kind of nostalgia that its residents find endearing. Amidst the walls of this fading yet beloved landscape lives Reiko Kujirai, a 32-year-old realtor deeply in love with her coworker, Hajime Kudou, who is two years her junior. Though they have their differences, the two get along well enough to experience the joys of the walled city together.\n\nHowever, everything starts to fall apart when Kudou, half-asleep, suddenly kisses Kujirai—seemingly reciprocating the feelings she has yet to confess. But when Kudou explains that he had mistaken her for someone else, Kujirai finds herself drawn into a series of events that lead her to a past she cannot remember.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Mystery",
      "Romance",
      "Sci-Fi"
    ],
    "themes": [
      "Adult Cast",
      "Workplace"
    ]
  },
  {
    "id": 11771,
    "type": "anime",
    "title": "Kuroko no Basket",
    "title_english": "Kuroko's Basketball",
    "title_japanese": "黒子のバスケ",
    "image": "https://cdn.myanimelist.net/images/anime/11/50453.jpg",
    "synopsis": "For the last three years, Teikou Middle School has dominated the national basketball scene with its legendary lineup: the \"Generation of Miracles.\" It consisted of five prodigies who excelled at the sport, but a \"Phantom Sixth Man\" lurked in the shadows and helped earn the team their revered status. Eventually, their monstrous growth jaded them from the sport they loved and made them go their separate ways in high school.\n\nIn search of new members, the Seirin High School basketball team recruits Taiga Kagami and Tetsuya Kuroko, two freshmen who seem to have significant differences in abilities. Having returned recently from America, Kagami has both a natural aptitude and relentless love for the sport. Meanwhile, Kuroko lacks presence and exhibits no outstanding athletic talent. However, it is later revealed that he is Teikou's Phantom Sixth Man—the player once part of the Generation of Miracles.\n\nKuroko wants to prove to the Seirin team that he is strong in his own way. Seeing his conviction, Kagami forms a dynamic partnership with Kuroko, the latter promising to support Kagami's \"light\" as his \"shadow.\" Alongside their new Seirin teammates, they aim to conquer the upcoming Interhigh championship, but the reappearance of Kuroko's former teammates complicates their plan.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Sports"
    ],
    "themes": [
      "School",
      "Team Sports"
    ]
  },
  {
    "id": 17729,
    "type": "anime",
    "title": "Grisaia no Kajitsu",
    "title_english": "The Fruit of Grisaia",
    "title_japanese": "グリザイアの果実",
    "image": "https://cdn.myanimelist.net/images/anime/1645/112632.jpg",
    "synopsis": "Yuuji Kazami is a transfer student who has just been admitted into Mihama Academy. He wants to live an ordinary high school life, but this dream of his may not come true any time soon as Mihama Academy is quite the opposite. Consisting of only the principal and five other students, all of whom are girls, Yuuji becomes acquainted with each of them, discovering more about their personalities as socialization is inevitable. Slowly, he begins to learn about the truth behind the small group of students occupying the academy—they each have their own share of traumatic experiences which are tucked away from the world.\n\nMihama Academy acts as a home for these girls, they are the \"fruit\" which fell from their trees and have begun to decay. It is up to Yuuji to become the catalyst to save them from themselves, but how can he save another when he cannot even save himself?\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance",
      "Suspense"
    ],
    "themes": [
      "Harem",
      "Psychological",
      "School"
    ]
  },
  {
    "id": 51288,
    "type": "anime",
    "title": "Zuoshou Shanglan",
    "title_english": "Left-Hand Layup!",
    "title_japanese": "左手上篮",
    "image": "https://cdn.myanimelist.net/images/anime/1700/122189.jpg",
    "synopsis": "The story follows teenager Xu Xingze, a passionate basketball player who aspires to join the Basketball Team of the regions top school after seeing their Star Player win the Final Four Tournament. When his sister accidentally enrolls him into a lesser school with a similar name, its up to Xu and his ragtag group of new friends to prove their worth and their skill on the Court against some of the top High School players in the Region.",
    "genres": [
      "Sports"
    ],
    "themes": [
      "Team Sports"
    ]
  },
  {
    "id": 54492,
    "type": "anime",
    "title": "Kusuriya no Hitorigoto",
    "title_english": "The Apothecary Diaries",
    "title_japanese": "薬屋のひとりごと",
    "image": "https://cdn.myanimelist.net/images/anime/1708/138033.jpg",
    "synopsis": "Maomao, an apothecary's daughter, has been plucked from her peaceful life and sold to the lowest echelons of the imperial court. Now merely a maid, Maomao settles into her new mundane life and hides her extensive knowledge of medicine in order to avoid any unwanted attention.\n\nNot long after Maomao's arrival, the emperor's infant children inexplicably begin to experience grave symptoms—almost as if a curse has been cast. The curious Maomao easily solves the mystery and, to remain out of the limelight, attempts to leave an anonymous tip. Unfortunately, the dashing and perceptive eunuch Jinshi sees through it and manages to single her out.\n\nIn recognition of her talent, Maomao is promoted to lady-in-waiting for the emperor's favorite concubine, Gyokuyou. As Maomao continues to remedy the numerous ailments afflicting the imperial court, her pharmaceutical expertise quickly proves indispensable.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Mystery"
    ],
    "themes": [
      "Historical",
      "Medical"
    ]
  },
  {
    "id": 48633,
    "type": "anime",
    "title": "Liar Liar",
    "title_english": "",
    "title_japanese": "ライアー・ライアー",
    "image": "https://cdn.myanimelist.net/images/anime/1571/134525.jpg",
    "synopsis": "Hiroto Shinohara is a new transfer student to Academy Island, where games determine student rankings. The more games won, the more stars a student has, with the highest ranking being that of a Seven Star. On Hiroto's first day, he accidentally antagonizes Sarasa Saionji, the so-called Empress of Academy Island and granddaughter of the island's head director. Forced into a game fueled by misunderstandings that he somehow ends up winning, he is thrust into a major bluff where he must lie about his ranking or risk expulsion from the school and island.\n\nFortunately, with the help of the mysterious Company headed by Shirayuki Himeji, Hiroto is not alone in his bluff. The Company will do everything in its power to help him cheat his way through the game challenges sent his way by students wanting to beat him. Though he is a One Star student, he must fight as though he is actually a Seven Star, and overcome insurmountable odds in his quest to search for a missing girl from his past.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Suspense"
    ],
    "themes": [
      "Psychological",
      "School",
      "Strategy Game"
    ]
  },
  {
    "id": 44074,
    "type": "anime",
    "title": "Shiguang Dailiren",
    "title_english": "Link Click",
    "title_japanese": "時光代理人",
    "image": "https://cdn.myanimelist.net/images/anime/1135/114867.jpg",
    "synopsis": "It is said that a picture is worth a thousand words. In this case, it holds an infinite amount of secrets. These are secrets that only Cheng Xiaoshi and Lu Guang are able to find. In a small shop called \"Time Photo Studio,\" the two friends provide a special service: using their extraordinary powers that let them enter photographs, they jump into pictures brought to them by clients in order to grant their wishes. Through the eyes of the photographer, they live through the events surrounding the picture and try to decipher how to solve their client's request.\n\nBut every time they jump into a picture, they take a great risk. One wrong move and they could alter the future of the person who took the picture... and possibly countless other events too. So when the events they are forced to live through in these pictures start to become personal, it will take the utmost strength to push their feelings aside and focus on accomplishing the task they were paid to do.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Mystery",
      "Suspense"
    ],
    "themes": [
      "Adult Cast",
      "Super Power",
      "Time Travel"
    ]
  },
  {
    "id": 48643,
    "type": "anime",
    "title": "Koi wa Sekai Seifuku no Ato de",
    "title_english": "Love After World Domination",
    "title_japanese": "恋は世界征服のあとで",
    "image": "https://cdn.myanimelist.net/images/anime/1347/120593.jpg",
    "synopsis": "Fudou Aikawa and Desumi Magahara have just started dating, but no one is allowed to know! Nicknamed \"Red Gelato,\" Fudou is the leader of \"Gelato 5,\" a group of heroes dedicated to protecting Japan. On the other hand, the \"Reaper Princess\" Desumi is one of the combatant leaders of \"Gekko,\" an evil secret society bent on world domination and considered Gelato 5's greatest foe. As they pretend to be mortal enemies, Fudou and Desumi sneak away from battle to spend time together.\n\nDespite their inexperience with romance, Fudou and Desumi strive to make their relationship work while avoiding suspicion from their comrades. With their loyalties divided between each other and their respective sides, the couple will have to stay on guard if they want to keep their love a secret from the rest of the world.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy",
      "Fantasy",
      "Romance"
    ],
    "themes": [
      "Parody",
      "Urban Fantasy"
    ]
  },
  {
    "id": 157874,
    "type": "manga",
    "title": "Renai Daikou",
    "title_english": "Love Agency",
    "title_japanese": "恋愛代行",
    "image": "https://cdn.myanimelist.net/images/manga/3/292236.jpg",
    "synopsis": "Half-Japanese Half-Swedish Mari Maria Winter Nanase has everything in life. She was raised in a well-off family in Scandinavia and America, she is popular among the girls, and she has good looks. However, she is missing one thing: she can't talk to boys!\n\nAfter picking up a book on love in the library, she found a suspicious-looking ad on the back. The ad was for Love Agency, a service promising a \"pro in love\" to handle your love for you. When she scans it, an agent called \"Kon-chan\" pops out and promises to help her fall in love with her crush. However, her crush, Masaya Seki, isn't so innocent in his ways either and is also using this app to get with her. How will this pair of hopeless lovers turn out?",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 35484,
    "type": "anime",
    "title": "Osake wa Fuufu ni Natte kara",
    "title_english": "Love is Like a Cocktail",
    "title_japanese": "お酒は夫婦になってから",
    "image": "https://cdn.myanimelist.net/images/anime/1684/108627.jpg",
    "synopsis": "Chisato Mizusawa is a calm and collected assistant office manager who apparently dislikes drinking alcohol. But she actually likes it and has a secret side to her that emerges only when drunk: her cute persona, which she only reveals to her husband, the bartender Sora. Each day when Chisato comes home, Sora takes care of his beloved wife, providing her with a good meal and a fresh drink. These drinks include Plum Splet, Irish Coffee, Orange Breeze, and many more tasty concoctions that she eagerly gulps down. But as much as she likes alcohol, she loves her kindhearted husband more. Together, they share a life that is filled with happiness—and the more-than-occasional cocktail.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Gourmet",
      "Romance"
    ],
    "themes": [
      "Adult Cast"
    ]
  },
  {
    "id": 50709,
    "type": "anime",
    "title": "Lycoris Recoil",
    "title_english": "Lycoris Recoil",
    "title_japanese": "リコリス・リコイル",
    "image": "https://cdn.myanimelist.net/images/anime/1261/127311.jpg",
    "synopsis": "The number of terrorist acts in Japan has never been lower, thanks to the efforts of a syndicate called Direct Attack (DA). The organization raises orphaned girls as killers to carry out assassinations under their \"Lycoris\" program. Takina Inoue is an exceptional Lycoris with a strong sense of purpose and a penchant for perfection. Unfortunately, a hostage situation tests her patience, and the resulting act of insubordination leads to her transfer out of DA. Not thrilled about losing the only place she belonged to, she reluctantly arrives at her new base of operations—LycoReco, a cafe in disguise.\n\nTakina's new partner, however, turns out to be quite different from what she imagined. Despite being the famed Lycoris prodigy, Chisato Nishikigi appears almost unconcerned with her duties. She drags Takina along on all kinds of odd jobs under the simple explanation of helping people in need. Takina is even more puzzled when Chisato takes down a group of armed assailants without killing any of them. Feeling like a fish out of water, Takina itches to get reinstated into DA—but Chisato is determined to prove to her that there is more to a life than just taking them.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action"
    ],
    "themes": []
  },
  {
    "id": 14833,
    "type": "anime",
    "title": "Maoyuu Maou Yuusha",
    "title_english": "Maoyu",
    "title_japanese": "まおゆう魔王勇者",
    "image": "https://cdn.myanimelist.net/images/anime/4/46041.jpg",
    "synopsis": "Fifteen years have passed since the war between humans and demons began. Dissatisfied with their slow advance into the Demon Realm, the Hero abandons his companions to quickly forge ahead towards the Demon Queen's castle. Upon his arrival at the royal abode, the Hero makes a startling discovery: not only is the Demon Queen a woman of unparalleled beauty, but she also seeks the Hero's help. Confused by this unexpected turn of events, the Hero refuses to ally himself with his enemy, claiming that the war the demons have waged is tearing the Southern Nations apart.\n\nHowever, the Demon Queen rebuts, arguing that the war has not only united humanity but has also brought them wealth and prosperity, providing evidence to support her claims. Furthermore, she explains that if the war were to end, the supplies sent by the Central Nations in aid to the Southern Nations would cease, leaving hundreds of thousands to starve. Fortunately, she offers the Hero a way to end the war while bringing hope not only to the Southern Nations, but also to the rest of the world, though she will need his assistance to make this a reality.\n\nFinally convinced, the Hero agrees to join his now former enemy in her quest. Vowing to stay together through sickness and health, they set off for the human world.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Adventure",
      "Fantasy",
      "Romance"
    ],
    "themes": []
  },
  {
    "id": 52211,
    "type": "anime",
    "title": "Mashle",
    "title_english": "Mashle: Magic and Muscles",
    "title_japanese": "マッシュル-MASHLE-",
    "image": "https://cdn.myanimelist.net/images/anime/1218/135107.jpg",
    "synopsis": "In this magical world, one is easily identified as having magical abilities by a distinctive mark on their face. Those unable to practice magic are swiftly exterminated to maintain the magical integrity of society. However, deep within a forest lies an anomaly in Mash Burnedead, who can be found pumping iron with one arm and lifting a cream puff with the other. This aloof boy with superhuman strength—but no magical abilities—leads a quiet life with his father, far removed from society.\n\nMash's peace is soon disturbed when the authorities discover his lack of magical powers. They issue him an ultimatum: compete to become a Divine Visionary, which would force everyone to accept him, or be persecuted forever. To protect his family, he enrolls in the prestigious Easton Magic Academy, which only the most elite and gifted students are allowed to attend. Now, Mash must overcome his shortcomings as a magic-less being and surpass the other students—relying solely on his muscles.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy",
      "Fantasy"
    ],
    "themes": [
      "Gag Humor",
      "Parody",
      "School"
    ]
  },
  {
    "id": 8460,
    "type": "anime",
    "title": "Mirai Nikki",
    "title_english": "The Future Diary OVA",
    "title_japanese": "未来日記",
    "image": "https://cdn.myanimelist.net/images/anime/10/22971.jpg",
    "synopsis": "A short OVA that was bundled with the limited edition of the eleventh volume of the manga.",
    "genres": [
      "Action",
      "Supernatural",
      "Suspense"
    ],
    "themes": [
      "High Stakes Game",
      "Survival"
    ]
  },
  {
    "id": 53865,
    "type": "anime",
    "title": "Yozakura-san Chi no Daisakusen",
    "title_english": "Mission: Yozakura Family",
    "title_japanese": "夜桜さんちの大作戦",
    "image": "https://cdn.myanimelist.net/images/anime/1674/143715.jpg",
    "synopsis": "After losing his entire family in a car crash, Taiyou Asano tries to pull away from his childhood friend, Mutsumi Yozakura, but she assures him she is not going anywhere. Nevertheless, Taiyou becomes socially awkward, struggling to make friends at school despite the efforts of his persistent classmates.\n\nOne day, the vice principal calls Taiyou to his office, only to begin threatening the boy's life. Taiyou is swept away by a stranger and eventually awakens to Mutsumi, who introduces him to her siblings—a family of spies who harbor superhuman abilities. Every generation produces one ordinary human who becomes the family head. Mutsumi is one of these, and the family's mission is to protect her with their lives. \n\nThe vice principal's real name is Kyoichiro Yozakura, and he is the eldest son of the family. As Kyouichiro believes that Taiyou is a threat to Mutsumi's life, the only way to keep both Taiyou and Mutsumi safe is for them to get married; the family has a rule that prevents them from killing within the Yozakura household. Though at first reluctant, Taiyou agrees in order to protect Mutsumi. Now he must train as a Yozakura spy to ward off the constant threats on the lives of both Mutsumi and himself.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy"
    ],
    "themes": []
  },
  {
    "id": 32182,
    "type": "anime",
    "title": "Mob Psycho 100",
    "title_english": "Mob Psycho 100",
    "title_japanese": "モブサイコ100",
    "image": "https://cdn.myanimelist.net/images/anime/8/80356.jpg",
    "synopsis": "Eighth-grader Shigeo \"Mob\" Kageyama has tapped into his inner wellspring of psychic prowess at a young age. But the power quickly proves to be a liability when he realizes the potential danger in his skills. Choosing to suppress his power, Mob's only present use for his ability is to impress his longtime crush, Tsubomi, who soon grows bored of the same tricks.\n\nIn order to effectuate control on his skills, Mob enlists himself under the wing of Arataka Reigen, a con artist claiming to be a psychic, who exploits Mob's powers for pocket change. Now, exorcising evil spirits on command has become a part of Mob's daily, monotonous life. However, the psychic energy he exerts is barely the tip of the iceberg; if his vast potential and unrestrained emotions run berserk, a cataclysmic event that would render him completely unrecognizable will be triggered. The progression toward Mob's explosion is rising and attempting to stop it is futile.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy",
      "Supernatural"
    ],
    "themes": []
  },
  {
    "id": 52934,
    "type": "anime",
    "title": "Konyaku Haki sareta Reijou wo Hirotta Ore ga, Ikenai Koto wo Oshiekomu",
    "title_english": "I'm Giving the Disgraced Noble Lady I Rescued a Crash Course in Naughtiness",
    "title_japanese": "婚約破棄された令嬢を拾った俺が、イケナイことを教え込む",
    "image": "https://cdn.myanimelist.net/images/anime/1720/139131.jpg",
    "synopsis": "On the run for crimes she did not commit, disgraced noblewoman Charlotte Evans collapses deep in the forest. A sorcerer named Allen Crawford—also known as the \"Demon Lord\"—finds and defends Charlotte from her pursuers. Since she has no place left to go, Allen takes pity on Charlotte and offers to hire her as a live-in maid.\n\nAllen quickly realizes that Charlotte has faced ridicule and hatred all her life from her so-called noble family, and she has never known what true freedom feels like. He decides to teach her about all the naughty things the world has to offer and enables her to surrender to her whims and impulses. Charlotte's sweet innocence proves an obstacle to his plans, but Allen is determined to show her the kind of life her family has denied her.\n\nAlthough he despises being social, Allen begins to open himself up to Charlotte. The longer they live together, the more they discover their similarities. Though most people have abandoned them, the duo promises to stay together, oblivious to their budding feelings for each other.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Fantasy",
      "Romance"
    ],
    "themes": []
  },
  {
    "id": 37430,
    "type": "anime",
    "title": "Tensei shitara Slime Datta Ken",
    "title_english": "That Time I Got Reincarnated as a Slime",
    "title_japanese": "転生したらスライムだった件",
    "image": "https://cdn.myanimelist.net/images/anime/1069/123309.jpg",
    "synopsis": "Thirty-seven-year-old Satoru Mikami is a typical corporate worker, who is perfectly content with his monotonous lifestyle in Tokyo, other than failing to nail down a girlfriend even once throughout his life. In the midst of a casual encounter with his colleague, he falls victim to a random assailant on the streets and is stabbed. However, while succumbing to his injuries, a peculiar voice echoes in his mind, and recites a bunch of commands which the dying man cannot make sense of.\n\nWhen Satoru regains consciousness, he discovers that he has reincarnated as a goop of slime in an unfamiliar realm. In doing so, he acquires newfound skills—notably, the power to devour anything and mimic its appearance and abilities. He then stumbles upon the sealed Catastrophe-level monster \"Storm Dragon\" Veldora who had been sealed away for the past 300 years for devastating a town to ashes. Sympathetic to his predicament, Satoru befriends him, promising to assist in destroying the seal. In return, Veldora bestows upon him the name Rimuru Tempest to grant him divine protection. \n\nNow, liberated from the mundanities of his past life, Rimuru embarks on a fresh journey with a distinct goal in mind. As he grows accustomed to his new physique, his gooey antics ripple throughout the world, gradually altering his fate.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy",
      "Fantasy"
    ],
    "themes": [
      "Isekai",
      "Reincarnation"
    ]
  },
  {
    "id": 5081,
    "type": "anime",
    "title": "Bakemonogatari",
    "title_english": "Bakemonogatari",
    "title_japanese": "化物語",
    "image": "https://cdn.myanimelist.net/images/anime/11/75274.jpg",
    "synopsis": "Koyomi Araragi, a third-year high school student, manages to survive a vampire attack with the help of Meme Oshino, a strange man residing in an abandoned building. Though being saved from vampirism and now a human again, several side effects such as superhuman healing abilities and enhanced vision still remain. Regardless, Araragi tries to live the life of a normal student, with the help of his friend and the class president, Tsubasa Hanekawa.\n\nWhen fellow classmate Hitagi Senjougahara falls down the stairs and is caught by Araragi, the boy realizes that the girl is unnaturally weightless. Despite Senjougahara's protests, Araragi insists he help her, deciding to enlist the aid of Oshino, the very man who had once helped him with his own predicament.\n\nThrough several tales involving demons and gods, Bakemonogatari follows Araragi as he attempts to help those who suffer from supernatural maladies.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Mystery",
      "Romance",
      "Supernatural"
    ],
    "themes": [
      "Vampire"
    ]
  },
  {
    "id": 19,
    "type": "anime",
    "title": "Monster",
    "title_english": "Monster",
    "title_japanese": "モンスター",
    "image": "https://cdn.myanimelist.net/images/anime/10/18793.jpg",
    "synopsis": "Dr. Kenzou Tenma, an elite neurosurgeon recently engaged to his hospital director's daughter, is well on his way to ascending the hospital hierarchy. That is until one night, a seemingly small event changes Dr. Tenma's life forever. While preparing to perform surgery on someone, he gets a call from the hospital director telling him to switch patients and instead perform life-saving brain surgery on a famous performer. His fellow doctors, fiancée, and the hospital director applaud his accomplishment; but because of the switch, a poor immigrant worker is dead, causing Dr. Tenma to have a crisis of conscience.\n\nSo when a similar situation arises, Dr. Tenma stands his ground and chooses to perform surgery on the young boy Johan Liebert instead of the town's mayor. Unfortunately, this choice leads to serious ramifications for Dr. Tenma—losing his social standing being one of them. However, with the mysterious death of the director and two other doctors, Dr. Tenma's position is restored. With no evidence to convict him, he is released and goes on to attain the position of hospital director. \n\nNine years later when Dr. Tenma saves the life of a criminal, his past comes back to haunt him—once again, he comes face to face with the monster he operated on. He must now embark on a quest of pursuit to make amends for the havoc spread by the one he saved.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Mystery",
      "Suspense"
    ],
    "themes": [
      "Adult Cast",
      "Psychological"
    ]
  },
  {
    "id": 39535,
    "type": "anime",
    "title": "Mushoku Tensei: Isekai Ittara Honki Dasu",
    "title_english": "Mushoku Tensei: Jobless Reincarnation",
    "title_japanese": "無職転生 ～異世界行ったら本気だす～",
    "image": "https://cdn.myanimelist.net/images/anime/1530/117776.jpg",
    "synopsis": "Despite being bullied, scorned, and oppressed all of his life, a 34-year-old shut-in still found the resolve to attempt something heroic—only for it to end in a tragic accident. But in a twist of fate, he awakens in another world as Rudeus Greyrat, starting life again as a baby born to two loving parents.\n\nPreserving his memories and knowledge from his previous life, Rudeus quickly adapts to his new environment. With the mind of a grown adult, he starts to display magical talent that exceeds all expectations, honing his skill with the help of a mage named Roxy Migurdia. Rudeus learns swordplay from his father, Paul, and meets Sylphiette, a girl his age who quickly becomes his closest friend.\n\nAs Rudeus' second chance at life begins, he tries to make the most of his new opportunity while conquering his traumatic past. And perhaps, one day, he may find the one thing he could not find in his old world—love.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Adventure",
      "Drama",
      "Fantasy",
      "Ecchi"
    ],
    "themes": [
      "Isekai",
      "Reincarnation"
    ]
  },
  {
    "id": 58426,
    "type": "anime",
    "title": "Shikanoko Nokonoko Koshitantan",
    "title_english": "My Deer Friend Nokotan",
    "title_japanese": "しかのこのこのここしたんたん",
    "image": "https://cdn.myanimelist.net/images/anime/1094/143324.jpg",
    "synopsis": "Torako Koshi is the epitome of perfection. With her peerless beauty, top-notch grades, and position as student council president, her popularity in school is unrivaled. However, she harbors a dark secret—she was a delinquent back in middle school—and this is something she conceals to the best of her abilities.\n\nUnfortunately, when she meets the mysterious deer girl Noko Shikanoko, Torako's hidden shame is constantly on the precipice of being exposed due to Shikanoko's rather weird antics. To maintain the reputation she worked so hard for, Torako must go along with Shikanoko's whims, even going so far as to become president of the newly established Deer Club. All her efforts will be rewarded if she can prevent the menacing doe from accidentally blurting out damaging details about her personal history that will undoubtedly unleash Torako's greatest nightmare.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy"
    ],
    "themes": [
      "Gag Humor",
      "School"
    ]
  },
  {
    "id": 48736,
    "type": "anime",
    "title": "Sono Bisque Doll wa Koi wo Suru",
    "title_english": "My Dress-Up Darling",
    "title_japanese": "その着せ替え人形は恋をする",
    "image": "https://cdn.myanimelist.net/images/anime/1179/119897.jpg",
    "synopsis": "High school student Wakana Gojou spends his days perfecting the art of making hina dolls, hoping to eventually reach his grandfather's level of expertise. While his fellow teenagers busy themselves with pop culture, Gojou finds bliss in sewing clothes for his dolls. Nonetheless, he goes to great lengths to keep his unique hobby a secret, as he believes that he would be ridiculed were it revealed. \n\nEnter Marin Kitagawa, an extraordinarily pretty girl whose confidence and poise are in stark contrast to Gojou's meekness. It would defy common sense for the friendless Gojou to mix with the likes of Kitagawa, who is always surrounded by her peers. However, the unimaginable happens when Kitagawa discovers Gojou's prowess with a sewing machine and brightly confesses to him about her own hobby: cosplay. Because her sewing skills are pitiable, she decides to enlist his help.\n\nAs Gojou and Kitagawa work together on one cosplay outfit after another, they cannot help but grow close—even though their lives are worlds apart.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "Otaku Culture",
      "School"
    ]
  },
  {
    "id": 34403,
    "type": "anime",
    "title": "Hajimete no Gal",
    "title_english": "My First Girlfriend is a Gal",
    "title_japanese": "はじめてのギャル",
    "image": "https://cdn.myanimelist.net/images/anime/9/86826.jpg",
    "synopsis": "Following a prank pulled by his perverse friends, Junichi Hashiba asks a gal out in an attempt to change the fact that he's a hopeless virgin. Yukana Yame, the girl in question, is disgusted by Junichi's groveling. However, through a series of teasing remarks, she soon finds herself bonding with him and ultimately accepting Junichi's confession, much to his surprise.\n\nHajimete no Gal follows Junichi as he overcomes his lack of self-confidence and suppresses his sexual urges, all while thrust into a whole new school life full of lively girls and unpredictable mayhem.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance",
      "Ecchi"
    ],
    "themes": [
      "Harem",
      "School"
    ]
  },
  {
    "id": 51552,
    "type": "anime",
    "title": "Watashi no Shiawase na Kekkon",
    "title_english": "My Happy Marriage",
    "title_japanese": "わたしの幸せな結婚",
    "image": "https://cdn.myanimelist.net/images/anime/1147/122444.jpg",
    "synopsis": "Misery seems everlasting in Miyo Saimori's life. Born from an arranged marriage, she was quickly discarded after her mother's tragic death. Her father remarried, and her younger half-sister Kaya received all the affection, while Miyo was degraded to a lowly servant. Lacking the strength to fight against her family's abuse, Miyo loses hope that her luck will ever turn.\n\nUnexpectedly, Miyo's father summons her to deliver surprising news: she is to marry Kiyoka Kudou, the head of the distinguished Kudou family. Despite his noble background, Kiyoka is known to be a callous man who has thus far dismissed all of his former fiancées.\n\nUpon arriving at the Kudou household, Miyo expects coarse treatment and to be tossed aside. However, contrary to her assumptions, Kiyoka shows her the kindness and love that she has desperately needed. Marrying Kiyoka may be Miyo's one chance to break free from her neglectful family and embrace a life of happiness.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Fantasy",
      "Romance"
    ],
    "themes": [
      "Adult Cast",
      "Historical"
    ]
  },
  {
    "id": 31964,
    "type": "anime",
    "title": "Boku no Hero Academia",
    "title_english": "My Hero Academia",
    "title_japanese": "僕のヒーローアカデミア",
    "image": "https://cdn.myanimelist.net/images/anime/10/78745.jpg",
    "synopsis": "The appearance of \"quirks,\" newly discovered super powers, has been steadily increasing over the years, with 80 percent of humanity possessing various abilities from manipulation of elements to shapeshifting. This leaves the remainder of the world completely powerless, and Izuku Midoriya is one such individual.\n\nSince he was a child, the ambitious middle schooler has wanted nothing more than to be a hero. Izuku's unfair fate leaves him admiring heroes and taking notes on them whenever he can. But it seems that his persistence has borne some fruit: Izuku meets the number one hero and his personal idol, All Might. All Might's quirk is a unique ability that can be inherited, and he has chosen Izuku to be his successor!\n\nEnduring many months of grueling training, Izuku enrolls in UA High, a prestigious high school famous for its excellent hero training program, and this year's freshmen look especially promising. With his bizarre but talented classmates and the looming threat of a villainous organization, Izuku will soon learn what it really means to be a hero.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action"
    ],
    "themes": [
      "School",
      "Super Power"
    ]
  },
  {
    "id": 53126,
    "type": "anime",
    "title": "Yamada-kun to Lv999 no Koi wo Suru",
    "title_english": "My Love Story with Yamada-kun at Lv999",
    "title_japanese": "山田くんとLv999の恋をする",
    "image": "https://cdn.myanimelist.net/images/anime/1298/134178.jpg",
    "synopsis": "After her boyfriend breaks up with her for another girl, college student Akane Kinoshita wrestles with a broken heart and the memories he left behind. Loading up Forest of Savior, the MMO they used to play together, she forms a plan to get back at her ex-boyfriend through an in-person event for the game. In the process, she runs into someone unexpected: Akito Yamada, a gaming legend who just happens to be her guildmate.\n\nDesperate for support, Akane ropes the asocial Yamada into helping with her scheme and lending her a shoulder to cry on. The differences between Akane and Yamada soon become apparent as they spend time together, yet they cannot help but notice each other's inner qualities. As the two gain more experience with one another in and out of the game, their tentative acquaintance may level up in a way neither expects.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "Video Game"
    ]
  },
  {
    "id": 49470,
    "type": "anime",
    "title": "Mamahaha no Tsurego ga Motokano datta",
    "title_english": "My Stepmom's Daughter Is My Ex",
    "title_japanese": "継母の連れ子が元カノだった",
    "image": "https://cdn.myanimelist.net/images/anime/1708/123281.jpg",
    "synopsis": "Listless geek Mizuto Irido and introverted nerd Yume Ayai seemed like a match made in heaven, connected by their mutual love for literature. Unfortunately, their differences gradually grew, and they separated just after their middle school graduation. But, as if by divine comedy, the two find themselves reunited as step-siblings.\n\nA rivalry begins to brew between the former couple, both unwilling to acknowledge the other as the older sibling. In an attempt to \"solve\" this issue, Mizuto and Yume agree upon a rule: whoever crosses the boundaries of siblinghood norms loses, and the winner will not only be called the older sibling, but also get to make a request. However, now that they live under the same roof, the lingering memories they share start to influence their actions—possibly rekindling the feelings that may not have been fully extinguished in the first place.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": []
  },
  {
    "id": 58272,
    "type": "anime",
    "title": "Boku no Tsuma wa Kanjou ga Nai",
    "title_english": "My Wife Has No Emotion",
    "title_japanese": "僕の妻は感情がない",
    "image": "https://cdn.myanimelist.net/images/anime/1101/143646.jpg",
    "synopsis": "Takuma Kosugi is an office worker who does not have enough time to take care of everything at home. To make his daily life easier, he purchases a secondhand housekeeping robot named Mina, who quickly proves her worth. One day, after returning from work and having one too many beers, Takuma somewhat jokingly blurts out that she should become his wife! Much to his surprise, Mina takes his words seriously, and the two gradually begin living as if they are married.\n\nAs the days go by, Takuma and Mina grow closer and start doing more activities together, like going on a picnic and spending a day at the beach. However, much of society still considers human-robot relationships unusual. The couple must figure out if their arrangement can succeed and how to convince the people around them of their sincerity.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance",
      "Sci-Fi"
    ],
    "themes": []
  },
  {
    "id": 18897,
    "type": "anime",
    "title": "Nisekoi",
    "title_english": "Nisekoi: False Love",
    "title_japanese": "ニセコイ",
    "image": "https://cdn.myanimelist.net/images/anime/13/75587.jpg",
    "synopsis": "Raku Ichijou, a first-year student at Bonyari High School, is the sole heir to an intimidating yakuza family. Ten years ago, Raku made a promise to his childhood friend. Now, all he has to go on is a pendant with a lock, which can only be unlocked with the key which the girl took with her when they parted.\n\nNow, years later, Raku has grown into a typical teenager, and all he wants is to remain as uninvolved in his yakuza background as possible while spending his school days alongside his middle school crush Kosaki Onodera. However, when the American Bee Hive Gang invades his family's turf, Raku's idyllic romantic dreams are sent for a toss as he is dragged into a frustrating conflict: Raku is to pretend that he is in a romantic relationship with Chitoge Kirisaki, the beautiful daughter of the Bee Hive's chief, so as to reduce the friction between the two groups. Unfortunately, reality could not be farther from this whopping lie—Raku and Chitoge fall in hate at first sight, as the girl is convinced he is a pathetic pushover, and in Raku's eyes, Chitoge is about as attractive as a savage gorilla. \n\nNisekoi follows the daily antics of this mismatched couple who have been forced to get along for the sake of maintaining the city's peace. With many more girls popping up his life, all involved with Raku's past somehow, his search for the girl who holds his heart and his promise leads him in more unexpected directions than he expects.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Harem",
      "School"
    ]
  },
  {
    "id": 52608,
    "type": "anime",
    "title": "Tensei Kizoku no Isekai Boukenroku: Jichou wo Shiranai Kamigami no Shito",
    "title_english": "The Aristocrat's Otherworldly Adventure: Serving Gods Who Go Too Far",
    "title_japanese": "転生貴族の異世界冒険録～自重を知らない神々の使徒～",
    "image": "https://cdn.myanimelist.net/images/anime/1071/135255.jpg",
    "synopsis": "On his way to a convenience store, Kazuya Shiina tries to defend two young girls from an armed assailant, only to end up getting stabbed himself and dying on the spot. This good deed allows him to be reborn with all his memories in another world as Cain von Silford, the third son of a margrave.\n\nWhen Cain turns five, a baptismal ceremony in the church grants him an audience to the seven gods who preside over the world. Not only do the gods fill him in on the circumstances of his reincarnation, but they also give Cain their respective divine protections—allowing him to use cheat-like abilities in swordsmanship, magic, and many other aspects.\n\nWith these blessings, Cain sets out to live a fulfilling life that he deems a dream come true. However, it soon becomes clear that the gods have more plans for him than just a haphazard bestowal of overwhelming power.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Fantasy",
      "Romance"
    ],
    "themes": [
      "Harem",
      "Isekai",
      "Reincarnation"
    ]
  },
  {
    "id": 19815,
    "type": "anime",
    "title": "No Game No Life",
    "title_english": "No Game, No Life",
    "title_japanese": "ノーゲーム・ノーライフ",
    "image": "https://cdn.myanimelist.net/images/anime/1074/111944.jpg",
    "synopsis": "Sixteen sentient races inhabit Disboard, a world overseen by Tet, the One True God. The lowest of the sixteen—Imanity—consists of humans, a race with no affinity for magic. In a place where everything is decided through simple games, humankind seems to have no way out of their predicament—but the arrival of two outsiders poses a change.\n\nOn Earth, stepsiblings Sora and Shiro are two inseparable shut-ins who dominate various online games under the username \"Blank.\" While notorious on the internet, the pair believe that life is merely another dull game. However, after responding to a message from an unknown user, they are suddenly transported to Disboard. The mysterious sender turns out to be Tet, who informs them about the world's absolute rules. After Tet leaves, Sora and Shiro begin their search for more information and a place to stay, taking them to Elkia—Imanity's only remaining kingdom.\n\nThere, the duo encounters Stephanie Dola, an emotional girl vying for the kingdom's sovereignty. In desperation, she attempts to regain her father's throne, but her foolhardiness makes her goal unachievable. Inspired by the girl's motivation and passion, Sora and Shiro decide to aid Stephanie in getting Elkia back on its feet, ultimately aiming to become the new rulers of the enigmatic realm.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Fantasy",
      "Ecchi"
    ],
    "themes": [
      "Isekai",
      "Strategy Game"
    ]
  },
  {
    "id": 21,
    "type": "anime",
    "title": "One Piece",
    "title_english": "One Piece",
    "title_japanese": "ONE PIECE",
    "image": "https://cdn.myanimelist.net/images/anime/1244/138851.jpg",
    "synopsis": "Barely surviving in a barrel after passing through a terrible whirlpool at sea, carefree Monkey D. Luffy ends up aboard a ship under attack by fearsome pirates. Despite being a naive-looking teenager, he is not to be underestimated. Unmatched in battle, Luffy is a pirate himself who resolutely pursues the coveted One Piece treasure and the King of the Pirates title that comes with it.\n\nThe late King of the Pirates, Gol D. Roger, stirred up the world before his death by disclosing the whereabouts of his hoard of riches and daring everyone to obtain it. Ever since then, countless powerful pirates have sailed dangerous seas for the prized One Piece only to never return. Although Luffy lacks a crew and a proper ship, he is endowed with a superhuman ability and an unbreakable spirit that make him not only a formidable adversary but also an inspiration to many.\n\nAs he faces numerous challenges with a big smile on his face, Luffy gathers one-of-a-kind companions to join him in his ambitious endeavor, together embracing perils and wonders on their once-in-a-lifetime adventure.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": []
  },
  {
    "id": 30276,
    "type": "anime",
    "title": "One Punch Man",
    "title_english": "One-Punch Man",
    "title_japanese": "ワンパンマン",
    "image": "https://cdn.myanimelist.net/images/anime/12/76049.jpg",
    "synopsis": "The seemingly unimpressive Saitama has a rather unique hobby: being a hero. In order to pursue his childhood dream, Saitama relentlessly trained for three years, losing all of his hair in the process. Now, Saitama is so powerful, he can defeat any enemy with just one punch. However, having no one capable of matching his strength has led Saitama to an unexpected problem—he is no longer able to enjoy the thrill of battling and has become quite bored.\n\nOne day, Saitama catches the attention of 19-year-old cyborg Genos, who witnesses his power and wishes to become Saitama's disciple. Genos proposes that the two join the Hero Association in order to become certified heroes that will be recognized for their positive contributions to society. Saitama, who is shocked that no one knows who he is, quickly agrees. Meeting new allies and taking on new foes, Saitama embarks on a new journey as a member of the Hero Association to experience the excitement of battle he once felt.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy"
    ],
    "themes": [
      "Adult Cast",
      "Parody",
      "Super Power"
    ]
  },
  {
    "id": 32729,
    "type": "anime",
    "title": "Orange",
    "title_english": "Orange",
    "title_japanese": "orange（オレンジ）",
    "image": "https://cdn.myanimelist.net/images/anime/1415/102477.jpg",
    "synopsis": "Naho Takamiya's first day of her sophomore year of high school is off to an uneasy start. After waking up late, she receives a strange letter addressed to her. However, the letter is from herself—10 years in the future! At first, Naho is skeptical of the note; yet, after witnessing several events described to take place, she realizes the letter really is from her 26-year-old self.\n\nThe note details that Naho's future life is filled with regrets, and she hopes that her younger self can correct the mistakes that were made in the past. The letter also warns her to keep a close eye on the new transfer student, Kakeru Naruse. Naho must be especially careful in making decisions involving him, as Kakeru is not around in the future. With the letter as her guide, Naho now has the power to protect Kakeru before she comes to regret it once more.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance",
      "Sci-Fi"
    ],
    "themes": [
      "Love Polygon",
      "School",
      "Time Travel"
    ]
  },
  {
    "id": 14813,
    "type": "anime",
    "title": "Yahari Ore no Seishun Love Comedy wa Machigatteiru.",
    "title_english": "My Teen Romantic Comedy SNAFU",
    "title_japanese": "やはり俺の青春ラブコメはまちがっている。",
    "image": "https://cdn.myanimelist.net/images/anime/1786/120117.jpg",
    "synopsis": "Hachiman Hikigaya is an apathetic high school student with narcissistic and semi-nihilistic tendencies. He firmly believes that joyful youth is nothing but a farce, and everyone who says otherwise is just lying to themselves. \n\nIn a novel punishment for writing an essay mocking modern social relationships, Hachiman's teacher forces him to join the Volunteer Service Club, a club that aims to extend a helping hand to any student who seeks their support in achieving their goals. With the only other club member being the beautiful ice queen Yukino Yukinoshita, Hachiman finds himself on the front line of other people's problems—a place he never dreamed he would be. As Hachiman and Yukino use their wits to solve many students' problems, will Hachiman's rotten view of society prove to be a hindrance or a tool he can use to his advantage?\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Love Polygon",
      "School"
    ]
  },
  {
    "id": 52034,
    "type": "anime",
    "title": "[Oshi no Ko]",
    "title_english": "[Oshi No Ko]",
    "title_japanese": "【推しの子】",
    "image": "https://cdn.myanimelist.net/images/anime/1812/134736.jpg",
    "synopsis": "In the entertainment world, celebrities often show exaggerated versions of themselves to the public, concealing their true thoughts and struggles beneath elaborate lies. Fans buy into these fabrications, showering their idols with undying love and support, until something breaks the illusion. Sixteen-year-old rising star Ai Hoshino of pop idol group B Komachi has the world captivated; however, when she announces a hiatus due to health concerns, the news causes many to become worried.\n\nAs a huge fan of Ai, gynecologist Gorou Amemiya cheers her on from his countryside medical practice, wishing he could meet her in person one day. His wish comes true when Ai shows up at his hospital—not sick, but pregnant with twins! While the doctor promises Ai to safely deliver her children, he wonders if this encounter with the idol will forever change the nature of his relationship with her.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Award Winning",
      "Drama"
    ],
    "themes": [
      "Reincarnation",
      "Showbiz"
    ]
  },
  {
    "id": 52990,
    "type": "anime",
    "title": "Keikenzumi na Kimi to, Keiken Zero na Ore ga, Otsukiai suru Hanashi.",
    "title_english": "Our Dating Story: The Experienced You and The Inexperienced Me",
    "title_japanese": "経験済みなキミと、 経験ゼロなオレが、 お付き合いする話。",
    "image": "https://cdn.myanimelist.net/images/anime/1848/140019.jpg",
    "synopsis": "To the shy and reclusive Ryuuto Kashima, associating himself with his popular classmate Runa Shirakawa is nothing but a distant fantasy—or so he thought. After losing a bet with his friends and being coerced into confessing to Runa, Ryuuto's world is flipped upside down: instead of the cruel rejection he was expecting, Runa agrees to go out with him!\n\nBut dating Runa proves to be overwhelming for Ryuuto, who requests that their relationship remain a secret known only by their closest friends. His decision, however, leads to a series of mishaps that he fears will doom the relationship. As they work through their misunderstandings, Ryuuto reveals his insecurities stemming from his past experiences, and the two grow closer together.\n\nJust when things are getting back on track, Ryuuto's middle school crush, Maria Kurose, transfers to his class and begins to stir up a fuss. At the same time, terrible rumors about Runa spread around the school, prompting Ryuuto to take desperate measures to protect her.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 22535,
    "type": "anime",
    "title": "Kiseijuu: Sei no Kakuritsu",
    "title_english": "Parasyte: The Maxim",
    "title_japanese": "寄生獣 セイの格率",
    "image": "https://cdn.myanimelist.net/images/anime/3/73178.jpg",
    "synopsis": "All of a sudden, they arrived: parasitic aliens that descended upon Earth and quickly infiltrated humanity by burrowing into the brains of vulnerable targets. These insatiable beings acquire full control of their host and are able to morph into a variety of forms in order to feed on unsuspecting prey.\n \nSixteen-year-old high school student Shinichi Izumi falls victim to one of these parasites, but it fails to take over his brain, ending up in his right hand instead. Unable to relocate, the parasite, now named Migi, has no choice but to rely on Shinichi in order to stay alive. Thus, the pair is forced into an uneasy coexistence and must defend themselves from hostile parasites that hope to eradicate this new threat to their species.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Horror",
      "Sci-Fi",
      "Suspense"
    ],
    "themes": [
      "Gore",
      "Psychological"
    ]
  },
  {
    "id": 171476,
    "type": "manga",
    "title": "Tears on a Withered Flower",
    "title_english": "Tears on a Withered Flower",
    "title_japanese": "시든 꽃에 눈물을",
    "image": "https://cdn.myanimelist.net/images/manga/2/325937.jpg",
    "synopsis": "Na Haesu's life unravels when her husband betrays her with an affair, leaving her burdened with debt and losing their child. In a devastating blow, she witnesses him with a younger woman. Broken and despondent, Na Haesu feels her life crumbling around her. However, a mysterious young man unexpectedly enters her life, asking to be taught about adult love. His vulnerability and sincerity begin to stir emotions within Na Haesu, challenging her to reconsider her path forward.\n\n(Source: Naver, translated)",
    "genres": [
      "Drama",
      "Erotica"
    ],
    "themes": [
      "Psychological"
    ]
  },
  {
    "id": 58822,
    "type": "anime",
    "title": "Izure Saikyou no Renkinjutsushi?",
    "title_english": "Possibly the Greatest Alchemist of All Time",
    "title_japanese": "いずれ最強の錬金術師?",
    "image": "https://cdn.myanimelist.net/images/anime/1431/146222.jpg",
    "synopsis": "A salaryman is surprised to find himself summoned to another world by accident. With no way of returning to Earth, he receives the name Takumi Iruma, a different younger body, magic powers, and a fresh start in an unfamiliar land. To preserve his quiet life, Takumi settles in a local village and assumes the job of an alchemist, allowing him to create almost anything he desires. Making the most of his time, he explores his new abilities and even tames an unlikely pet.\n\nHowever, Takumi decides to move on to a big city in hopes of improving his alchemy skills and business. As he keeps learning about his profession and gaining new connections, Takumi might just be able to become the greatest alchemist of all time.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Adventure",
      "Fantasy"
    ],
    "themes": [
      "Isekai"
    ]
  },
  {
    "id": 54968,
    "type": "anime",
    "title": "Giji Harem",
    "title_english": "Pseudo Harem",
    "title_japanese": "疑似ハーレム",
    "image": "https://cdn.myanimelist.net/images/anime/1607/143547.jpg",
    "synopsis": "Eiji Kitahama has a dream shared by many high school guys: to be popular and have a harem of girls fawning over him. Luckily for him, his new junior in the drama club, Rin Nanakura, has decided to help him realize this wish. Using her impressive acting abilities, she takes on many personalities, from teasing to calm and collected, to play characters in Eiji's simulated harem.\n\nAs her connection with Eiji deepens, Rin expands her repertoire, quickly swapping between characters while enjoying high school life together in the club. Through her acting, the real Rin Nanakura tries her best to win Eiji's heart.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Love Status Quo",
      "School"
    ]
  },
  {
    "id": 53516,
    "type": "anime",
    "title": "Tensei shitara Dainana Ouji Datta node, Kimama ni Majutsu wo Kiwamemasu",
    "title_english": "I Was Reincarnated as the 7th Prince so I Can Take My Time Perfecting My Magical Ability",
    "title_japanese": "転生したら第七王子だったので、気ままに魔術を極めます",
    "image": "https://cdn.myanimelist.net/images/anime/1580/141243.jpg",
    "synopsis": "In his past life, Prince Lloyd de Saloum was a commoner who could not become adept at magic, no matter how knowledgeable or obsessed he was about it. Now reincarnated into his current royal lineage, he receives a body with seemingly endless mana, making his desire to master all things arcane attainable. Moreover, as the seventh prince of the kingdom, Lloyd has no claim to the throne, allowing him to nurture his abilities as freely as he wants.\n\nUnfortunately for Lloyd, ancient seals that imprison powerful demons begin to break down and release the horrors within, endangering the peace. With these monstrosities roaming around, Lloyd's overwhelming magical prowess is the ultimate weapon that can neutralize these threats before all things descend to chaos.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Adventure",
      "Fantasy"
    ],
    "themes": [
      "Reincarnation"
    ]
  },
  {
    "id": 56690,
    "type": "anime",
    "title": "Re:Monster",
    "title_english": "Re:Monster",
    "title_japanese": "Re:Monster",
    "image": "https://cdn.myanimelist.net/images/anime/1523/141680.jpg",
    "synopsis": "Tomokui Kanata has been re-incarnated in the weakest goblin, named Goburou, after having undergone an unfortunate death. However Goburou has retained his previous life's memories, an unusual evolution, as well as becoming strong enough to gain status boosts from eating.\n\nIn this alternate world of survival of the fittest, events unfold with competent subordinates and comrades, delightful case of the tail-wagging dog...",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": [
      "Isekai",
      "Reincarnation"
    ]
  },
  {
    "id": 40839,
    "type": "anime",
    "title": "Kanojo, Okarishimasu",
    "title_english": "Rent-a-Girlfriend",
    "title_japanese": "彼女、お借りします",
    "image": "https://cdn.myanimelist.net/images/anime/1902/128382.jpg",
    "synopsis": "Kazuya Kinoshita is a 20-year-old college student who has a wonderful girlfriend: the bright and sunny Mami Nanami. But suddenly, he does not. Without warning, Mami breaks up with him, leaving him utterly heartbroken and lonely. Seeking to soothe the pain, he hires a rental girlfriend through an online app. His partner is Chizuru Mizuhara, who through her unparalleled beauty and cute demeanor, manages to gain Kazuya's affection.\n\nBut after reading similar experiences other customers had had with Chizuru, Kazuya believes her warm smile and caring personality were all just an act to toy with his heart, and he rates her poorly. Aggravated, Chizuru lambastes him for his shameless hypocrisy, revealing her true pert and hot-tempered self. This one-sided exchange is cut short, however, when Kazuya finds out that his grandmother has collapsed.\n\nThey dash toward the hospital and find Kazuya's grandmother already in good condition. Baffled by Chizuru's presence, she asks who this girl might be. On impulse, Kazuya promptly declares that they are lovers, forcing Chizuru to play the part. But with Kazuya still hung up on his previous relationship with Mami, how long can this difficult client and reluctant rental girlfriend keep up their act?\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Adult Cast",
      "Harem"
    ]
  },
  {
    "id": 31240,
    "type": "anime",
    "title": "Re:Zero kara Hajimeru Isekai Seikatsu",
    "title_english": "Re:ZERO -Starting Life in Another World-",
    "title_japanese": "Re:ゼロから始める異世界生活",
    "image": "https://cdn.myanimelist.net/images/anime/1522/128039.jpg",
    "synopsis": "When Subaru Natsuki leaves the convenience store, the last thing he expects is to be wrenched from his everyday life and dropped into a fantasy world. Things are not looking good for the bewildered teenager; however, not long after his arrival, he is attacked by some thugs. Armed with only a bag of groceries and a now useless cell phone, he is quickly beaten to a pulp. Fortunately, a mysterious beauty named Satella, in hot pursuit after the one who stole her insignia, happens upon Subaru and saves him. In order to thank the honest and kindhearted girl, Subaru offers to help in her search, and later that night, he even finds the whereabouts of that which she seeks. But unbeknownst to them, a much darker force stalks the pair from the shadows, and just minutes after locating the insignia, Subaru and Satella are brutally murdered.\n\nHowever, Subaru immediately reawakens to a familiar scene—confronted by the same group of thugs, meeting Satella all over again—the enigma deepens as history inexplicably repeats itself.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Fantasy",
      "Suspense"
    ],
    "themes": [
      "Isekai",
      "Psychological",
      "Time Travel"
    ]
  },
  {
    "id": 53879,
    "type": "anime",
    "title": "Kamonohashi Ron no Kindan Suiri",
    "title_english": "Ron Kamonohashi's Forbidden Deductions",
    "title_japanese": "鴨乃橋ロンの禁断推理",
    "image": "https://cdn.myanimelist.net/images/anime/1799/137123.jpg",
    "synopsis": "Ron Kamonohashi, the best student in the history of the elite Detective Training Academy BLUE, has been living as a recluse since BLUE expelled him five years ago. Moreover, he is forbidden to work as a detective, having barely escaped execution after getting involved in a murder case while he was still attending the school. Ron's situation changes drastically when police detective Totomaru Isshiki, following the advice of a senior colleague, seeks him out for help with a criminal case that has remained unsolved for months. Ron reluctantly agrees to help Totomaru and uses his phenomenal intuition to discover the culprit in less than a day. However, it appears that Ron suffers from a mysterious condition that can cause those around him to lose their lives. To Ron's great surprise, Totomaru manages to save the life of someone whom Ron put in jeopardy.\n\nAs the unlikely duo starts solving crimes one after another, BLUE sends operatives after its former student to find out if he has resumed investigative work. Fighting against murderers, rogue detectives, and the Metropolitan Police Department, Ron and Totomaru must join forces if they want to survive and see justice prevail.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Mystery"
    ],
    "themes": [
      "Adult Cast",
      "Detective"
    ]
  },
  {
    "id": 54744,
    "type": "anime",
    "title": "Tokidoki Bosotto Russia-go de Dereru Tonari no Alya-san",
    "title_english": "Alya Sometimes Hides Her Feelings in Russian",
    "title_japanese": "時々ボソッとロシア語でデレる隣のアーリャさん",
    "image": "https://cdn.myanimelist.net/images/anime/1825/142258.jpg",
    "synopsis": "Seirei Academy is a prestigious school attended by the very best students in Japan. Alisa Mikhailovna \"Alya\" Kujou, the half-Russian and half-Japanese treasurer of the school's student council, is known for her intelligence, stunning looks, and rigid personality. Contrasting her near-flawless persona, Alya's unmotivated classmate Masachika Kuze slacks off during lessons and seems to show no interest in her.\n\nInitially irritated, Alya gradually becomes more intrigued by Masachika and starts expressing her affection for him in Russian. However, she is oblivious to his secret—he understands the language fluently! Due to a childhood friend who was temporarily staying in Japan, Masachika has been studying Russian in hopes of reuniting with her.\n\nAs the two spend more time together, the playful and eccentric relationship between them quickly deepens. In the meantime, both must learn to navigate their new growing feelings for one another.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 37965,
    "type": "anime",
    "title": "Kaze ga Tsuyoku Fuiteiru",
    "title_english": "Run with the Wind",
    "title_japanese": "風が強く吹いている",
    "image": "https://cdn.myanimelist.net/images/anime/1936/129119.jpg",
    "synopsis": "Former ace runner of Sendai Josei High School, Kakeru Kurahara is chased away from a convenience store for shoplifting. Shaking off his pursuer, he runs into Haiji Kiyose, another student from his university. Haiji is impressed by Kakeru's agility and persuades him to live in Chikusei-sou, the run-down apartment where Haiji resides along with eight other students. Having lost his entire apartment deposit at a mahjong parlor, Kakeru accepts the offer reluctantly.\n\nHowever, Haiji reveals a secret during Kakeru's welcoming party: the apartment is actually the dormitory of the Kansei University Track Club. He unveils his ultimate goal of participating in the Hakone Ekiden—one of the most prominent university marathon relay races in Japan. Unfortunately, all the residents apart from Haiji and Kakeru are complete running novices. Worse still, none of the inhabitants are even remotely interested in being involved with Haiji's ridiculous plan! With only months before the deadline, will the fourth-year student be able to convince them otherwise and realize his elusive dream of running in the Hakone Ekiden?\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Sports"
    ],
    "themes": [
      "Adult Cast",
      "Racing"
    ]
  },
  {
    "id": 59791,
    "type": "anime",
    "title": "Ruri no Houseki",
    "title_english": "Ruri Rocks",
    "title_japanese": "瑠璃の宝石",
    "image": "https://cdn.myanimelist.net/images/anime/1431/148742.jpg",
    "synopsis": "While shopping, high school student Ruri Tanigawa is captivated by a crystal necklace. Due to its high price, she can only dream of owning one—until her mother tells her about a mountainous area where Ruri's grandfather used to discover numerous minerals. As she makes her way to the location in the hope of finding materials to make her own accessories, Ruri meets Nagi Arato, a graduate student, who gladly shows her the way.\n\nSoon, Ruri is left smitten when they arrive at an enormous quartz formation. More motivated than ever, she convinces Nagi to teach her more about mineralogy. With each new discovery and Nagi's lessons deepening her love, Ruri learns that there is more to minerals than just their price.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Slice of Life"
    ],
    "themes": [
      "CGDCT",
      "Educational"
    ]
  },
  {
    "id": 39026,
    "type": "anime",
    "title": "Dumbbell Nan Kilo Moteru?",
    "title_english": "How Heavy Are the Dumbbells You Lift?",
    "title_japanese": "ダンベル何キロ持てる？",
    "image": "https://cdn.myanimelist.net/images/anime/1385/101060.jpg",
    "synopsis": "During a regular after-school grub crawl, gluttonous high schooler Hibiki Sakura is confronted about her ever-expanding waistline by her best friend, Ayaka Uehara. With her attempts at solitary exercise failing miserably, Hibiki decides to join the newly opened Silverman Gym. At her orientation, Hibiki runs into student council president and school idol Akemi Souryuuin.\n\nHowever, it soon turns out that Hibiki is in for a lot more than she bargained for. Not only is Silverman Gym full of world-renowned bodybuilders and athletes, but to make matters worse, Akemi turns out to be a total muscle fetishist! Grossed out by the scene unfolding before her eyes, Hibiki begins to leave, only to be stopped by trainer Naruzou Machio. Completely enthralled with her newfound Prince Charming, Hibiki signs up as a gym member. Now, as a result of her spur-of-the-moment decision, Hibiki must adapt to her new lifestyle.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Ecchi"
    ],
    "themes": [
      "CGDCT"
    ]
  },
  {
    "id": 530,
    "type": "anime",
    "title": "Bishoujo Senshi Sailor Moon",
    "title_english": "Sailor Moon",
    "title_japanese": "美少女戦士セーラームーン",
    "image": "https://cdn.myanimelist.net/images/anime/1440/92258.jpg",
    "synopsis": "Usagi Tsukino is an average student and crybaby klutz who constantly scores low on her tests. Unexpectedly, her humdrum life is turned upside down when she saves a cat with a crescent moon on its head from danger. The cat, named Luna, later reveals that their meeting was not an accident: Usagi is destined to become Sailor Moon, a planetary guardian with the power to protect the Earth. Given a special brooch that allows her to transform, she must use her new powers to save the city from evil energy-stealing monsters sent by the malevolent Queen Beryl of the Dark Kingdom.\n\nBut getting accustomed to her powers and fighting villains are not the only things she has to worry about. She must find the lost princess of the Moon Kingdom, the other Sailor Guardians, and the Legendary Silver Crystal in order to save the planet from destruction.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "Mahou Shoujo"
    ]
  },
  {
    "id": 52082,
    "type": "anime",
    "title": "Shiro Seijo to Kuro Bokushi",
    "title_english": "Saint Cecilia and Pastor Lawrence",
    "title_japanese": "白聖女と黒牧師",
    "image": "https://cdn.myanimelist.net/images/anime/1329/135096.jpg",
    "synopsis": "In a small church atop a hill, Pastor Lawrence looks after Saint Cecilia. Her presence is a beacon of hope for the villagers, as her mysterious powers protect them from the weakness of their minds and outside evils. While she appears dignified in front of the villagers, Cecilia allows her lazy side to show when alone with the pastor. Although Cecilia is the guardian of the people, Lawrence is determined to shield her from harm.\n\nUnbeknownst to Lawrence, Cecilia harbors a huge crush on him. She accompanies him on his shopping trips and provides him with divine protection every day. Despite Lawrence remaining oblivious to her true feelings, Cecilia continues to shower him with obvious displays of affection as the bond between them grows.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Fantasy",
      "Romance"
    ],
    "themes": [
      "Love Status Quo"
    ]
  },
  {
    "id": 58939,
    "type": "anime",
    "title": "Sakamoto Days",
    "title_english": "Sakamoto Days",
    "title_japanese": "SAKAMOTO DAYS",
    "image": "https://cdn.myanimelist.net/images/anime/1026/146459.jpg",
    "synopsis": "The name Tarou Sakamoto once instilled fear in every villain. No other professional hitman matched his prowess, and fellow assassins revered him. However, Sakamoto fell in love. In five short years, he married, became a father, put on some weight, and traded his weapons for an apron as he became the owner of a humble convenience store.\n\nAlthough Sakamoto is decidedly retired, he finds his old life of crime hard to shake off. His former partner, Shin Asakura, reappears and resolves to stay with Sakamoto's family under their strict no-kill rule. To make matters worse, a large bounty is placed on Sakamoto's head. Numerous assassins now pursue him—but they are in for a surprise. Sakamoto has not lost his edge, and no matter what tricks his enemies pull, he will fight off every last one to protect his dear family.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy"
    ],
    "themes": [
      "Adult Cast",
      "Organized Crime"
    ]
  },
  {
    "id": 32542,
    "type": "anime",
    "title": "Sakamoto desu ga?",
    "title_english": "Haven't You Heard? I'm Sakamoto",
    "title_japanese": "坂本ですが？",
    "image": "https://cdn.myanimelist.net/images/anime/4/79468.jpg",
    "synopsis": "Sophisticated, suave, sublime; all words which describe the exceedingly handsome and patently perfect Sakamoto. Though it is only his first day in high school, his attractiveness, intelligence, and charm already has the girls swooning and the guys fuming with jealousy. No one seems able to derail him, as all attempts at tripping him up are quickly foiled. His sangfroid is indomitable, his wits peerless. Will any of Sakamoto's classmates, or even teachers, be able to reach his level of excellence? Probably not, but they just might learn a thing or two trying...\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy"
    ],
    "themes": [
      "Gag Humor",
      "School"
    ]
  },
  {
    "id": 38992,
    "type": "anime",
    "title": "Rikei ga Koi ni Ochita no de Shoumei shitemita.",
    "title_english": "Science Fell in Love, So I Tried to Prove It",
    "title_japanese": "理系が恋に落ちたので証明してみた。",
    "image": "https://cdn.myanimelist.net/images/anime/1432/103533.jpg",
    "synopsis": "It is widely believed that science can provide rational explanations for the countless phenomena of our universe. However, there are many aspects of our existence that science has not yet found a solution to and cannot decipher with numbers. The most notorious of these is the concept of love. While it may seem impossible to apply scientific theory to such an intricate and complex emotion, a daring pair of quick-witted Saitama University scientists aim to take on the challenge.\n\nOne day the bold and beautiful Ayame Himuro outwardly declares that she is in love with Shinya Yukimura, her fellow logical and level-headed scientist. Acknowledging his own lack of experience with romance, Yukimura questions what factors constitute love in the first place and whether he is in love with Himuro or not. Both clueless in the dealings of love, the pair begin to conduct detailed experiments on one another to test the human characteristics that indicate love and discern whether they demonstrate these traits toward each other.\n\nAs Himuro and Yukimura begin their intimate analysis, can the two scientists successfully apply scientific theory, with the help of their friends, to quantify the feelings they express for one another?\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Adult Cast"
    ]
  },
  {
    "id": 54855,
    "type": "anime",
    "title": "Senpai wa Otokonoko",
    "title_english": "Senpai is an Otokonoko",
    "title_japanese": "先輩はおとこのこ",
    "image": "https://cdn.myanimelist.net/images/anime/1049/144505.jpg",
    "synopsis": "Much like the other students at her school, first-year student Saki Aoi finds herself captivated by the beauty of her senior on the school board, Makoto Hanaoka. While she worries that Hanaoka would be uncomfortable receiving a confession from another girl, Aoi musters up the courage to tell her anyway. However, Hanaoka's response surprises Aoi for a completely different reason—Hanaoka is actually a cross-dressing boy!\n\nFully expecting Aoi to be abhorred by this revelation, Hanaoka is shocked to find that she has no issues with it. Though Hanaoka rejects Aoi's request to go out with her—citing his identity and the fact that he has never fallen in love before—Aoi insists that she will become his first love. Taken aback by Aoi's determination, Hanaoka wonders if he can really fall in love with her if he cannot find it in him to truly love himself first.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "Crossdressing",
      "Love Polygon",
      "School"
    ]
  },
  {
    "id": 26243,
    "type": "anime",
    "title": "Owari no Seraph",
    "title_english": "Seraph of the End: Vampire Reign",
    "title_japanese": "終わりのセラフ",
    "image": "https://cdn.myanimelist.net/images/anime/1879/148979.jpg",
    "synopsis": "With the appearance of a mysterious virus that kills everyone above the age of 13, mankind becomes enslaved by previously hidden, power-hungry vampires who emerge in order to subjugate society with the promise of protecting the survivors, in exchange for donations of their blood.\n\nAmong these survivors are Yuuichirou and Mikaela Hyakuya, two young boys who are taken captive from an orphanage, along with other children whom they consider family. Discontent with being treated like livestock under the vampires' cruel reign, Mikaela hatches a rebellious escape plan that is ultimately doomed to fail. The only survivor to come out on the other side is Yuuichirou, who is found by the Moon Demon Company, a military unit dedicated to exterminating the vampires in Japan.\n\nMany years later, now a member of the Japanese Imperial Demon Army, Yuuichirou is determined to take revenge on the creatures that slaughtered his family, but at what cost?\n\nOwari no Seraph is a post-apocalyptic supernatural shounen anime that follows a young man's search for retribution, all the while battling for friendship and loyalty against seemingly impossible odds.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Drama",
      "Fantasy"
    ],
    "themes": [
      "Military",
      "Vampire"
    ]
  },
  {
    "id": 23755,
    "type": "anime",
    "title": "Nanatsu no Taizai",
    "title_english": "The Seven Deadly Sins",
    "title_japanese": "七つの大罪",
    "image": "https://cdn.myanimelist.net/images/anime/8/65409.jpg",
    "synopsis": "In a world similar to the European Middle Ages, the feared yet revered Holy Knights of Britannia use immensely powerful magic to protect the region of Britannia and its kingdoms. However, a small subset of the Knights supposedly betrayed their homeland and turned their blades against their comrades in an attempt to overthrow the ruler of Liones. They were defeated by the Holy Knights, but rumors continued to persist that these legendary knights, called the \"Seven Deadly Sins,\" were still alive. Ten years later, the Holy Knights themselves staged a coup d’état, and thus became the new, tyrannical rulers of the Kingdom of Liones.\n\nBased on the best-selling manga series of the same name, Nanatsu no Taizai follows the adventures of Elizabeth, the third princess of the Kingdom of Liones, and her search for the Seven Deadly Sins. With their help, she endeavors to not only take back her kingdom from the Holy Knights, but to also seek justice in an unjust world.\n \n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": []
  },
  {
    "id": 56352,
    "type": "anime",
    "title": "Loop 7-kaime no Akuyaku Reijou wa, Moto Tekikoku de Jiyuu Kimama na Hanayome Seikatsu wo Mankitsu suru",
    "title_english": "7th Time Loop: The Villainess Enjoys a Carefree Life Married to Her Worst Enemy!",
    "title_japanese": "ループ7回目の悪役令嬢は、元敵国で自由気ままな花嫁生活を満喫する",
    "image": "https://cdn.myanimelist.net/images/anime/1533/140617.jpg",
    "synopsis": "Rishe Irmgard Weitzner finds herself in a familiar situation: her fiancé is publicly breaking off their engagement, and her ducal family is about to disown her in shame. However, Rishe is not distraught; she has already had six chances to rebuild her life and chase a different passion each time. But she would always get swept up in a war and die, so now she wishes for her seventh reincarnation to be easygoing and uneventful.\n\nWhat Rishe does not take into account is the presence of Arnold Hein, the crown prince of the Galkhein Kingdom. He is destined to usurp the throne and become a tyrant who starts a large-scale invasion of neighboring countries. To make their encounter worse, Arnold is the one who killed Rishe in her previous life. That is why it is all the more shocking when he proposes to Rishe on the spot. In pursuit of her desired life, Rishe must consider accepting Arnold's proposal and discover the reasons behind his brutal actions to stop the war from ever happening.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "Time Travel",
      "Villainess"
    ]
  },
  {
    "id": 45613,
    "type": "anime",
    "title": "Kawaii dake ja Nai Shikimori-san",
    "title_english": "Shikimori's Not Just a Cutie",
    "title_japanese": "可愛いだけじゃない式守さん",
    "image": "https://cdn.myanimelist.net/images/anime/1995/121695.jpg",
    "synopsis": "Yuu Izumi leads a high school life filled with one mishap after another. No matter how improbable the situation, unfortunate events strike him at every turn. In possession of such terrible luck, Izumi enters his second year with a single wish in mind—to spend more time with his affectionate girlfriend, Micchon Shikimori.\n\nCute, athletic, and caring, Shikimori is immensely popular at their school. But since they began dating a year ago, Izumi has witnessed a surprising side to his otherwise adorable girlfriend: when the need arises, she turns incredibly cool! His misfortunes are easily avoided when she is there to protect him with an awe-inspiring look on her face. Charming in every way, she never ceases to make his heart skip a beat. Unfortunate as he may be, Izumi is sure to see his days of bad luck end thanks to the cute yet cool Shikimori.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 37984,
    "type": "anime",
    "title": "Kumo desu ga, Nani ka?",
    "title_english": "So I'm a Spider, So What?",
    "title_japanese": "蜘蛛ですが、なにか？",
    "image": "https://cdn.myanimelist.net/images/anime/1593/113724.jpg",
    "synopsis": "The day is as normal as it can be in high school as the students peacefully go about their everyday activities until an unprecedented catastrophe strikes the school, killing every person in its wake. Guided by what seems to be a miracle, a handful of students are fortunate enough to be reincarnated into another world as nobles, princes, and other kinds of people with prestigious backgrounds.\n\nOne girl, however, is not so lucky. Being reborn as a spider of the weakest kind, she immediately experiences the hardships of her dire situation. Even so, she must press on to survive the numerous threats that endanger her life. Discovering that her new world has a system like that of an RPG, she tries her best to hunt prey and defeat monsters to level up and evolve. As she gradually grows stronger, she hopes one day her efforts will be rewarded, and that she will be granted a better life.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Comedy",
      "Fantasy"
    ],
    "themes": [
      "Isekai",
      "Reincarnation"
    ]
  },
  {
    "id": 52299,
    "type": "anime",
    "title": "Ore dake Level Up na Ken",
    "title_english": "Solo Leveling",
    "title_japanese": "俺だけレベルアップな件",
    "image": "https://cdn.myanimelist.net/images/anime/1801/142390.jpg",
    "synopsis": "Humanity was caught at a precipice a decade ago when the first gates—portals linked with other dimensions that harbor monsters immune to conventional weaponry—emerged around the world. Alongside the appearance of the gates, various humans were transformed into hunters and bestowed superhuman abilities. Responsible for entering the gates and clearing the dungeons within, many hunters chose to form guilds to secure their livelihoods.\n\nSung Jin-Woo is an E-rank hunter dubbed as the weakest hunter of all mankind. While exploring a supposedly safe dungeon, he and his party encounter an unusual tunnel leading to a deeper area. Enticed by the prospect of treasure, the group presses forward, only to be confronted with horrors beyond their imagination. Miraculously, Jin-Woo survives the incident and soon finds that he now has access to an interface visible only to him. This mysterious system promises him the power he has long dreamed of—but everything comes at a price.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": [
      "Adult Cast",
      "Urban Fantasy"
    ]
  },
  {
    "id": 3588,
    "type": "anime",
    "title": "Soul Eater",
    "title_english": "Soul Eater",
    "title_japanese": "ソウルイーター",
    "image": "https://cdn.myanimelist.net/images/anime/1071/149486.jpg",
    "synopsis": "Death City is home to the famous Death Weapon Meister Academy (Shibusen), a technical academy headed by the Shinigami—Lord Death himself. Its mission: to raise Death Scythes for the Shinigami to wield against the many evils of their fantastical world. These Death Scythes, however, are not made from physical weapons; rather, they are born from human hybrids who have the ability to transform their bodies into Demon Weapons, and only after they have consumed the souls of 99 evil beings and one witch's soul.\n\nSoul Eater Evans, a Demon Scythe who only seems to care about what's cool, aims to become a Death Scythe with the help of his straight-laced wielder, or meister, Maka Albarn. The contrasting duo work and study alongside the hot headed Black☆Star and his caring weapon Tsubaki, as well as the Shinigami's own son, Death the Kid, an obsessive-compulsive dual wielder of twin pistols Patty and Liz.\n\nAs they take on missions to collect souls and protect the city from the world's threats, the Shibusen students work together under the snickering sun to become sounder in mind, body, and soul.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy",
      "Fantasy"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 51122,
    "type": "anime",
    "title": "Ookami to Koushinryou: Merchant Meets the Wise Wolf",
    "title_english": "Spice and Wolf: Merchant Meets the Wise Wolf",
    "title_japanese": "狼と香辛料 MERCHANT MEETS THE WISE WOLF",
    "image": "https://cdn.myanimelist.net/images/anime/1059/142414.jpg",
    "synopsis": "With a cartload of fur pelts in tow, traveling merchant Kraft Lawrence stops by the village of Pasloe. According to local folklore, centuries ago, one of the villagers made a promise with the wolf deity Holo, who swore to bless Pasloe with bountiful harvests of wheat. Yet, as time passed, such stories became little more than relics of the past.\n\nAfter quickly finishing his business in the village, Lawrence sets out to his next destination. His journey, however, takes an unexpected turn when he discovers a nude, animal-eared girl sleeping among his pelts. Even more surprisingly, the youthful-looking woman claims to be Holo—the wolf of legend.\n\nHolo wishes to return to her hometown in the north, and though their first encounter is rocky, she convinces Lawrence to accompany her on her travels. In return, she vows to earn her keep, using her quick wits and lifetime of experience to help her newfound companion in his dealings. As they continue their journey, Lawrence and Holo take advantage of whatever economic opportunities they come across, often landing in situations that put both their business skills and their relationship to the test.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Adventure",
      "Drama",
      "Romance",
      "Supernatural"
    ],
    "themes": [
      "Adult Cast"
    ]
  },
  {
    "id": 50265,
    "type": "anime",
    "title": "Spy x Family",
    "title_english": "",
    "title_japanese": "SPY×FAMILY",
    "image": "https://cdn.myanimelist.net/images/anime/1441/122795.jpg",
    "synopsis": "Corrupt politicians, frenzied nationalists, and other warmongering forces constantly jeopardize the thin veneer of peace between neighboring countries Ostania and Westalis. In spite of their plots, renowned spy and master of disguise \"Twilight\" fulfills dangerous missions one after another in the hope that no child will have to experience the horrors of war.\n\nIn the bustling Ostanian city of Berlint, Twilight dons the alias of \"Loid Forger,\" an esteemed psychiatrist. However, his true intention is to gather intelligence on prominent politician Donovan Desmond, who only appears rarely in public at his sons' school: the prestigious Eden Academy. Enlisting the help of unmarried city hall clerk Yor Briar to act as his wife and adopting the curious six-year-old orphan Anya as his daughter, Loid enacts his master plan. He will enroll Anya in Eden Academy, where Loid hopes she will excel and give him the opportunity to meet Donovan without arousing suspicion. \n\nUnfortunately for Loid, even a man of his talents has trouble playing the figure of a loving father and husband. And just like Loid is hiding his true identity, Yor—who is an underground assassin known as \"Thorn Princess\"—and Anya—an esper who can read people's minds—have no plans to disclose their own secrets either. Although this picture-perfect family is founded on deception, the Forgers gradually come to understand that the love they share for one another trumps all else.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Award Winning",
      "Comedy"
    ],
    "themes": [
      "Childcare",
      "Super Power"
    ]
  },
  {
    "id": 53262,
    "type": "anime",
    "title": "Hoshikuzu Telepath",
    "title_english": "Stardust Telepath",
    "title_japanese": "星屑テレパス",
    "image": "https://cdn.myanimelist.net/images/anime/1020/139134.jpg",
    "synopsis": "Since childhood, 15-year-old Umika Konohoshi has been fascinated by aliens, hoping to one day voyage to outer space and befriend them. Unfortunately, this fixation has caused her peers to label her as odd, intensifying her struggle with severe social anxiety. Nevertheless, Umika's passion for the extraterrestrial persists, and she deeply believes that her true purpose is outside the confines of Earth.\n\nOn her first day of high school, Umika's wish of meeting an alien seems to have finally come true when she encounters Yuu Akeuchi—a classmate who claims to have crash-landed on Earth with no recollections of her past. Umika tries to seize this opportunity to make friends with Yuu, but her lack of confidence hinders her. Sensing Umika's distress, Yuu suddenly uses a strange power to delve deep into her mind, thus sparking a friendship that may just help Umika reach her dreams.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy"
    ],
    "themes": [
      "CGDCT",
      "School",
      "Super Power"
    ]
  },
  {
    "id": 60057,
    "type": "anime",
    "title": "Chao Neng Lifang: Chaofan Pian",
    "title_english": "The Super Cube",
    "title_japanese": "超能立方 超凡篇",
    "image": "https://cdn.myanimelist.net/images/anime/1759/145944.jpg",
    "synopsis": "In an accident, an ordinary boy, Wang Xiaoxiu, obtains a space system called \"Superpower Cube\" from a high-latitude cosmic civilization and gains extraordinary powers. When the school belle, Shen Yao, Wang Xiaoxiu’s longtime crush, confesses her love to him, the delinquent Sun Jun, who also has a crush on her, is provoked. \n\nWang Xiaoxiu resolves the crisis with his wit and extraordinary powers, but it also brings more disasters as a result. Shen Yao is taken to the world of extraordinary beings by a mysterious person, and Wang Xiaoxiu embarks on a journey to rescue her. Fighting in the bizarre universe, he finds the meaning of fairness and justice on the path to becoming a peerless powerhouse.\n\n(Source: iQIYI International)",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": []
  },
  {
    "id": 11757,
    "type": "anime",
    "title": "Sword Art Online",
    "title_english": "Sword Art Online",
    "title_japanese": "ソードアート・オンライン",
    "image": "https://cdn.myanimelist.net/images/anime/11/39717.jpg",
    "synopsis": "Ever since the release of the innovative NerveGear, gamers from all around the globe have been given the opportunity to experience a completely immersive virtual reality. Sword Art Online (SAO), one of the most recent games on the console, offers a gateway into the wondrous world of Aincrad, a vivid, medieval landscape where users can do anything within the limits of imagination. With the release of this worldwide sensation, gaming has never felt more lifelike.\n\nHowever, the idyllic fantasy rapidly becomes a brutal nightmare when SAO's creator traps thousands of players inside the game. The \"log-out\" function has been removed, with the only method of escape involving beating all of Aincrad's one hundred increasingly difficult levels. Adding to the struggle, any in-game death becomes permanent, ending the player's life in the real world.\n\nWhile Kazuto \"Kirito\" Kirigaya was fortunate enough to be a beta-tester for the game, he quickly finds that despite his advantages, he cannot overcome SAO's challenges alone. Teaming up with Asuna Yuuki and other talented players, Kirito makes an effort to face the seemingly insurmountable trials head-on. But with difficult bosses and threatening dark cults impeding his progress, Kirito finds that such tasks are much easier said than done.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy",
      "Romance"
    ],
    "themes": [
      "Video Game"
    ]
  },
  {
    "id": 49778,
    "type": "anime",
    "title": "Kijin Gentoushou",
    "title_english": "Sword of the Demon Hunter: Kijin Gentosho",
    "title_japanese": "鬼人幻燈抄",
    "image": "https://cdn.myanimelist.net/images/anime/1722/148906.jpg",
    "synopsis": "After Jinta and Suzune ran away from their home as children, they were taken in by Motoharu—the virtuous sentinel of Kadono Village—and his daughter, Shirayuki. The settlement was ruled by its shrine maiden, Itsukihime, whom only a select few were allowed to interact with. When Itsukihime passed away, Shirayuki was appointed in her place. Wishing to stay in contact with her, Jinta worked diligently for years and was finally selected as the next sentinel.\n\nAs the protector of the village, Jinta's duty is to eliminate any threats. One day, he encounters a demon in a nearby forest. At the end of the battle, the demon makes a proclamation about the destined ruler of all demonkind. He attaches his severed arm to Jinta, turning him into an unaging demon man. By the time Jinta comes to, Kadono is on fire. Suzune has transformed into the demon from the divination, and due to a series of misunderstandings, she murders Shirayuki and flees.\n\nDevastated, Jinta cannot forgive Suzune for her actions; he departs on a journey to find her. As Jinta travels around Japan across the eras, he endeavors to protect as many people as possible from aggressive demons. In his quiet moments, he contemplates what he should do when he once again faces his childhood friend.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Fantasy"
    ],
    "themes": [
      "Historical"
    ]
  },
  {
    "id": 54714,
    "type": "anime",
    "title": "Kimi no Koto ga Daidaidaidaidaisuki na 100-nin no Kanojo",
    "title_english": "The 100 Girlfriends Who Really, Really, Really, Really, Really Love You",
    "title_japanese": "君のことが大大大大大好きな100人の彼女",
    "image": "https://cdn.myanimelist.net/images/anime/1812/136764.jpg",
    "synopsis": "Rentarou Aijou has it all: looks, intelligence, athletic skill, and popularity with peers and mentors alike. Unfortunately, none of these qualities help Rentarou with his love life. On the day of his middle school graduation, he is once again turned down by a girl he confesses to, earning his one-hundredth rejection in a row. Down on his luck, he goes to a matchmaking shrine and wishes to finally get a girlfriend in high school.\n\nWhen the god of the shrine suddenly appears before him, Rentarou is told he will meet an astronomical total of one hundred soulmates in high school. Though Rentarou initially does not take this foretelling seriously, his doubts disappear when, on the first day of school, he meets two of these soulmates—Hakari Hanazono and Karane Inda—who both confess to him. With fated encounters and love confessions galore, Rentarou's life is about to get a lot more exciting.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Harem",
      "Parody",
      "School"
    ]
  },
  {
    "id": 50739,
    "type": "anime",
    "title": "Otonari no Tenshi-sama ni Itsunomanika Dame Ningen ni Sareteita Ken",
    "title_english": "The Angel Next Door Spoils Me Rotten",
    "title_japanese": "お隣の天使様にいつの間にか駄目人間にされていた件",
    "image": "https://cdn.myanimelist.net/images/anime/1240/133638.jpg",
    "synopsis": "Mahiru Shiina is worthy of her nickname \"Angel\": she is a divine beauty loved by all, and she excels in both academics and athletics. Shiina lives in an entirely different world from Amane Fujimiya, her next-door neighbor. Despite living so close together, they have never spoken once. But their silence is broken when Fujimiya spots Shiina gloomily sitting on a swing amidst a heavy rainstorm and lends her his umbrella. \n\nWhen Fujimiya catches a cold the next day, Shiina wishes to return the favor for the umbrella by nursing him back to health. Believing that this would be their first and last interaction, he silently appreciates her kindness. However, Shiina—who cannot help but worry about Fujimiya's lack of tidiness and proper nutrition—begins to cook and clean for him. As the unlikely pair spend time together in Fujimiya's apartment, they explore the true nature of their relationship and the gentle emotions that emerge from it.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 53450,
    "type": "anime",
    "title": "Xian Wang de Richang Shenghuo 4",
    "title_english": "The Daily Life of the Immortal King 4",
    "title_japanese": "仙王的日常生活 第四季",
    "image": "https://cdn.myanimelist.net/images/anime/1443/138753.jpg",
    "synopsis": "Fourth season of Xian Wang de Richang Shenghuo.",
    "genres": [
      "Adventure",
      "Comedy",
      "Fantasy"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 52578,
    "type": "anime",
    "title": "Boku no Kokoro no Yabai Yatsu",
    "title_english": "The Dangers in My Heart",
    "title_japanese": "僕の心のヤバイやつ",
    "image": "https://cdn.myanimelist.net/images/anime/1545/133887.jpg",
    "synopsis": "Kyoutarou Ichikawa may look like a shy and reserved middle school student, but deep within his heart is a bloodthirsty killer. His ultimate desire is to see his classmate Anna Yamada's beautiful face writhing in pain before he ends her life. But this fantasy may never come to fruition, as Ichikawa starts to see an entirely different side to Yamada.\n\nOften seeking refuge in the library, Ichikawa frequently runs into Yamada. It is during these encounters that Ichikawa realizes his model classmate is actually an airhead who can never read the room. As they spend more time together, the boy cannot help but feel not only a sense of endearment toward the very girl he wishes to murder but also a desire to protect her at all costs. Is it possible that this sudden change in Ichikawa's perspective could lead to something more?\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 53632,
    "type": "anime",
    "title": "Yumemiru Danshi wa Genjitsushugisha",
    "title_english": "The Dreaming Boy is a Realist",
    "title_japanese": "夢見る男子は現実主義者",
    "image": "https://cdn.myanimelist.net/images/anime/1239/134810.jpg",
    "synopsis": "Wataru Sajou is infamous in his school for persistently seeking the attention of his crush, Aika Natsukawa. His usual day revolves around shadowing her and confessing his undying love at every turn. However, a moment of epiphany leads Wataru to relinquish his childish behavior and face the reality that she will never return his one-sided feelings. He distances himself from Aika and spends his newfound spare time with his friends and in the company of other lovely girls.\n\nAs Wataru moves on, Aika starts approaching him in unusually suggestive ways—making him question whether giving up on his love was the right decision after all.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 48316,
    "type": "anime",
    "title": "Kage no Jitsuryokusha ni Naritakute!",
    "title_english": "The Eminence in Shadow",
    "title_japanese": "陰の実力者になりたくて！",
    "image": "https://cdn.myanimelist.net/images/anime/1091/128729.jpg",
    "synopsis": "For as long as he can remember, Minoru Kagenou has been fixated on becoming as strong as possible, which has led him to undertake all kinds of rigorous training. This wish, however, does not stem from a desire to be recognized by others; rather, Minoru does everything he can to blend in with the crowd. So, while pretending to be a completely average student during the day, he arms himself with a crowbar and ruthlessly thrashes local biker gangs at night. Yet when Minoru finds himself in a truck accident, his ambitions seemingly come to a sudden end. In his final moments, he laments his powerlessness—no matter how much he trained, there was nothing he could do to overcome his human limitations.\n\nBut instead of dying, Minoru reawakens as Cid, the second child of the noble Kagenou family, in another world—one where magic is commonplace. With the power he so desired finally within his grasp, he dons the moniker \"Shadow\" and establishes Shadow Garden: a group whose sole purpose is to combat the enigmatic Cult of Diablos, an organization born from Cid's imagination. However, as Shadow Garden grows in both membership and influence, it becomes increasingly apparent that the Cult of Diablos is not as fictional as Cid had intended.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy",
      "Fantasy"
    ],
    "themes": [
      "Isekai",
      "Reincarnation"
    ]
  },
  {
    "id": 166865,
    "type": "manga",
    "title": "The Extra's Academy Survival Guide",
    "title_english": "The Extra's Academy Survival Guide",
    "title_japanese": "아카데미에서 살아남기",
    "image": "https://cdn.myanimelist.net/images/manga/2/296379.jpg",
    "synopsis": "Ed Rothstaylor is a third-rate villain in a game, disowned by his family and kicked out of the dormitory for his misdeeds. One day, our main character wakes up as this very Ed, and realizes he must earn a scholarship so he can graduate and be set for life. Now living in the woods, he resolves to keep away from the protagonists, but four of the female leads just won't leave him alone. Not only that, his presence starts to change the timeline and events of the game! Can Ed help the story progress while staying out of the limelight?\n\n(Source: Webtoon Entertainment)",
    "genres": [
      "Action",
      "Fantasy"
    ],
    "themes": [
      "Isekai",
      "School"
    ]
  },
  {
    "id": 54846,
    "type": "anime",
    "title": "Aishang Ta de Liyou",
    "title_english": "The Girl Downstairs",
    "title_japanese": "爱上她的理由",
    "image": "https://cdn.myanimelist.net/images/anime/1070/134906.jpg",
    "synopsis": "The day Lee Joon joins Minsong University to reunite with Kim Margo, his high school crush, he is attacked by his new neighbor Lee Duna, a gorgeous former idol. Violent and impulsive, Duna turns Joon's world upside down. Later, to Joon's confusion, Margo seems incapable of making time to meet with him. To add to his dismay, Joon meets fellow student Choi Ira at a party. She becomes enamored with him after the pair partake in a risqué game. As Joon progressively discovers the truth about Duna's troubled past and Margo's harsh family conditions, he tries to sort out his tangled feelings.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "Adult Cast",
      "Love Polygon"
    ]
  },
  {
    "id": 54234,
    "type": "anime",
    "title": "Suki na Ko ga Megane wo Wasureta",
    "title_english": "The Girl I Like Forgot Her Glasses",
    "title_japanese": "好きな子がめがねを忘れた",
    "image": "https://cdn.myanimelist.net/images/anime/1582/136325.jpg",
    "synopsis": "Kaede Komura is in love. After being seated next to the airheaded Ai Mie for the past three days, Komura cannot help but be attracted to his bespectacled classmate. Although he has yet to have a proper conversation with Mie, Komura dreams of the day when she will look his way.\n\nOne day, Komura notices that his seatmate is not wearing her glasses, learning by questioning Mie that she forgot them and has a tendency of doing so. When he sees her struggle, a concerned Komura takes it upon himself to help his crush. As the boy offers his assistance to Mie day by day, her reasons for constantly losing her glasses slowly evolve from the answer she initially gave.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Love Status Quo",
      "School"
    ]
  },
  {
    "id": 40496,
    "type": "anime",
    "title": "Maou Gakuin no Futekigousha: Shijou Saikyou no Maou no Shiso, Tensei shite Shison-tachi no Gakkou e Kayou",
    "title_english": "The Misfit of Demon King Academy",
    "title_japanese": "魔王学院の不適合者 ～史上最強の魔王の始祖、転生して子孫たちの学校へ通う～",
    "image": "https://cdn.myanimelist.net/images/anime/1126/108573.jpg",
    "synopsis": "In the distant past, a war between humans and demons brought about widespread chaos and bloodshed. To put an end to this seemingly endless conflict, Demon King Anos Voldigoad willingly sacrificed his life, hoping to be reborn in a peaceful future.\n\nIn preparation for their king's return, the demon race created the Demon King Academy, an elite institution tasked with determining Anos' identity when he reawakens. He reincarnates two millennia later, but to his surprise, he soon learns that the level of magic in the world has drastically waned during his absence. Moreover, when he enrolls at the academy to reclaim his rightful title, he finds out that demonkind remembers him differently. His personality, his deeds, and even his legacy are all falsified—masked beneath the name of an impostor. This \"lack\" of common knowledge renders him the academy's outlier—a misfit never before seen in history.\n\nDespite these drawbacks, Anos remains unfazed. As he sets out to uncover those altering his glorious past, he takes it upon himself to make his descendants recognize that their ruler has finally returned.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Fantasy"
    ],
    "themes": [
      "Reincarnation",
      "School"
    ]
  },
  {
    "id": 13759,
    "type": "anime",
    "title": "Sakura-sou no Pet na Kanojo",
    "title_english": "The Pet Girl of Sakurasou",
    "title_japanese": "さくら荘のペットな彼女",
    "image": "https://cdn.myanimelist.net/images/anime/4/43643.jpg",
    "synopsis": "At Suimei High, the Sakura-sou dormitory is infamous for housing the school's most notorious delinquents. Thus, when the relatively tame Sorata Kanda is transferred to the dorm, escaping this insane asylum becomes his foremost goal. Trapped there for the time being, he must learn how to deal with his fellow residents, including bubbly animator Misaki Kamiigusa, charming playboy writer Jin Mitaka, and the ever-reclusive Ryuunosuke Akasaka. Surrounded by weirdness, Sorata frequently finds respite in his interactions with his one \"normal\" friend, aspiring voice actress Nanami Aoyama.\n\nWhen Mashiro Shiina—a new foreign exchange student—joins the dormitory, Sorata is instantly enraptured by her beauty. Underneath her otherworldly appearance, Mashiro is an autistic savant, capable of world-renowned brilliance in her art, yet unable to perform simple daily tasks. After Sorata ends up in charge of taking care of Mashiro, the two inevitably grow closer, with Sorata's initial desire to escape the dormitory becoming a forgotten goal.\n\nDespite their eccentricities, every resident is incredible in their own field, leaving Sorata to contend with his own lack of any particular skill. With brilliance all around him, he thus strives to become an equal to their talent. Revolving around the hardships and joys of its colorful cast, Sakura-sou no Pet na Kanojo is a heartwarming coming-of-age tale of friendship, love, ambition, and heartbreak—through the lens of an ordinary person surrounded by the extraordinary.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 38101,
    "type": "anime",
    "title": "5-toubun no Hanayome",
    "title_english": "The Quintessential Quintuplets",
    "title_japanese": "五等分の花嫁",
    "image": "https://cdn.myanimelist.net/images/anime/1819/97947.jpg",
    "synopsis": "Fuutarou Uesugi is an ace high school student, but leads an otherwise tough life. His standoffish personality and reclusive nature have left him friendless, and his father is debt-ridden, forcing his family to scrape by.\n\nOne day during his lunch break, Uesugi argues with a female transfer student who has claimed \"his seat,\" leading both of them to dislike each other. That same day, he is presented with a golden opportunity to clear his family's debt: a private tutoring gig for a wealthy family's daughter, with a wage of five times the market price. He accepts the proposal, but is horrified to discover that the client, Itsuki Nakano, is the girl he confronted earlier! \n\nAfter unsuccessfully trying to get back on Itsuki's good side, Uesugi finds out that his problems don't end there: Itsuki is actually a quintuplet, so in addition to her, he must also tutor her sisters—Miku, Yotsuba, Nino, and Ichika—who, despite the very real threat of flunking, want nothing to do with a tutor. However, his family's livelihood is on the line so Uesugi pushes on, adamant in his resolve to rid the sisters of their detest for studying and successfully lead them to graduation.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": [
      "Harem",
      "School"
    ]
  },
  {
    "id": 35790,
    "type": "anime",
    "title": "Tate no Yuusha no Nariagari",
    "title_english": "The Rising of the Shield Hero",
    "title_japanese": "盾の勇者の成り上がり",
    "image": "https://cdn.myanimelist.net/images/anime/1490/101365.jpg",
    "synopsis": "The Four Cardinal Heroes are a group of ordinary men from modern-day Japan summoned to the kingdom of Melromarc to become its saviors. Melromarc is a country plagued by the Waves of Catastrophe that have repeatedly ravaged the land and brought disaster to its citizens for centuries. The four heroes are respectively bestowed a sword, spear, bow, and shield to vanquish these Waves. Naofumi Iwatani, an otaku, becomes cursed with the fate of being the \"Shield Hero.\" Armed with only a measly shield, Naofumi is belittled and ridiculed by his fellow heroes and the kingdom's people due to his weak offensive capabilities and lackluster personality.\n\nWhen the heroes are provided with resources and comrades to train with, Naofumi sets out with the only person willing to train alongside him, Malty Melromarc. He is soon betrayed by her, however, and becomes falsely accused of taking advantage of her. Naofumi then becomes heavily discriminated against and hated by the people of Melromarc for something he didn't do. With a raging storm of hurt and mistrust in his heart, Naofumi begins his journey of strengthening himself and his reputation. Further along however, the difficulty of being on his own sets in, so Naofumi buys a demi-human slave on the verge of death named Raphtalia to accompany him on his travels.\n\nAs the Waves approach the kingdom, Naofumi and Raphtalia must fight for the survival of the kingdom and protect the people of Melromarc from their ill-fated future.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Drama",
      "Fantasy"
    ],
    "themes": [
      "Isekai"
    ]
  },
  {
    "id": 47790,
    "type": "anime",
    "title": "Sekai Saikou no Ansatsusha, Isekai Kizoku ni Tensei suru",
    "title_english": "The World's Finest Assassin Gets Reincarnated in Another World as an Aristocrat",
    "title_japanese": "世界最高の暗殺者、異世界貴族に転生する",
    "image": "https://cdn.myanimelist.net/images/anime/1928/117620.jpg",
    "synopsis": "The world's greatest assassin had sworn lifelong allegiance to the organization that raised him. However, despite his loyalty, that very same organization takes action to silence him, ultimately leading to his demise. Drowning in frustration and regrets he can no longer suppress, he finds himself in an audience with a goddess attracted by his exceptional skills. The goddess offers him reincarnation into a magnificent world of swords and magic so he can perform a crucial mission: prevent that world's destruction by slaying its hero.\n\nAccepting the goddess' request, he is reborn as Lugh Tuatha Dé, the son of a noble family of assassins serving the Alvan Kingdom. Under the guidance of his father, Lugh learns new assassination techniques that significantly differ from the cold-blooded and unsympathetic killing style of his previous life. Furthermore, his other talents bloom, allowing him to meet new allies and acquaintances. Even so, Lugh knows that his efforts are far from adequate, because a monumental adversary such as the hero can only be defeated with perfection.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Drama",
      "Fantasy",
      "Mystery",
      "Romance"
    ],
    "themes": [
      "Isekai",
      "Reincarnation"
    ]
  },
  {
    "id": 687,
    "type": "anime",
    "title": "Tokyo Mew Mew",
    "title_english": "Mew Mew Power",
    "title_japanese": "東京ミュウミュウ",
    "image": "https://cdn.myanimelist.net/images/anime/4/89298.jpg",
    "synopsis": "Ichigo Momomiya expected her date with her crush, Masaya Aoyama, to have a more romantic ending than her falling asleep after she sees a vision of a cat entering her body. Things get even stranger when, the next day, she begins displaying cat-like behaviors such as an intense craving for fish. When Masaya is attacked by a monster, she discovers that she is able to transform into the cat-eared magical girl, Mew Ichigo.\n \nAfter she saves Masaya, two researchers named Ryou Shirogane and Keiichiro Akasaka approach her and reveal they had injected her with Iriomote Cat DNA in order to create a magical girl that can save the world from aliens. Ichigo is tasked with fighting these monsters, but saving the world proves to be just too much for Ichigo to handle by herself. Fortunately, she learns that there are four other girls just like her, and now, Ichigo must find them quickly before the aliens completely take over the planet.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Romance",
      "Sci-Fi"
    ],
    "themes": [
      "Mahou Shoujo"
    ]
  },
  {
    "id": 50273,
    "type": "anime",
    "title": "Tomodachi Game",
    "title_english": "Tomodachi Game",
    "title_japanese": "トモダチゲーム",
    "image": "https://cdn.myanimelist.net/images/anime/1247/121345.jpg",
    "synopsis": "High school student Yuuichi Katagiri cherishes his close circle of friends, composed of four classmates: Yutori Kokorogi, Shiho Sawaragi, Makoto Shibe, and Tenji Mikasa. However, when the funds for the upcoming school trip are stolen, the incident causes Shiho and Makoto—who had been tasked with collecting the money—to distance themselves from the rest of their class.\n\nSoon after, Yuuichi and his friends are deceived into meeting up and knocked unconscious by unknown assailants. After waking, the group find themselves confined in a white room with controversial figure Manabu-kun, who reveals that one of the five has gathered them together to clear their personal debt of twenty million yen. To pay off the amount, they must participate in a variety of psychological games that will test the true nature of their friendship and humanity.\n\nDistressed and isolated from the outside world, Yuuichi and his friends need to cooperate to complete the games. But as their concealed feelings and problematic pasts begin to surface, their seemingly unbreakable bond may soon shatter into irreparable pieces.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Suspense"
    ],
    "themes": [
      "High Stakes Game",
      "Psychological",
      "Strategy Game"
    ]
  },
  {
    "id": 41389,
    "type": "anime",
    "title": "Tonikaku Kawaii",
    "title_english": "Tonikawa: Over The Moon For You",
    "title_japanese": "トニカクカワイイ",
    "image": "https://cdn.myanimelist.net/images/anime/1613/108722.jpg",
    "synopsis": "Nasa Yuzaki is determined to leave his name in the history books. Ranking first in the national mock exam and aiming for a distinguished high school, he is certain that he has his whole life mapped out. However, fate is a fickle mistress. On his way home one snowy evening, Nasa's eyes fall upon a peerless beauty across the street. Bewitched, Nasa tries to approach her—only to get blindsided by an oncoming truck. \n\nThankfully, his life is spared due to the girl's swift action. Bleeding by the side of an ambulance, he watches as the girl walks away under the moonlight—reminiscent of Princess Kaguya leaving for the moon. Refusing to let this chance meeting end, he forces his crippled body to chase after her and asks her out. Surprised by his foolhardiness and pure resolve, the girl accepts his confession under a single condition: they can only be together if he marries her!\n\n[Written by MAL Rewrite]",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "themes": []
  },
  {
    "id": 4224,
    "type": "anime",
    "title": "Toradora!",
    "title_english": "Toradora!",
    "title_japanese": "とらドラ！",
    "image": "https://cdn.myanimelist.net/images/anime/13/22128.jpg",
    "synopsis": "Ryuuji Takasu is a gentle high school student with a love for housework; but in contrast to his kind nature, he has an intimidating face that often gets him labeled as a delinquent. On the other hand is Taiga Aisaka, a small, doll-like student, who is anything but a cute and fragile girl. Equipped with a wooden katana and feisty personality, Taiga is known throughout the school as the \"Palmtop Tiger.\"\n\nOne day, an embarrassing mistake causes the two students to cross paths. Ryuuji discovers that Taiga actually has a sweet side: she has a crush on the popular vice president, Yuusaku Kitamura, who happens to be his best friend. But things only get crazier when Ryuuji reveals that he has a crush on Minori Kushieda—Taiga's best friend!\n\nToradora! is a romantic comedy that follows this odd duo as they embark on a quest to help each other with their respective crushes, forming an unlikely alliance in the process.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "Love Polygon",
      "School"
    ]
  },
  {
    "id": 40615,
    "type": "anime",
    "title": "Umibe no Étranger",
    "title_english": "The Stranger by the Shore",
    "title_japanese": "海辺のエトランゼ",
    "image": "https://cdn.myanimelist.net/images/anime/1668/108792.jpg",
    "synopsis": "Shun Hashimoto is an openly gay aspiring novelist living in Okinawa who was abandoned by his parents after coming out to them. Mio Chibana is a reserved, orphaned high school student, often found spending his time by the sea. One day, the two meet on the beach, and Shun is instantly captivated by Mio. The days fly by as they slowly begin to grow closer until Mio suddenly announces that he has to leave for the mainland.\n\nThree years pass before a 20-year-old Mio returns to Okinawa to confess his love to Shun. However, in those three years, Shun's life has changed. Will he be able to accept Mio's feelings and make such a commitment?\n\n[Written by MAL Rewrite]",
    "genres": [
      "Boys Love"
    ],
    "themes": []
  },
  {
    "id": 52741,
    "type": "anime",
    "title": "Undead Unluck",
    "title_english": "",
    "title_japanese": "アンデッドアンラック",
    "image": "https://cdn.myanimelist.net/images/anime/1136/138410.jpg",
    "synopsis": "With the conclusion of her favorite romance manga, Fuuko Izumo is ready to end her life of misery and loneliness having long accepted her fate of never being able to experience passionate love like fictional characters. Cursed with \"unluck,\" anyone Fuuko touches is in grave danger of experiencing unimaginable calamity.\n\nWhile the possibility of imminent danger would have most sane people run in the opposite direction, Undead has other ideas. He is an immortal being with superhuman regenerative powers desperately seeking death, which has always eluded him. When their paths finally cross, Undead sees an opportunity to finally end his suffering by using Fuuko's unluck.\n\nBut before Undead can unlock the full potential of Fuuko's power to trigger the final devastating blow, the duo must first fend off a murderous secret organization hell-bent on exterminating those with special abilities.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Comedy"
    ],
    "themes": [
      "Super Power"
    ]
  },
  {
    "id": 51213,
    "type": "anime",
    "title": "Kinsou no Vermeil: Gakeppuchi Majutsushi wa Saikyou no Yakusai to Mahou Sekai wo Tsukisusumu",
    "title_english": "Vermeil in Gold",
    "title_japanese": "金装のヴェルメイユ ～崖っぷち魔術師は最強の厄災と魔法世界を突き進む～",
    "image": "https://cdn.myanimelist.net/images/anime/1561/125302.jpg",
    "synopsis": "Alto Goldfilled, a diligent student at the Ortigia Academy of Magic, aspires to become a powerful sorcerer. But he is unable to become one as, despite his excellent grades and strong commitment to his studies, he fails his summoning class. With the threat of repeating a year hanging over his head, Alto tries following an old, worn-out grimoire in a desperate attempt to resolve his situation.\n\nTo his surprise, he succeeds and summons a powerful demon named Vermeil. As a sign of gratitude for releasing her, Vermeil agrees to become Alto's familiar, sealing their relationship with a deep kiss. Little does Alto know what else he is capable of and what Vermeil's past hides.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Fantasy",
      "Ecchi"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 37521,
    "type": "anime",
    "title": "Vinland Saga",
    "title_english": "",
    "title_japanese": "ヴィンランド・サガ",
    "image": "https://cdn.myanimelist.net/images/anime/1500/103005.jpg",
    "synopsis": "Young Thorfinn grew up listening to the stories of old sailors that had traveled the ocean and reached the place of legend, Vinland. It's said to be warm and fertile, a place where there would be no need for fighting—not at all like the frozen village in Iceland where he was born, and certainly not like his current life as a mercenary. War is his home now. Though his father once told him, \"You have no enemies, nobody does. There is nobody who it's okay to hurt,\" as he grew, Thorfinn knew that nothing was further from the truth.\n\nThe war between England and the Danes grows worse with each passing year. Death has become commonplace, and the viking mercenaries are loving every moment of it. Allying with either side will cause a massive swing in the balance of power, and the vikings are happy to make names for themselves and take any spoils they earn along the way. Among the chaos, Thorfinn must take his revenge and kill Askeladd, the man who murdered his father. The only paradise for the vikings, it seems, is the era of war and death that rages on.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Adventure",
      "Drama"
    ],
    "themes": [
      "Gore",
      "Historical"
    ]
  },
  {
    "id": 33352,
    "type": "anime",
    "title": "Violet Evergarden",
    "title_english": "Violet Evergarden",
    "title_japanese": "ヴァイオレット・エヴァーガーデン",
    "image": "https://cdn.myanimelist.net/images/anime/1795/95088.jpg",
    "synopsis": "The Great War finally came to an end after four long years of conflict; fractured in two, the continent of Telesis slowly began to flourish once again. Caught up in the bloodshed was Violet Evergarden, a young girl raised for the sole purpose of decimating enemy lines. Hospitalized and maimed in a bloody skirmish during the War's final leg, she was left with only words from the person she held dearest, but with no understanding of their meaning.\n\nRecovering from her wounds, Violet starts a new life working at CH Postal Services after a falling out with her new intended guardian family. There, she witnesses by pure chance the work of an \"Auto Memory Doll,\" amanuenses that transcribe people's thoughts and feelings into words on paper. Moved by the notion, Violet begins work as an Auto Memory Doll, a trade that will take her on an adventure, one that will reshape the lives of her clients and hopefully lead to self-discovery.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama"
    ],
    "themes": []
  },
  {
    "id": 54233,
    "type": "anime",
    "title": "Sasayaku You ni Koi wo Utau",
    "title_english": "Whisper Me a Love Song",
    "title_japanese": "ささやくように恋を唄う",
    "image": "https://cdn.myanimelist.net/images/anime/1455/141858.jpg",
    "synopsis": "Himari Kino is a cheerful and outgoing girl who is able to make friends with anyone she wants. When she enrolls in high school and attends the freshman opening ceremony, Himari falls in love with Yori Asanagi, a reserved upperclassman, during Yori's band performance. After the show, Himari blurts out her love, but Yori is inexperienced when it comes to romance.\n\nYori, who did not expect this outcome at all, looks for answers from her friends and music. She decides to respond to Himari's confession, and to her surprise, Yori discovers that Himari fell in love with her music and performance rather than Yori as a person.\n\nDespite the shock, Yori desires to make Himari truly fall in love with her. The duo spend time together after school on the rooftop, where Yori usually plays her guitar with hopes to change Himari's feelings for her.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Girls Love"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 54900,
    "type": "anime",
    "title": "Wind Breaker",
    "title_english": "Wind Breaker",
    "title_japanese": "WIND BREAKER",
    "image": "https://cdn.myanimelist.net/images/anime/1438/141816.jpg",
    "synopsis": "From an early age, Haruka Sakura was made an outcast due to his unconventional appearance and lack of social skills. However, the rough treatment turned him into a proficient fighter, which is now the only thing he prides himself on. Starting at Furin High School, where it is rumored that strength is valued over academics, Sakura has only one goal—taking the top spot.\n\nInvolved in a street brawl the day before his enrollment, Sakura happens to meet a group of his future schoolmates. Instead of the usual rejection, they fight alongside him, demonstrating that what the school actually cares about is protecting the town of Makochi from any harm—hence why the students call themselves \"Bofurin.\" Surprised by the support and appreciation of the townspeople, Sakura has a hard time accepting their goodwill.\n\nThough unfamiliar with kindness being shown to him, Sakura must learn to push past his discomfort when Bofurin is pitted against formidable enemies. After experiencing the feeling of acceptance, he finds himself fighting for the sake of others for the first time.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action"
    ],
    "themes": [
      "Delinquents",
      "School"
    ]
  },
  {
    "id": 58059,
    "type": "anime",
    "title": "Tsue to Tsurugi no Wistoria",
    "title_english": "Wistoria: Wand and Sword",
    "title_japanese": "杖と剣のウィストリア",
    "image": "https://cdn.myanimelist.net/images/anime/1281/144104.jpg",
    "synopsis": "When humanity was oppressed by mysterious foes known as the Celestial Hosts, five exceptional mages joined forces to defeat them. In fear that these formidable enemies would return, the five most powerful mages, known as the Magia Vander, built a magical dome and a tower to contain them. Since then, the five strongest mages of every generation are tasked with monitoring the dome from the top of the Wizard's Tower.\n\nInspired by this story, childhood friends Will Serfort and Elfaria Albis Serfort promised each other that they would climb to the top of the Wizard's Tower. However, now a sixth-year student at Regarden Magic Academy, Will's future looks bleak. Although Elfaria managed to join the ranks of the Magia Vander five years prior thanks to her unparalleled magical power, Will has no magical abilities whatsoever, attracting the ire of teachers and students alike.\n\nHowever, blessed with an exceptional physique, Will is able to slay monsters in the labyrinth and prevail against skilled magicians with the only aid of his sword and a few magical items. Determined to climb the Wizard's Tower at all cost, Will is determined to not let anyone or anything prevent him from keeping the promise he made to Elfaria.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Action",
      "Fantasy"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 43299,
    "type": "anime",
    "title": "Wonder Egg Priority",
    "title_english": "Wonder Egg Priority",
    "title_japanese": "ワンダーエッグ・プライオリティ",
    "image": "https://cdn.myanimelist.net/images/anime/1079/110751.jpg",
    "synopsis": "Following the suicide of her best and only friend, Koito Nagase, Ai Ooto is left grappling with her new reality. With nothing left to live for, she follows the instructions of a mysterious entity and gets roped into purchasing an egg, or specifically, a Wonder Egg.\n\nUpon breaking the egg in a world that materializes during her sleep, Ai is tasked with saving people from the adversities that come their way. In doing so, she believes that she has moved one step closer to saving her best friend. With this dangerous yet tempting opportunity in the palms of her hands, Ai enters a place where she must recognize the relationship between other people's demons and her own.\n\nAs past trauma, unforgettable regrets, and innate fears hatch in the bizarre world of Wonder Egg Priority, a young girl discovers the different inner struggles tormenting humankind and rescues them from their worst fears.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Supernatural",
      "Suspense"
    ],
    "themes": [
      "Psychological"
    ]
  },
  {
    "id": 38349,
    "type": "anime",
    "title": "Wotaku ni Koi wa Muzukashii OVA",
    "title_english": "Wotakoi: Love is Hard for Otaku OVA",
    "title_japanese": "ヲタクに恋は難しい OAD",
    "image": "https://cdn.myanimelist.net/images/anime/1892/111383.jpg",
    "synopsis": "Tarou Kabakura, a third-year high school student and captain of the boys' volleyball team, is constantly being harassed by his underclassman Hanako Koyanagi, who is in charge of the girls' team. Koyanagi insists that since the girls have a match coming up, Kabakura should give up the courts to let them practice. When he refuses, she pulls out photographic evidence exposing his secret hobby.\n\nWith the danger of his entire team finding out about his otaku interests looming over him, Kabakura agrees to hand over the volleyball courts to Koyanagi, giving her some private coaching as well. As the two grow closer, they begin to forge an everlasting bond.\n\n[Written by MAL Rewrite]\n\nThird OVA—covering the \"employee trip\" chapter(s) from the sixth tankouban volume—will be bundled with the special edition of the 11th and final volume of the manga which ships on October 14, 2021.\n\n(Source: MAL News, edited)",
    "genres": [
      "Romance"
    ],
    "themes": [
      "Adult Cast",
      "Otaku Culture",
      "Workplace"
    ]
  },
  {
    "id": 23273,
    "type": "anime",
    "title": "Shigatsu wa Kimi no Uso",
    "title_english": "Your Lie in April",
    "title_japanese": "四月は君の嘘",
    "image": "https://cdn.myanimelist.net/images/anime/1405/143284.jpg",
    "synopsis": "Kousei Arima is a child prodigy known as the \"Human Metronome\" for playing the piano with precision and perfection. Guided by a strict mother and rigorous training, Kousei dominates every competition he enters, earning the admiration of his musical peers and praise from audiences. When his mother suddenly passes away, the subsequent trauma makes him unable to hear the sound of a piano, and he never takes the stage thereafter.\n\nNowadays, Kousei lives a quiet and unassuming life as a junior high school student alongside his friends Tsubaki Sawabe and Ryouta Watari. While struggling to get over his mother's death, he continues to cling to music. His monochrome life turns upside down the day he encounters the eccentric violinist Kaori Miyazono, who thrusts him back into the spotlight as her accompanist. Through a little lie, these two young musicians grow closer together as Kaori tries to fill Kousei's world with color.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Drama",
      "Romance"
    ],
    "themes": [
      "Love Polygon",
      "Music",
      "Performing Arts",
      "School"
    ]
  },
  {
    "id": 37976,
    "type": "anime",
    "title": "Zombieland Saga",
    "title_english": "Zombie Land Saga",
    "title_japanese": "ゾンビランドサガ",
    "image": "https://cdn.myanimelist.net/images/anime/1084/128208.jpg",
    "synopsis": "Sakura Minamoto dreams of becoming an idol. Unfortunately, reality hits her like a truck, and she dies in a sudden traffic accident. Ten years later, she wakes up in Saga Prefecture, only to find herself a zombie with no memory of her past. While still coming to terms with her demise, she meets a man named Koutarou Tatsumi, who explains that he has resurrected her and six other zombie girls from different eras for the purpose of economically revitalizing Saga by means of an idol group. Assuming the role of an abrasive manager, Koutarou begins scheduling events; the girls go along with it, eventually deciding to name their idol group Franchouchou.\n\nAn absurdly comedic take on the idol genre, Zombieland Saga tells the story of Franchouchou's heartwarming struggle to save Saga Prefecture while hiding their zombie identities and rediscovering their past lives.\n\n[Written by MAL Rewrite]",
    "genres": [
      "Award Winning",
      "Comedy",
      "Supernatural"
    ],
    "themes": [
      "Idols (Female)",
      "Music",
      "Parody"
    ]
  },
  {
    "id": 37475,
    "type": "anime",
    "title": "Kishuku Gakkou no Juliet",
    "title_english": "Juliet au pensionnat",
    "title_japanese": "寄宿学校のジュリエット",
    "image": "https://cdn.myanimelist.net/images/anime/1908/93416.jpg",
    "synopsis": "We lay our scene in the fair Dahlia Academy, where two countries, both alike in dignity, come together; the 'Black Doggies' of the Eastern Nation of Touwa and 'White Cats' of the Principality of West have a longstanding feud. Romio Inuzuka and Juliet Persia, leaders of their respective dorms, seem to be bitter enemies.\n In reality, however, Romio and Juliet are hopelessly in love, but revealing their relationship would call upon the ire of all their comrades. They hide their love to maintain peace, but a clandestine relationship means they miss out on many of the activities couples get to do. As they grow closer together, Romio and Juliet must come to terms with the fact that keeping their relationship a secret may prove to be impossible.",
    "genres": [
       "Action",
       "Comedy",
       "Romance"
    ],
    "themes": [
      "School"
    ]
  },
  {
    "id": 58811,
    "type": "anime",
    "title": "Tougen Anki",
    "title_english": "Tougen Anki",
    "title_japanese": "桃源暗鬼",
    "image": "https://cdn.myanimelist.net/images/anime/1474/150666.jpg",
    "synopsis": "Long ago, demon-like creatures known as Oni butchered humans and brought on destruction solely for their own delight. A lone man named Momotarou opposed these gruesome, near-invincible monsters, but the war against them was just beginning.\nThousands of years in the future, temperamental gun enthusiast Shiki Ichinose leads a carefree life. However, after his expulsion from school, everything changes. Shiki is suddenly attacked by a man and is rescued by his adoptive father, Tsuyoshi. As the two flee, Tsuyoshi reveals that Shiki is actually a descendant of the Oni, while both he and their pursuer are from the Momotarou lineage.\nThe two Momotarou soon clash in a fierce battle, and Tsuyoshi sacrifices himself to protect Shiki. Devastated, Shiki awakens to his Oni blood that grants him immense strength at the cost of going berserk. Although the enemy escapes, Naito Mudano, an Oni teacher at Rasetsu Academy, takes an interest in Shiki. Under Mudano's guidance, Shiki must learn to control the Oni blood—if he ever hopes to avenge his father.",
    "genres": [
       "Action",
       "Fantasy"
    ],
    "themes": [
      "Mythology"
    ]
  },
  {
    "id": 34382,
    "type": "anime",
    "title": "Citrus",
    "title_english": "Citrus",
    "title_japanese": "シトラス",
    "image": "https://cdn.myanimelist.net/images/anime/11/89985.jpg",
    "synopsis": "During the summer of her freshman year of high school, Yuzu Aihara's mother remarried, forcing her to transfer to a new school. To a fashionable socialite like Yuzu, this inconvenient event is just another opportunity to make new friends, fall in love, and finally experience a first kiss. Unfortunately, Yuzu's dreams and style do not conform with her new ultrastrict, all-girls school, filled with obedient shut-ins and overachieving grade-skippers. Her gaudy appearance manages to grab the attention of Mei Aihara, the beautiful and imposing student council president, who immediately proceeds to sensually caress Yuzu's body in an effort to confiscate her cellphone.\nThoroughly exhausted from her first day, Yuzu arrives home and discovers a shocking truth—Mei is actually her new step-sister! Though Yuzu initially tries to be friendly with her, Mei's cold shoulder routine forces Yuzu to begin teasing her. But before Yuzu can finish her sentence, Mei forces her to the ground and kisses her, with Yuzu desperately trying to break free. Once done, Mei storms out of the room, leaving Yuzu to ponder the true nature of her first kiss, and the secrets behind the tortured expression in the eyes of her new sister.",
    "genres": [
       "Drama",
       "Girls Love",
       "Romance"
    ],
    "themes": [
      "School"
    ]
  }
]